{
    "band_list": [
        {
            "id": 48,
            "name": "Brass Band of the Western Reserve",
            "website": "https://www.bbwesternreserve.com/",
            "band_bio": "Formed in 1997, the Brass Band of the Western Reserve is an award winning British styled brass band performing a wide variety of music at the highest possible standard of performance and, in doing so, creating an enjoyable experience for its audience.  The band is able to perform impressively across a wide spectrum of emotions whether the music is quiet and delicate or strong and powerful.\r\nLed by Music Director Jay Wardeska, the band presents an annual Concert Series at the Medina Performing Arts Center.  Additionally, the band is delighted to accept many of the invitations it receives to perform at other locations, many of which are repeat bookings.  Prestigious concert venues have included The Amphitheater, Chautauqua Institution, Hoover Auditorium, Lakeside Chautauqua and Severance Hall, Cleveland.  Learn more at https://www.bbwesternreserve.com or check us out on twitter at  @BrassBandWR. Hear the band at BBWRYouTube",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/48/BBWR%20Band%20Photo.png",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/48/BBWR%20logo.png",
            "conductor_name": "Jay Wardeska",
            "conductor_bio": "Appointed as Music Director of the Brass Band of the Western Reserve in 2022, Jay Wardeska has been a conductor and trumpet player in Ohio for over 30 years. Currently a doctoral candidate at the Ohio State University, he earned a Master of Music in Conducting from Kent State University and a Bachelor of Music Education from the University of Mount Union. Jay currently serves as the Executive Director of the Ohio Music Education Association (OMEA) and plays trumpet with the Buckeye Brass.\r\nJay was recently named to the Arts Education Partnership Advisory Council. He was named the National Band Director of the Year by the National Association for Music Education and the U.S. Army Band.  Additional awards include the National Band Association Citation of Excellence, and selection to the U.S. Army All-American Band Directors Academy. Bands under his direction have played at many state and national events including OMEA Conferences, Ohio Band Directors Conferences, the NAfME/Disney Honors, and the U.S. Army Band’s Invitational in Washington, D.C. Jay lives in Medina with his wife Amy.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/48/Jay%20Wardeska%20.jpg",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "Albinus Variations",
                    "composer": "Etienne Crausaz",
                    "performance_slot": "CH_1"
                },
                {
                    "title": "Death or Glory",
                    "composer": "R. B. Hill",
                    "performance_slot": "CH_1"
                },
                {
                    "title": "Irish Tune from County Derry",
                    "composer": "Percy Grainger, arr Denis Wright",
                    "performance_slot": "CH_1"
                }
            ],
            "band_section": "Challenge Section",
            "contest_draw_identifiers": [
                "CH_1"
            ]
        },
        {
            "id": 9,
            "name": "Central Ohio Brass Band",
            "website": "centralohiobrass.com",
            "band_bio": "The Central Ohio Brass Band (COBB) was formed in 1989 as the Ohio Collegiate Brass Band. Today, COBB is a 501c3 non-profit organization whose members represent a diverse cross section of the Central Ohio community and a multitude of professions, including teachers, dentists, nurses, IT specialists, and a variety of business careers.\r\n\r\nCOBB competes regularly at the North American Brass Band Association (NABBA) Championships, having earned first place in the first section five times (2007, 2009, 2010, 2011, 2012). In the winter of 2009, COBB was awarded first place in the Devilish Publishing online competition based in the United Kingdom. In addition to the NABBA Championships, COBB has performed at the Butlin’s Mineworkers Open National Brass Band Festival in the United Kingdom, the Great American Brass Band Festival, the US Open Brass Band Championships, the Dublin Festival of Brass, and the International Trombone Festival.\r\n\r\nCOBB enjoys a vigorous performance schedule, frequently playing at church functions, community festivals, and with school groups to promote life-long learning as well as to foster the brass band tradition in the United States.\r\n\r\nCOBB has been hosting the Ohio Brass Arts Festival since 2007 and will continue with its 17th edition on Saturday, June 22, 2024, at Creekside in Gahanna Ohio. Come join us for our annual event as we embrace our mission and help to share brass band music with our community!",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/09/COBB%20-%20Andrew%20Wolf.JPG",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/09/COBB%20logo-2%20-%20Andrew%20Wolf.jpg",
            "conductor_name": "Matthew Henry",
            "conductor_bio": "Matthew Shane Henry, Music Director\r\n\r\nA native of Beavercreek, Ohio, Matthew Shane Henry received his Bachelor of Music Education degree with an emphasis in Jazz Studies (trumpet performance) from The Ohio State University, Columbus, Ohio. Quickly demonstrating his educational prowess, he was named the first recipient of the School of Music's Outstanding Student Teacher Award. He enjoyed a successful seven-year career as a music educator in the public schools of Ohio, prior to being offered a graduate assistantship at the Jordan College of Fine Arts of Butler University, Indianapolis, Indiana, where he pursued a Master of Music degree in orchestral and wind conducting. While at Butler, he served as Associate Conductor of the Symphonic Band and Wind Ensemble and adjunct faculty with the undergraduate conducting and music education programs. During this time, he also was active as Principal Guest Conductor with the Butler Symphony Orchestra. In addition to his conducting and teaching responsibilities, Matthew also held the position of Principal Trumpet with the Orchestra throughout his assistantship including their tour of The Republic of China (Taiwan).\r\n\r\nMaking a shift from the education realm to the professional, Matthew was offered a highly selective position with the United States Air Force’s Music program as a conductor. Major (ret.) Henry has held a wide variety of assignments over his 20-year career in the Air Force to include 11 years as Commander, Conductor & Music Director of bands worldwide. He has literally joined the Air Force and seen the world. In a combined 7 years leading bands overseas, he has visited or performed in 49 different countries throughout the Pacific, Asia, Europe, Africa, and the Middle East. He retired as Director of Staff & Associate Conductor for The United States Air Force Band, Joint Base Anacostia-Bolling, Washington DC. He remains active as a guest conductor, clinician, educator, adjudicator, and producer. Additionally, Matthew is 2/3 complete in pursuing a Doctor of Musical Arts from UNLV’s Wind Studies Division. Prior to returning to Ohio he served as a graduate assistant.\r\n\r\nC. Scott Smith, Associate Music Director\r\n\r\nC. Scott Smith joined the School of Music, Ohio University in Athens, Ohio in 1992 where he is Associate Professor of Horn and Theory and founding member of two faculty quintets: OhioBrass and OhioWinds. Prior to his tenure at O. U., Mr. Smith was Director of Bands and Assistant Professor of Horn at Susquehanna University in Selinsgrove, Pennsylvania. Prior to teaching and performing at the university level, Mr. Smith taught public school in Pennsylvania and Maine, directing concert, marching, and jazz bands and orchestras and teaching private brass and percussion students. Many of his students have become professional musicians performing internationally in symphony orchestras, military bands, and touring musical companies and teaching at both the college level and public schools.\r\n\r\nC. Scott performs with numerous regional orchestras and chamber music ensembles, presents solo recitals, and serves as guest artist, clinician, and adjudicator throughout the United States. Mr. Smith has also taught, performed, and coached ensembles at the Saarburg International Chamber Music Festival (Germany).\r\n\r\nFor 33 summers, Mr. Smith served on the faculty at New England Music Camp at the Snow Pond Center of the Arts in Sidney, Maine. During his tenure at NEMC, Mr. Smith has taught horn, performed in all large and small faculty ensembles, conducted the Concert Band, Concert Orchestra, and Symphony Band, and he organized the theory/composition and sight-singing curriculum and taught conducting.\r\n\r\nMr. Smith’s education includes a Bachelor of Science (B. S.) degree in Music Education from the University of Southern Maine, Master of Music (M. M.) in Music Theory from Michigan State University where he also began the PhD degree in Horn, Theory and Literature. He completed the requirements for a B.M. and M.M. in Horn Performance at USM and MSU, respectively. He also spent one year of residency toward the DMA in Horn performance with a conducting minor at the Hartt School of Music, University of Hartford in Hartford, CT. His horn teachers include Katherine Tolliver, Dr. Douglas G. Campbell, Thomas Newell, Neill Sanders, Louis Stout, David Jolley, and Rick Seraphinoff. His brass and wind instrument repair mentors include John Rynne, Douglas Neal, Rick Seraphinoff, Bob Barclay, Meisterbuilder, Mike Münkwitz. His conductor mentors include Dr. Jerry Bowder, Mr. Gerard Chamberlain, and Professor Stanley DeRusha.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/09/COBB-Conductor-MatthewShaneHenry%20-%20Andrew%20Wolf.jpg",
            "contact_email": "ztrombonewolf@gmail.com",
            "choice_pieces": [
                {
                    "title": "Albinus Variations",
                    "composer": "Etienne Crausaz",
                    "performance_slot": "CH_3"
                },
                {
                    "title": "Mercury",
                    "composer": "Jan Van der Roost",
                    "performance_slot": "CH_3"
                },
                {
                    "title": "Kia Manawanui",
                    "composer": "Peter Meechan",
                    "performance_slot": "CH_3"
                }
            ],
            "band_section": "Challenge Section",
            "contest_draw_identifiers": [
                "CH_3"
            ]
        },
        {
            "id": 52,
            "name": "Chesapeake Silver Cornet Brass Band",
            "website": null,
            "band_bio": "Founded in 1996, The Chesapeake Brass Band is a 35-piece brass and percussion ensemble formed in the tradition of British-style brass bands. The band is a non-profit musical group comprised of professional-level volunteer musicians from communities along the multi-state area of the Chesapeake Bay region including Maryland, Pennsylvania, New Jersey, and Delaware. The band is headquartered in Hockessin, Delaware.\r\n\r\nThe band plays a wide repertoire of music from traditional British brass band transcriptions to light classics, marches, big band/swing, jazz, and pops as well as providing a narrative on the music to add personal interest, humor, and educational value to their concerts.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/52/Chesapeak%20Band%20Photo.jpeg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/52/BestCBBLogobw.pdf",
            "conductor_name": "Russell Murray",
            "conductor_bio": "Russell Murray began his music studies with the trumpet at the age of ten. Dr. Murray earned his Bachelor of Music Education from University of Redlands and his Master of Music Education from University of North Texas. He went on to earn his PhD in Musicology from UNT and is currently Professor of Music History in the School of Music at the University of Delaware, where he is the director of the Collegium Musicum – the school’s early music ensemble. In addition to his duties as Musical Director of the Chesapeake Silver Cornet Brass Band, Dr. Murray performs with Newberry’s Victorian Cornet Band, an ensemble that recreates the sound of American concert bands of the 1800’s and 1890’s.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/52/Murray_Russell-2014-004.jpg",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "Brass Triumphant",
                    "composer": "Gareth Wood",
                    "performance_slot": "CH_8"
                },
                {
                    "title": "Castell Coch",
                    "composer": "T. J. Powell",
                    "performance_slot": "CH_8"
                },
                {
                    "title": "The Day Thou Gavest",
                    "composer": "C.C. Scholefield\tArr. Philip Wilby",
                    "performance_slot": "CH_8"
                }
            ],
            "band_section": "Challenge Section",
            "contest_draw_identifiers": [
                "CH_8"
            ]
        },
        {
            "id": 21,
            "name": "Dublin Metro Brass",
            "website": "https://dublinbands.com/bands/metro-brass/",
            "band_bio": "Dublin Metro Brass is the most recent addition to the Dublin Community Bands family, having been formed in 2018. In an area already populated by several fine brass bands, the formation of another one might appear superfluous, but the fact that 35 or so musicians eagerly gather regularly to experience the performance of brass band repertoire is testimony to the fact that Dublin Metro Brass has a valuable place. The band’s progress as a brass band has been accelerated in the last 18 months by the appointment of the vastly-experienced Dr. Keith M. Wilkinson as Musical Director. Recent highlights include placing 3rd in the Third Section of the 2023 North American Brass Band Championships and an exciting concert where they were able to feature the world-renowned trombone soloist Brett Baker.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/21/image_123650291-1%20-%20Kevin%20Pfefferle.JPG",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/21/DMB_Horz_on_White%20-%20Kevin%20Pfefferle.png",
            "conductor_name": "Keith Wilkinson",
            "conductor_bio": "Dr. Keith M. Wilkinson has been successfully directing brass bands for more than 50 years. He commenced regularly conducting while he was a student at the University of Manchester and following two periods directing prominent Salvation Army bands, he entered the highly competitive British Brass Band contesting scene in the Fall of 1976. In the following years, he enjoyed an enormous amount of success, including having the privilege of directing the first-placed band in more than 40 contests. His success has continued in this country as he has led the first-placed band on 5 occasions in different sections of the North American Brass Band Championships. Since moving to the US in 1996, he has been delighted to receive several invitations to return to Britain to conduct and following a recent appearance one commentator wrote a 'welcome return to the UK of a conductor of proven 24 carat class' (Iwan Fox, 4barsrest). Keith’s first home in the US was in northeast Ohio, and shortly after his arrival knowledge that he was living in the area led to the formation of Brass Band of the Western Reserve, a band he led with distinction until the summer of 2021. Each of the bands Keith has directed has established an outstanding reputation for their concert presentations, and these have been enhanced by the inclusion of some of his own brass band arrangements. Keith has more than 120 published arrangements with publishers in Britain, Switzerland, and the US.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/21/image_123650291%20-%20Kevin%20Pfefferle.JPG",
            "contact_email": "dmb@dublinbands.com",
            "choice_pieces": [
                {
                    "title": "Lakeland Variations",
                    "composer": "Philip Sparke",
                    "performance_slot": "CH_9"
                },
                {
                    "title": "Chicago Tribune",
                    "composer": "William Paris Chambers, arr Keith M. Wilkinson",
                    "performance_slot": "CH_9"
                },
                {
                    "title": "Be Thou My Vision",
                    "composer": "arr. Andrew Wainwright",
                    "performance_slot": "CH_9"
                }
            ],
            "band_section": "Challenge Section",
            "contest_draw_identifiers": [
                "CH_9"
            ]
        },
        {
            "id": 4,
            "name": "Dublin Silver Band",
            "website": "https://dublinbands.com/bands/silver-band/",
            "band_bio": "Originally founded in 2008 as the Ohio Brass Band, The Dublin Silver Band is made up of brass and percussion musicians from all parts of Ohio.\r\n\r\nSince 2010 DSB has steadily progressed from its first Second Section participation in North American Brass Band Association Championships in 2014 to placing first in the Second Section in 2015, then moving to the First Section in 2016, and placing first in the First Section in 2019. The band has also competed regularly in the US Open Championships, being named the Most Entertaining Band seven times, being awarded the Best New Composition or Arrangement prize six times, earning ten individual or busker awards, and winning the event in 2015.\r\n\r\nThe members of the Dublin Silver Band volunteer their time and talent because of three things they all have in common: a drive to chase perfection, a genuine affection for each other, and a passion for making connections with audiences on an emotional level. To make these connections, the band commits to performing far more than ordinary concerts, instead telling stories that engage the audience in the musical performance. It is this approach that has earned the band an international reputation.\r\n\r\nDSB has performed and competed extensively throughout the Midwest, and has traveled and performed abroad. In 2016 the band played concerts in Ireland and England before competing in Brass in Concert in Gateshead, England. In 2020 the band once again traveled to England, competing at the Butlins Festival.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/04/DSB%20NABBA%202023%20-%20Tim%20Jameson.png",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/04/SilverHorizLarge%20-%20Tim%20Jameson.jpg",
            "conductor_name": "Tim Jameson",
            "conductor_bio": "Tim Jameson has served as Music Director of the Dublin Silver Band since 2010. During that time, he has led the band to first-place finishes in both the NABBA Second and First Sections. Before his involvement with the Dublin Silver Band, Tim was the Music Director of the Brass Band of Columbus for five years, leading BBC to a first-place finish in the NABBA Championship Section in 2006.\r\n\r\nMr. Jameson is a graduate of The Ohio State University, where he studied trumpet under Tom Battenberg and conducting under Donald McGinnis, Marshall Haddock, George Hardesty, and Craig Kirchoff. He is also active as an arranger, with works published by Cimarron Music, BVD Press, and 360° Music.\r\n\r\nProfessionally, Tim is Manager of Talent Development for Ariel Corporation in Mount Vernon, Ohio.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/04/Jameson_T%20cropped%20-%20Tim%20Jameson.jpg",
            "contact_email": "timjameson1@gmail.com",
            "choice_pieces": [
                {
                    "title": "St. James - A New Beginning",
                    "composer": "Philip Harper",
                    "performance_slot": "E_5"
                },
                {
                    "title": "Glemdene",
                    "composer": "John R. Carr",
                    "performance_slot": "E_5"
                },
                {
                    "title": "Hope",
                    "composer": "Stijn Aertgeerts",
                    "performance_slot": "E_5"
                }
            ],
            "band_section": "Elite Section",
            "contest_draw_identifiers": [
                "E_5"
            ]
        },
        {
            "id": 53,
            "name": "Dublin Youth Brass Band",
            "website": null,
            "band_bio": "Dublin Youth Brass Band (DYBB) was created by the Dublin Community Bands in 2014 and provides a unique opportunity for all students to experience a traditional British Brass Band. The band started as a yearly summer workshop and in 2023 was expanded to include a winter/spring term. Less experienced players can find success with secondary and tertiary parts, while more advanced students can be challenged with solo parts and unique instruments like the soprano cornet and flugelhorn. In the Dublin Youth Brass Band, students work with and frequently play next to members of the award-winning Dublin Silver Band (DSB) and Dublin Metro Brass (DMB). These adult mentors help from within the section, run sectionals, and serve as examples of life-long music makers. DYBB is a payment optional band, which removes the barrier of finances in extracurricular music-making. All are welcome!",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/53/DYBB%20Band%20photo.jpg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/53/DYBB%20logo.png",
            "conductor_name": "Amy Schumaker Bliss",
            "conductor_bio": "Dr. Amy Schumaker Bliss began conducting the Dublin Youth Brass Band in 2023. Previously, she was co-conductor co-founder of both the Atlantic Youth Brass Band and the Rowan University Brass Band. Amy attended Capital University Conservatory of Music in Columbus where she double majored in euphonium performance and music education, studying with Dr. Thomas Zugger.  She earned her master’s degree in euphonium performance studying with Steven Mead and David Thornton at the Royal Northern College of Music in Manchester, England where she earned Honors with Distinction in Performance. In 2015, she graduated from Rutgers University as the school's first doctoral euphonium student, studying with Dr. Stephen Arthur Allen and Aaron VanderWeele.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/53/Amy%20Bliss.png",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "The Liberty Bell March",
                    "composer": "John Philip Sousa Arr. Lawrence Killian",
                    "performance_slot": "EX_10"
                },
                {
                    "title": "Early One Morning",
                    "composer": "English Folksong Arr. David Marlatt",
                    "performance_slot": "EX_10"
                },
                {
                    "title": "The Spirit of Adventure",
                    "composer": "Jeff Smallman Arr. David Marlatt",
                    "performance_slot": "EX_10"
                }
            ],
            "band_section": "Exhibition Section",
            "contest_draw_identifiers": [
                "EX_10"
            ]
        },
        {
            "id": 33,
            "name": "Five Lakes Silver Band",
            "website": "fivelakessilverband.com",
            "band_bio": "Five Lakes Silver Band (FLSB) is a nationally acclaimed British style brass band established in Rochester Hills, Michigan in 2006. The band’s name refers to the Great Lakes which surround Michigan. Each week, music educators, freelance musicians, and people who make their livelihood outside of music travel to rehearse from all around the Great Lakes region.\r\n\r\nAs well as performing in a variety of venues such as concert halls, cathedrals, amphitheaters, schools, libraries, and parks, FLSB is also a championship-level contesting band that regularly competes in the North American Brass Band Association (NABBA) Championships, Dublin Festival of Bands (DFOB) Championships, the Hannaford Festival of Bands in Toronto, Canada, and the U.S. Open Brass Band Championships.\r\n\r\nIn 2012 and 2013, FLSB won the Hannaford Cup. In 2013, the band won the First Section at the NABBA Championships, capturing its first national title. 2022 was the beginning of a new era for the band, as they were crowned Grand Champions at DFOB, placed second in the First Section at the NABBA Championships and were crowned Grand Champions and Most Entertaining Band at The U.S. Open Brass Band Championships. In 2023, Five Lakes won the treble, by successfully defending their titles at DFOB and the U.S. Open, and also winning the Championship Section at the North American Brass Band Championships.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/33/FLSB%20good%20pic%20-%20Mike%20Flickinger.jpg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/33/FLSBlogo%20-%20Mike%20Flickinger.png",
            "conductor_name": "Christopher Ward",
            "conductor_bio": "Christopher Ward became the Musical Director of the Five Lakes Silver Band in July of 2019. Under his leadership, Five Lakes won the U.S. Open Brass Band Championships in 2022, Dublin Festival of Brass in 2022 and 2023, and most recently, the North American Brass Band Championships in 2023. Christopher was also named a national finalist for the 2023 American Prize in Conducting a band/wind ensemble.\r\n\r\nIn March of 2018, Christopher and his family moved to Michigan, where he assumed the role of Senior Director of Music and Gospel Arts for the Great Lakes Division of the Salvation Army. As part of his responsibilities, he is the conductor of the Great Lakes Divisional Band and is the founder and conductor of the Great Lakes Divisional Choir. Christopher also serves on the North American Brass Band Association Board of Directors and is the chairman of the Great Lakes Brass Band Association. He is an ambassador for Denis Wick Products, an artist for Work of Art Custom Batons and plays cornet with the Brass Band of Battle Creek.\r\n\r\nPrior to his appointment in Michigan, Christopher served as an Assistant Music Director for the Salvation Army in Greater New York for 16 years, and concurrently served as conductor for several groups, including the Greater New York Youth Band and the Hempstead Citadel Band. He was a member of the New York Staff Band for 23 years, 11 of those as its Eb Soprano Cornet Soloist. Christopher has performed or conducted in 23 different countries, and in venues such as Carnegie Hall, Lincoln Center, Brooklyn Tabernacle, Royal Festival Hall, The Royal Albert Hall and Buckingham Palace. He has had the privilege of performing with the New York Philharmonic, The Canadian Brass, The Kings Singers and Sir Elton John.\r\n\r\nChristopher received his formal music training at New York's Mannes College of Music and The State University of New York - Purchase, where he received degrees in Fine Arts of Music & Trumpet Performance. In recent years, he has studied conducting privately with Professor David King.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/33/Chris%20Ward%20New%20PIc%20-%20Mike%20Flickinger.jpg",
            "contact_email": "flsb.affiliate@gmail.com",
            "choice_pieces": [
                {
                    "title": "Sand and Stars",
                    "composer": "Thierry Deleruyelle",
                    "performance_slot": "E_4"
                },
                {
                    "title": "The Australasian",
                    "composer": "William Rimmer",
                    "performance_slot": "E_4"
                },
                {
                    "title": "Stars of the Morning",
                    "composer": "Kenneth Downie",
                    "performance_slot": "E_4"
                }
            ],
            "band_section": "Elite Section",
            "contest_draw_identifiers": [
                "E_4"
            ]
        },
        {
            "id": 49,
            "name": "Oakland University Brass Band",
            "website": null,
            "band_bio": "The Oakland University Brass Band, formed in September 2009, enjoys the distinction of being one of the few collegiate brass bands in the United States. Oakland University is located in the beautiful suburban city of Rochester, Michigan which is north of Detroit. The members of the band come from across the state of Michigan, as well as the United States and Canada. \r\n\r\nDuring the months of the pandemic, the band was named the University Section winners of the 2021 Kapitol Cory Online Brass Band Championships. In addition, they are the 2019 and 2018 Dublin Festival of Brass Champions (USA) where they consistently swept all three categories of Best March, Best Slow Melody and Best Major Work. In January of 2015 they accepted an invitation to travel to England to perform in the Butlin’s National Mineworkers Open Brass Band Festival & Competition. While there, the band was awarded 2nd place in their division and now holds the distinction of being the highest placing American band in the history of the competition. This invitation was extended as a result of having won the First Section of the North American Brass Band Association Championships in 2014 in Grand Rapids, Michigan.\r\n\r\nThe band is comprised primarily of undergraduate and graduate music majors. Graduates of the school’s brass and percussion programs have gone on to receive scholarships to attend the country’s leading graduate music programs, as well as perform in major professional ensembles.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/49/Oakland%20University%20Brass%20Band%202024.jpg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/49/OUBrassBand_GOLD.png",
            "conductor_name": "Kenneth Kroesche",
            "conductor_bio": "Kenneth Kroesche is the Professor of Trombone, Euphonium and Tuba at Oakland University in Rochester, Michigan.  He holds a master's and doctorate of musical arts degree in performance from the University of Michigan, in addition to a Bachelor of Music Education degree from Texas State University. \r\n\r\nHe has appeared as a euphonium soloist with a number of notable ensembles, ranging from the National Symphony Orchestra at the Kennedy Center for the Performing Arts to the U.S. Army Band at the West Point Military Academy. The Washington Post described him as \"an expert on the instrument.\" As an orchestral musician, he is the principal trombonist of the Oakland Symphony Orchestra and the Saginaw Bay Symphony Orchestra. He is a frequent guest musician with the area’s leading ensembles which include the Detroit Symphony, Grand Rapids Symphony, Flint Symphony and Detroit Chamber Winds. In addition, each summer he performs as euphoniumist with the Toledo Symphony Concert Band.\r\n\r\nIn 2009, he formed the Oakland University Brass Band which since its inception has gone on to receive national and international recognition. From 2008-2011, he served as the conductor of the award winning Capital City Brass Band of Lansing, Michigan.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/49/Kenneth%20Kroesche%20Photo_2018.JPG",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "St. James - A New Beginning",
                    "composer": "Philip Harper",
                    "performance_slot": "E_2"
                },
                {
                    "title": "The Bombardier",
                    "composer": "Thomas James Powell",
                    "performance_slot": "E_2"
                },
                {
                    "title": "The Spirit Within",
                    "composer": "Ben Hollings",
                    "performance_slot": "E_2"
                }
            ],
            "band_section": "Elite Section",
            "contest_draw_identifiers": [
                "E_2"
            ]
        },
        {
            "id": 51,
            "name": "Rockville Brass Band",
            "website": null,
            "band_bio": "The Rockville Brass Band is dedicated to preserving the tradition of the British brass band. It was founded in 1976, and over the years has performed for audiences throughout the Washington D.C. metropolitan area and beyond. The band provides a series of concerts throughout the year locally and nationally. It performs a wide range of music, from transcriptions of light and orchestral music to serious brass band pieces.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/51/Rockville%20Brass%20Band.jpg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/51/Rockville%20Logo.jpg",
            "conductor_name": "Rachel Zephir",
            "conductor_bio": "Rachel Zephir is currently pursuing a Doctor of Musical Arts in Wind Band Conducting from the University of Michigan where she studies with Jason Fettig, formerly the conductor of The President’s Own. Rachel is a graduate of the Peabody Conservatory of Music. She has degrees in Trumpet, Music Education, and Wind Conducting. She also has a Master of Music in Music Education from The University of North Carolina at Greensboro.  \r\nRachel has served as the Director of Bands at Eleanor Roosevelt High School in Greenbelt Maryland. During her tenure the Wind Ensemble and Symphonic Band were selected to perform at the Maryland Music Educators State Conference in 2017, the College Band Directors National Association (CBDNA) Eastern Regional Conference at Yale University in 2018, and the Historically Black Colleges and Universities (HBCU) National Band Directors Consortium Conference in Atlanta, Georgia in March of 2019.   The Wind Ensemble Chamber Winds were selected to perform at The Midwest Clinic in December of 2019.  \r\nRachel is currently the Music Director of the Rockville Brass Band.  The ensemble has been invited to perform at major brass band venues such as the Gettysburg Brass Band Festival, the Dublin (OH) Festival of Brass, the Mid Atlantic Brass Band Festival at Rowan University.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/51/Rachel%20Pic.jpg",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "Connotations",
                    "composer": "Edward Gregson",
                    "performance_slot": "E_7"
                },
                {
                    "title": "The Unfortunate Traveler",
                    "composer": "Imogen Holst",
                    "performance_slot": "E_7"
                },
                {
                    "title": "Vienna Philharmonic Fanfare",
                    "composer": "Richard Strauss, arr William Himes",
                    "performance_slot": "E_7"
                }
            ],
            "band_section": "Elite Section",
            "contest_draw_identifiers": [
                "E_7"
            ]
        },
        {
            "id": 13,
            "name": "Cincinatti Brass Band",
            "website": null,
            "band_bio": "The Cincinnati Brass Band (CBB) was founded in 1993 and organized by William Harvey of Buddy Rogers Music; Director, Anita Cocker Hunt; and Assistant Director, Drew Cremisio. The CBB performs regularly throughout the greater-Cincinnati area bringing their signature sound in the British brass band tradition. The Cincinnati Brass Band was proclaimed as the “Official Brass Band of Cincinnati” by the Mayor of Cincinnati in recognition for contributions to the musical culture of Cincinnati.\r\n\r\nCommunity Outreach has always been an important aspect of the band’s history, and it continues today. The band has collaborated with other members of the Cincinnati art community including: Xavier University’s Symphonic Winds Ensemble, Cincinnati’s Music Resource Center, the Cincinnati Conservatory of Music Prep Brass Choir, the Cincinnati School for the Creative and Performing Arts, along with several private and public schools throughout the greater Cincinnati area.\r\n\r\nThe Cincinnati Brass Band is a member of the North American Brass Band Association (NABBA) which promotes the growth and development of brass bands in North America and sponsors an annual competition of the member bands. The Cincinnati Brass Band entered their first NABBA competition in 1996 and currently competes in the Second Section.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/13/Cincinnati_Brass_Band_2024%20-%20Daniel%20Oehrle.jpg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/13/Cincinnati%20Brass%20Band%20Logo%20-%20Daniel%20Oehrle.jpg",
            "conductor_name": "Joshua Thompson",
            "conductor_bio": "Dr. Joshua K. Thompson is extremely excited to assume his new role as the Cincinnati Brass Band’s fourth Music Director. In addition to conducting the band, he is also the Orchestra Director at Winton Woods High school in Cincinnati, Ohio. He grew up in Ohio and attended Miami University where he graduated cum laude with degrees in Music Education and Music Performance. After later completing his Masters Degree in Music at Bowling Green State University, he then completed his Doctorate of Musical Arts from the University of Iowa.\r\n\r\nBefore returning to the Cincinnati area, he taught at several colleges throughout the Midwest, teaching Wind Ensemble, Symphony Orchestra, Brass Choir, Jazz Ensemble, Trumpet, Music Technology, Music Theory, and Music Education courses. Josh has been an active guest conductor, clinician, honor band conductor, and judge, and has also enjoyed a varied and active performing career as an orchestral trumpeter, chamber musician, and soloist. He was previously the Music Director of the Eastern Iowa Brass Band (now “Iowa Brass”) and had also played cornet in the Chicago Brass Band.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/13/Joshua%20K%20Thompson%20-%20Daniel%20Oehrle.jpg",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "The Contestor",
                    "composer": "T. J. Powell",
                    "performance_slot": "CH_6"
                },
                {
                    "title": "The Shepherd's Song",
                    "composer": "arr. Goff Richards",
                    "performance_slot": "CH_6"
                },
                {
                    "title": "Albinus Variations",
                    "composer": "Etienne Crausaz",
                    "performance_slot": "CH_6"
                }
            ],
            "band_section": "Challenge Section",
            "contest_draw_identifiers": [
                "CH_6"
            ]
        }
    ],
    "performance_schedule": {
        "2024-03-16": [
            {
                "band_id": 48,
                "band_draw": "CH_1",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T10:00:00-04:00",
                    "end_timestamp": "2024-03-16T10:30:00-04:00"
                }
            },
            {
                "band_id": 49,
                "band_draw": "E_2",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T10:30:00-04:00",
                    "end_timestamp": "2024-03-16T11:00:00-04:00"
                }
            },
            {
                "band_id": 9,
                "band_draw": "CH_3",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T11:00:00-04:00",
                    "end_timestamp": "2024-03-16T11:30:00-04:00"
                }
            },
            {
                "band_id": 33,
                "band_draw": "E_4",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T11:30:00-04:00",
                    "end_timestamp": "2024-03-16T12:00:00-04:00"
                }
            },
            {
                "band_id": 4,
                "band_draw": "E_5",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T12:00:00-04:00",
                    "end_timestamp": "2024-03-16T12:00:00-04:00"
                }
            },
            {
                "band_id": 13,
                "band_draw": "CH_6",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T13:45:00-04:00",
                    "end_timestamp": "2024-03-16T14:15:00-04:00"
                }
            },
            {
                "band_id": 51,
                "band_draw": "E_7",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T14:15:00-04:00",
                    "end_timestamp": "2024-03-16T14:45:00-04:00"
                }
            },
            {
                "band_id": 52,
                "band_draw": "CH_8",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T14:45:00-04:00",
                    "end_timestamp": "2024-03-16T15:15:00-04:00"
                }
            },
            {
                "band_id": 21,
                "band_draw": "CH_9",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T15:15:00-04:00",
                    "end_timestamp": "2024-03-16T15:45:00-04:00"
                }
            },
            {
                "band_id": 53,
                "band_draw": "EX_10",
                "stage": "Main Hall",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T15:45:00-04:00",
                    "end_timestamp": "2024-03-16T16:15:00-04:00"
                }
            },
            {
                "band_id": null,
                "band_draw": "session_1",
                "stage": "Main Hall",
                "title": "Break",
                "details": "There will be a break between the final performance and awards",
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T16:15:00-04:00",
                    "end_timestamp": "2024-03-16T16:30:00-04:00"
                }
            },
            {
                "band_id": null,
                "band_draw": "session_2",
                "stage": "Main Hall",
                "title": "Awards",
                "details": "Awards will commence at 4:30",
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T16:30:00-04:00",
                    "end_timestamp": "2024-03-16T17:00:00-04:00"
                }
            }
        ]
    },
    "venue_details": {
        "name": "Dublin Jerome High School",
        "image": "https://www.dispatch.com/gcdn/presto/2021/11/10/NCOD/7eb68afe-10a8-44cd-822e-6dff576de299-Dublin-Jerome-HS-sign-NT.jpg",
        "address": "4RMG+5G, 8300 Hyland-Croy Rd, Dublin, OH 43016",
        "map_file": "https://maps.app.goo.gl/BHfcTPeVtREK2Siu8",
        "description": "The Dublin Festival of Brass is excited to have Dublin Jerome High School as our performance venue!",
        "link": "https://www.dublinschools.net/Jerome",
        "contest_name": "Dublin Festival of Brass 2024",
        "judge_link": null,
        "solo_ensemble_link": null
    },
    "partner_details": [
        {
            "image_src": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/partner_logos/sparrow-court-logo.png",
            "name": "Sparrow Court Consulting",
            "link": "https://www.sparrowcourt.com",
            "background": "#FFFF"
        }
    ]
}