{
  "band_list": [
    {
      "id": 32,
      "name": "Dublin Silver Band",
      "website": "www.dublinsilverband.com",
      "band_bio": "The Dublin Silver Band is made up of brass and percussion musicians from all parts of Ohio.  DSB exists as part of the Dublin Community Bands, a 501(c)(3) non-profit community arts organization that features seven different ensembles and over 200 musicians. DSB began its NABBA journey in the Second Section in 2014, placing first in the Second Section in 2015, and moving up to the First Section in 2016.  In 2019 the band is fortunate to have placed first in the First Section, arguably the most crowded and competitive in NABBA. The members of the Dublin Silver Band volunteer their time and talent because of three things they all have in common: a drive to chase perfection, a genuine affection for each other, and a passion for making connections with audiences on an emotional level.  To make these connections, the band commits to performing far more than ordinary concerts, instead telling stories that engage the audience in the musical performance.  It is this approach that has earned the band an international reputation. DSB has performed extensively throughout the Midwest, and has traveled and performed abroad.  In 2016 the band played concerts in Ireland and England before competing in Brass in Concert in Gateshead, England.  In 2020 the band once again traveled to England, competing at the Butlin's Festival. The Dublin Silver Band thanks the leadership of NABBA and all those from here in Huntsville for all the hard work required to put on an event like this, and wishes all the bands the best of luck in the competition.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/32/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/32/band_logo.jpg",
      "conductor_name": "Tim Jameson",
      "conductor_bio": "Tim Jameson has served as Music Director of the Dublin Silver Band since 2010.  During that time, he has led the band to first place finishes in both the NABBA Second and First Sections. Before his involvement with the Dublin Silver Band, Tim was the Music Director of the Brass Band of Columbus for five years, leading BBC to a first place finish in the NABBA Championship Section in 2006. Mr. Jameson is a graduate of The Ohio State University, where he studied trumpet under Tom Battenberg and conducting under Donald McGinnis, Marshall Haddock, George Hardesty, and Craig Kirchoff. He is also active as an arranger, with works published by Cimarron Music, BVD Press, and 360° Music. Professionally, Tim is Manager of Talent Development for Ariel Corporation in Mount Vernon, Ohio.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/32/conductor_photo.jpg",
      "band_section": "A section",
      "contact_email": "timjameson1@gmail.com",
      "choice_pieces": [
        {
          "title": "Honest Toil",
          "composer": "William Rimmer",
          "performance_slot": "B_3"
        },
        {
          "title": "Essay, II Soliloquy",
          "composer": "Edward Gregson",
          "performance_slot": "B_3"
        },

        {
          "title": "Year of the Dragon",
          "composer": "Philip Sparke",
          "performance_slot": "B_3"
        }
      ],
      "contest_draw_identifiers": ["B_3"]
    },
    {
      "id": 21,
      "name": "Dublin Metro Brass",
      "website": "https://dublinbands.com/dublin-metro-brass/",
      "band_bio": "The Dublin Metro Brass is the most recent addition to the Dublin Community Bands family. This ensemble was created to allow musicians the opportunity to experience the Brass Band world without the high intensity and full-year commitment of most competitive Bands. The abbreviated rehearsal season runs from January through June each year, with the goal of competing and performing at events like the Dublin Festival of Brass, the North American Brass Band Association Championships, and the Ohio Brass Arts Festival. Merging the 'community band' and 'competition band' experiences, Dublin Metro Brass is open to all interested musicians (no audition necessary).",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/21/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/21/band_logo.png",
      "conductor_name": "Keith M. Wilkinson",
      "conductor_bio": "Dr. Keith M. Wilkinson has been successfully directing brass bands for more than 50 years!  He commenced regularly conducting brass bands while he was a student at the University Of Manchester and following two enjoyable periods directing Salvation Army bands he entered the highly competitive British brass band contesting scene in the Fall of 1976.  In the following 20 years he enjoyed an enormous amount of success, including having the privilege of directing the first-placed band in more than 40 contests.  In several of these competitions upwards of 20 bands would have been performing.  The majority of these successes were with his own band, the GUS Band and later the William Davis Band, while some were as a guest conductor, primarily with Scotland's Newtongrange Band.  While living in England he was happy to accept invitations to conduct at various locations around Europe and for a period he was principal guest conductor of Switzerland's Brass Band Fribourg. Since moving, with his wife Audrey and  daughters Debbie and Katie, to USA in 1996 he has been delighted to receive a number of invitations to return to Britain to conduct and, following a recent appearance with Newtongrange Band, one commentator wrote 'a welcome return to the UK of a conductor of proven 24 carat class '.  (Iwan Fox, www.4barsrest.com). Keith's first home in USA was in northern Ohio and shortly after his arrival knowledge that he was living in the area led to the formation of Brass Band Of The Western Reserve, a band he led with distinction until the Summer of 2021.  In recognition of his 24 years with BBWR he is now their Music Director Emeritus. Keith continues to receive frequent invitations to use his talent and experience to direct brass bands.  In the Fall of 2021 he directed Central Ohio Brass Band as they progressed from the pandemic-enforced break in their regular activities and in September, 2022, he is leading a retreat in Canada for two of their finest bands - Orillia Silver Band and Weston Silver Band.  He directed Dublin Metro Brass in a couple of successful events in June, 2022, and looks forward to a number of future projects with them. While brass band competitions are less prominent in this country than in Britain he has continued his previous success by conducting the first-placed band on 5 occasions in different sections of the North American Brass Band Championships.  He is regularly in demand to adjudicate at the North American Championships where he is able to make use of his experience as a regularly-featured adjudicator around Britain and Europe. Alongside Keith's busy musical activities he has also been a successful university Professor of Mathematics, at the University of Nottingham in England and, more recently, at Capital University in Columbus, Ohio. Each of the bands he has directed has established an outstanding reputation for their concert presentations and these have been enhanced by the inclusion of some of Keith's brass band arrangements.  He has more than 120 published arrangements with publishers in Britain, Switzerland and USA.  Some of his arrangements have been used as test pieces at major championships.  In order to make his arrangements available more rapidly he has formed his own publishing company, Alum Creek Music (www.alumcreekmusic.com).",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/21/conductor_photo.jpg",
      "band_section": "B section",
      "contact_email": "pherak@nabba.org",
      "choice_pieces": [
        {
          "title": "The Cossack",
          "composer": "William Rimmer",
          "performance_slot": "B_4"
        },
        {
          "title": "Prayer for Ukraine",
          "composer": "Lesenko, arr.Bulla",
          "performance_slot": "B_4"
        },
        {
          "title": "Saint-Saëns Variations",
          "composer": "Philip Sparke",
          "performance_slot": "B_4"
        }
      ],
      "contest_draw_identifiers": ["B_4"]
    },
    {
      "id": 22,
      "name": "Oakland University Brass Band",
      "website": "https://www.facebook.com/OUBrassBand/",
      "band_bio": "The Oakland University Brass Band, formed in September 2009, enjoys the distinction of being one of the few collegiate brass bands in the United States. Oakland University is located in the  beautiful suburban city of Rochester, Michigan which is north of Detroit. The members of the band come from across the state of Michigan, as well as the United States and Canada. During the months of the pandemic, the band was named the University Section winners of the 2021 Kapitol Cory Online Brass Band Championships. In addition, they are the 2019 and 2018 Dublin Festival of Brass Champions (USA) where they consistently swept all three categories of Best March, Best Slow Melody and Best Major Work. In January of 2015 they accepted an invitation to travel to England to perform in the Butlin’s National Mineworkers Open Brass Band Festival and Competition. While there, the band was awarded 2nd place in their division and now holds the distinction of being the highest placing American band in the history of the competition. This invitation was extended as a result of having won the First Section of the North American Brass Band Association Championships in 2014 in Grand Rapids, Michigan. In June of 2015, the band performed at the Great American Brass Band Festival in Danville, Kentucky where they gave three featured concerts. The festival is known for being the largest brass band event of its kind in North America, with audiences in the tens of thousands in attendance each summer. The band is comprised primarily of undergraduate and graduate music majors. Graduates of the school’s brass and percussion programs have gone on to receive scholarships to attend the country’s leading graduate music programs, as well as perform in major professional ensembles.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/22/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/22/band_logo.png",
      "conductor_name": "Kenneth Kroesche",
      "conductor_bio": "Kenneth Kroesche is the Professor of Trombone, Euphonium and Tuba at Oakland University in Rochester, Michigan.  He holds a masters and doctorate of musical arts degree in performance from the University of Michigan, in addition to a Bachelor of Music Education degree from Texas State University. He has appeared as a euphonium soloist with a number of notable ensembles, ranging from the National Symphony Orchestra at the Kennedy Center for the Performing Arts to the U.S. Army Band at the West Point Military Academy. The Washington Post described him as an 'an expert on the instrument.' As an orchestral musician, he is the principal trombonist of the Oakland Symphony Orchestra and the Saginaw Bay Symphony Orchestra. He is a frequent guest musician with the area’s leading ensembles which include the Detroit Symphony, Grand Rapids Symphony, Flint Symphony and Detroit Chamber Winds. In addition, each summer he performs as euphoniumist with the Toledo Symphony Concert Band. In 2009, he formed the Oakland University Brass Band which since its inception has gone on to receive national and international recognition. From 2008-2011, he served as the conductor of the award winning Capital City Brass Band of Lansing, Michigan.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/22/conductor_photo.JPG",
      "band_section": "A section",
      "contact_email": "kroesche@oakland.edu",
      "choice_pieces": [
        {
          "title": "Cornish Cavalier",
          "composer": "William E. Moyle",
          "performance_slot": "B_7"
        },
        {
          "title": "Elegy from A Downland Suite",
          "composer": "John Ireland",
          "performance_slot": "B_7"
        },
        {
          "title": "Heroes",
          "composer": "Bruce Broughton",
          "performance_slot": "B_7"
        }
      ],
      "contest_draw_identifiers": ["B_7"]
    },
    {
      "id": 14,
      "name": "Cincinnati Brass Band",
      "website": "https://www.cincinnatibrassband.com/",
      "band_bio": "The Cincinnati Brass Band (CBB) was founded in 1993 and organized by William Harvey of Buddy Rogers Music; Director, Anita Cocker Hunt; and Assistant Director, Drew Cremisio.  The CBB performs regularly throughout the greater-Cincinnati area bringing their signature sound in the British brass band tradition.  The Cincinnati Brass Band was proclaimed as the “Official Brass Band of Cincinnati” by the Mayor of Cincinnati in recognition for contributions to the musical culture of Cincinnati. Community Outreach has always been an important aspect of the band’s history, and it continues today. The band has collaborated with other members of the Cincinnati art community including: Xavier University’s Symphonic Winds Ensemble, Cincinnati’s Music Resource Center, the Cincinnati Conservatory of Music Prep Brass Choir, the Cincinnati School for the Creative and Performing Arts, along with several private and public schools throughout the greater Cincinnati area. The Cincinnati Brass Band is a member of the North American Brass Band Association (NABBA) which promotes the growth and development of brass bands in North America and sponsors an annual competition of the member bands. The Cincinnati Brass Band has entered their first NABBA competition in 1996 and currently competes in the Second Section.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/14/band_photo.png",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/14/band_logo.jpg",
      "conductor_name": "Benjamin A. Chamberlain",
      "conductor_bio": "Dr. Benjamin A. Chamberlain is proud to serve his third season as the Music Director of the Cincinnati Brass Band. In addition to his role with the CBB, Dr. Chamberlain serves as assistant professor of music and director of instrumental activities at Xavier University. He is Chair of the Music and Theater department, directs the Symphonic Wind Ensemble and teaches courses in conducting and music education. A champion of new music, he has been instrumental in commissioning and performing new works throughout his career. Dr. Chamberlain earned the bachelor of music degree in music education from the University of Minnesota, the master of music degree from Louisiana State University, and the doctor of musical arts from Northwestern University. Chamberlain has appeared as conductor and clinician throughout the United States. He previously served on the faculty of the National High School Music Institute and the Music Institute of Chicago. Chamberlain's professional affiliations include the College Band Directors National Association, Conductors Guild, the National Band Association, Phi Mu Alpha Sinfonia, and Pi Kappa Lambda National Music Honor Society.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/14/conductor_photo.jpg",
      "band_section": "B section",
      "contact_email": "daniel.oehrle@ge.com",
      "choice_pieces": [
        {
          "title": "Queensbury",
          "composer": "James Kaye arr. Tommy Cheseaux",
          "performance_slot": "B_8"
        },
        {
          "title": "Hymn for Diana",
          "composer": "Joseph Turrin",
          "performance_slot": "B_8"
        },
        {
          "title": "Fantasy For Brass Band ",
          "composer": "Malcolm Arnold",
          "performance_slot": "B_8"
        }
      ],
      "contest_draw_identifiers": ["B_8"]
    },
    {
      "id": 4,
      "name": "Five Lakes Silver Band",
      "website": "https://www.fivelakessilverband.com/",
      "band_bio": "The Five Lakes Silver Band is a nationally acclaimed British style Brass Band based in Rochester Hills, Michigan. The band was founded in 2006 and our name ‘Five Lakes Silver Band’ refers to the five great lakes surrounding Michigan. The band is comprised of music educators and freelance musicians as well as many nonprofessionals. They travel from all over Michigan and some from other states to be part of this group. As well as performing in a variety of venues (concert halls, cathedrals, amphitheaters, schools, libraries, parks), FLSB is also a contesting band that has regularly competed in the North American Brass Band Association Championships, Dublin Festival of Bands, the Hannaford Festival of Bands in Toronto Canada, and The US Open Brass Band Championship. The Five Lakes Silver Band won the Hannaford Cup in 2011 & 2012 and in 2013, the band captured its first national championship title, by winning the First Section at the North American Brass Band (NABBA) Championships. 2022 was quite the year for the band, as they were awarded the Droste Shield after winning the Dublin Festival of Brass. The band also placed second in the First Section at the NABBA Championships and were most recently crowned Grand Champion and Most Entertaining Band at the U.S. Open Brass Band Championships.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/4/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/4/band_logo.png",
      "conductor_name": "Christopher Ward",
      "conductor_bio": "Christopher Ward became the Musical Director of the Five Lakes Silver Band in July of 2019. He moved to Michigan from New York with his family in March of 2018 to become the Director of Music and Gospel Arts for the Eastern Michigan Division of the Salvation Army. As part of his responsibilities he is the conductor of the Eastern Michigan Divisional Band, and is the founder and conductor of the Eastern Michigan Divisional Choir. Christopher also serves on the North American Brass Band Association Board of Directors and is the chairman of the Great Lakes Brass Band Association. Prior to his appointment in Michigan, Christopher served as an Assistant Music Director for the Salvation Army in Greater New York for 16 years, and concurrently served as conductor for a number of groups, including the Greater New York Youth Band and the Hempstead Citadel Band. He was a member of the New York Staff Band for 23 years, 11 of those as its Eb Soprano Cornet Soloist. Christopher has performed or conducted in 22 different countries, and in venues such as Carnegie Hall, Lincoln Center, Brooklyn Tabernacle, Royal Festival Hall, The Royal Albert Hall and Buckingham Palace. He has had the privilege of performing with the New York Philharmonic, The Canadian Brass, The Kings Singers and Sir Elton John. Christopher received his formal music training at New York's Mannes College of Music and also The State University of New York - Purchase, where he received degrees in Fine Arts of Music & Trumpet Performance.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/4/conductor_photo.jpg",
      "band_section": "A section",
      "contact_email": "",
      "choice_pieces": [
        {
          "title": "Honest Toil",
          "composer": "William Rimmer",
          "performance_slot": "B_9"
        },
        {
          "title": "Glow",
          "composer": "Eric Whitacre, arr. Jacob Vilhelm Larsen",
          "performance_slot": "B_9"
        },
        {
          "title": "On the Shoulders of Giants",
          "composer": "Peter Graham",
          "performance_slot": "B_9"
        }
      ],
      "contest_draw_identifiers": ["B_9"]
    },
    {
      "id": 46,
      "name": "Central Ohio Brass Band",
      "website": "https://centralohiobrassband.squarespace.com/",
      "band_bio": "The Central Ohio Brass Band (COBB) was formed in 1989 as the Ohio Collegiate Brass Band. Today COBB is a 501c3 non-profit organization whose members represent a diverse cross section of the Central Ohio community and a multitude of careers. Our membership includes music teachers, art teachers, dentists, IT specialists, nurses, and stay-at-home parents. COBB competes regularly at the North American Brass Band Association (NABBA) Championships, having earned 1st place of the 1st Division a record five times (2007, 2009, 2010, 2011, 2012).  In the winter of 2009, COBB was awarded 1st place in the Devilish Publishing Online competition based in the United Kingdom.  In 2011, COBB competed and performed at the Butlin Mineworkers' Competition in Skegness, UK. Also, in 2011, the band was honored to be a featured guest artist at the Great American Brass Band Festival.  In the fall of 2014, COBB competed for the first time at the US Open, placing third and winning 'Best Performance of a March.' In June 2016, COBB was honored to win the OBAF Cup for a second time.  COBB enjoys a vigorous performance schedule, frequently playing at church functions, community festivals and with school groups in order to promote life-long learning as well as to foster the brass band tradition in the United States. On June 26,2021 COBB hosted the 14th Ohio Brass Arts festival in Gahanna, Ohio.  This is an annual opportunity to embrace our mission and help to share Brass band music with our local community!",
      "band_photo": "",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/46/band_logo.jpeg",
      "conductor_name": "Matthew Shane Henry",
      "conductor_bio": "A native of Beavercreek, Ohio, Matthew Shane Henry received his Bachelor of Music Education degree with an emphasis in Jazz Studies from The Ohio State University, Columbus, Ohio. Quickly demonstrating his educational prowess, he was named the first recipient of the School of Music's Outstanding Student Teacher Award.  He enjoyed a successful seven-year career as a music educator in the public schools of Ohio, prior to being offered a graduate assistantship at the Jordan College of Fine Arts of Butler University, Indianapolis, Indiana where he pursued a Master of Music degree in orchestral and wind conducting. While at Butler, he served as Associate Conductor of the Symphonic Band and Wind Ensemble and adjunct faculty with the undergraduate conducting and music education programs. During this time, he also was active as Principal Guest Conductor with the Butler Symphony Orchestra. In addition to his conducting and teaching responsibilities, Matthew also held the position of Principal Trumpet with the Orchestra throughout his assistantship including their tour of The Republic of China (Taiwan). Making a shift from the education realm to the professional, Matthew was offered a highly selective position with the United States Air Force’s Music program as a conductor. Major (ret.) Henry has held a wide variety of assignments over his 20-year career in the Air Force to include 11 years as Commander, Conductor & Music Director of bands world-wide.  He has literally, joined the Air Force and seen the world. In a combined 7 years leading bands overseas, he has visited or performed in 49 different countries throughout the Pacific, Asia, Europe, Africa and the Middle East. He retired as Director of Staff & Associate Conductor for The United States Air Force Band, Joint Base Anacostia-Bolling, Washington DC. He remains active as a guest conductor, clinician, educator, adjudicator, and producer. Additionally, Matthew is 2/3 complete in pursuing a Doctorate of Musical Arts from UNLV’s Wind Studies Division. Prior to returning to Ohio he served as a graduate assist.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/46/conductor_photo.jpg",
      "band_section": "B section",
      "contact_email": "",
      "choice_pieces": [
        {
          "title": "Knight Templar",
          "composer": "George Allen",
          "performance_slot": "B_2"
        },
        {
          "title": "49th Parallel",
          "composer": "Ralph Vaughan Williams",
          "performance_slot": "B_2"
        },
        {
          "title": "Resurgam",
          "composer": "Eric Ball",
          "performance_slot": "B_2"
        }
      ],
      "contest_draw_identifiers": ["B_2"]
    },
    {
      "id": 47,
      "name": "Brass Band of Columbus",
      "website": "https://www.brassbandofcolumbus.org/",
      "band_bio": "Founded in 1984, The Brass Band of Columbus has been at the forefront of the resurgence of the American brass band movement for more than thirty-five years.  The band’s instrumentation is brass and percussion only, following the tradition of British brass bands.  The unpaid professionals who make up this 45-piece ensemble include over thirty active or retired music educators and a wide range of other professions.  The BBC was founded by Dr. Paul Droste, Emeritus Professor of Music at The Ohio State University and former director of the OSU Marching Band.  Tim Jameson served as Director from 2005 until 2010, and Brian Stevens has served as Director since 2010. The BBC averages more than twenty appearances per year at indoor and outdoor venues, community events, and church services.  Major appearances include the Ohio Music Education Association Professional Conference, the Midwest Band and Orchestra Clinic in Chicago and The Great American Brass Band Festival in Danville, Kentucky. In 2000, the BBC performed as part of the British Open Brass Band competition in Birmingham, England. The BBC is a member of North American Brass Band Association (NABBA).  Each year, NABBA hosts a competition for its member bands.  The BBC has been awarded the first place award in the Championship Section ten times in its history, most recently in April 2006.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/47/band_photo.jpeg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/47/band_logo.jpeg",
      "conductor_name": "Brian Stevens",
      "conductor_bio": "Brian Stevens is recently retired from public school teaching after 33 years as a music educator and currently serves as an adjunct professor of music education at Capital University.  He holds a Bachelor of Music Education Degree from the Ohio State University and a Master of Music Education with Instrumental Emphasis from Capital University.  Mr. Stevens began his teaching career in 1988 as band and choir director at West Jefferson High School in West Jefferson, Ohio.  During his five years there, his bands and choirs received Superior Ratings at the district and state levels.  Mr. Stevens then served 16 years as Director of Bands at Reynoldsburg High School and supervisor of the district band program.  While at Reynoldsburg, he posted consistent Superior Ratings with the Freshman Band, Symphonic Band, Wind Symphony and Marching Band.  Mr. Stevens concluded his teaching career as Director of Bands at Dublin Jerome High School where his bands consistently achieved Superior ratings at OMEA (Ohio Music Education Association) Events. In addition to his teaching responsibilities, Mr. Stevens is President-Elect of the Ohio Music Education Association and has previously served OMEA as Adjudicated Events Chair, Band Affairs Chair, Marching Band Affairs Chair, Junior High Affairs Chair and All-State Band Chair.  In addition to his OMEA responsibilities, Mr. Stevens is the music education consultant to Kincaid’s Is Music, the traditional music director at Jerome United Methodist Church, and a freelance marching band designer for several area bands including The Ohio State University Marching Band. Mr. Stevens is a member of the Ohio Music Education Association, Phi Mu Alpha Sinfonia, The American School Band Directors Association, and Phi Beta Mu International Bandmasters Honorary Fraternity.  Mr. Stevens resides in Dublin with his wife, Julie, and is the proud father of three adult children, Daniel, Ripley, and Nathan.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/47/conductor_photo.jpeg",
      "band_section": "Exhibition",
      "contact_email": "director@brassbandofcolumbus.org",
      "choice_pieces": [
        {
          "title": "George Washington Bicentennial",
          "composer": "Sousa, arr. Hensler",
          "performance_slot": "B_5"
        },
        {

          "title": "The Spirit is Willing",
          "composer": "Nicole Plumno",
          "performance_slot": "B_5"
        },
        {
          "title": "Trittico",
          "composer": "James Curnow",
          "performance_slot": "B_5"
        }
      ],
      "contest_draw_identifiers": ["B_5"]
    },
    {
      "id": 48,
      "name": "Rockville Brass Band",
      "website": "https://www.rockvillebrassband.org/",
      "band_bio": "The Rockville Brass Band is Maryland’s oldest award-winning British-style brass band. Founded in 1976, it has performed throughout the greater Washington, DC area for the last 45 years, playing a range of popular, holiday, and traditional music and newly commissioned works for brass. Thirty musicians, made up of veterans of our nation’s military bands, music educators, collegiate performance students, and serious amateur players drawn from the Maryland, Virginia, and DC communities comprise the band. The band regularly shares the stage with virtuoso soloists, special guests like the US Army Herald Trumpets, and other local groups. It travels to represent Maryland at festivals and competitions, including the Gettysburg Brass Band Festival (PA), the Mid-Atlantic Brass Band Festival (NJ), and the Dublin Festival of Brass (OH). At the national level, we have twice won the NABBA championship in the 2nd Section in Fort Wayne, IN. The band’s mission is to engage local audiences and artists with our innovative programming, to inspire the next generation of brass players through outreach, to represent Maryland at regional and national festivals and competitions, and to promote and develop an appreciation for the unique sound of British-style brass bands.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/48/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/48/band_logo.jpg",
      "conductor_name": "Rachel E. Zephir",
      "conductor_bio": "Rachel E. Zephir is currently the Director of Bands at Eleanor Roosevelt High School in Greenbelt Maryland. During her tenure the Wind Ensemble and Symphonic Band have been selected to perform at the Maryland Music Educators State Conference in 2017, the College Band Directors National Association (CBDNA) Eastern Regional Conference at Yale University in 2018, and in March 2019 at the Historically Black Colleges and Universities (HBCU) National Band Directors Consortium Conference. Rachel also spent three years teaching with The Baltimore Symphony Orchestra’s El Sistema based program OrchKids. From 2007-2011 she was the Music Director of the Westminster Symphony Orchestra; a combined effort between McDaniel College and Carroll Community College in Westminster Maryland. Members included local professional musicians, area music educators, college students, and community members. She was also an adjunct faculty member at both McDaniel College and Carroll Community College teaching studio trumpet and the Brass Ensemble. Rachel has participated in several conducting workshops with renowned Wind Conductors such as Donald Hunsberger, Frederick Fennell, H. Robert Reynolds, Mark Scatterday, Michael Haithcock, Frank Battisti, Craig Kirchhoff, and Jerry Junkin. She is a graduate of the Peabody Conservatory of Music. She has degrees in Trumpet, Music Education, and Wind Conducting.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/48/conductor_photo.jpg",
      "band_section": "A section",
      "contact_email": "secretary@rockvillebrassband.org",
      "choice_pieces": [
        {
          "title": "King Cotton March",
          "composer": "John Phillip Sousa",
          "performance_slot": "B_6"
        },
        {
          "title": "Sleep",
          "composer": "Eric Whitacre arr. Sandy Smith",
          "performance_slot": "B_6"
        },
        {
          "title": "Purcell Variations",
          "composer": "Kenneth Downie",
          "performance_slot": "B_6"
        }
      ],
      "contest_draw_identifiers": ["B_6"]
    },
    {
      "id": 49,
      "name": "Watson Woods Salvation Army Band",
      "website": "",
      "band_bio": "The Worthington Woods Salvation Army Band is a musical ministry of The Salvation Army, Chapel at Worthington Woods.  The band supports the evangelistic mission of the Army by providing musical accompaniment and special music during worship meetings, performing for special events, and conducting musical outreach in the community.  Directed by Bandmaster Eric Snowden, the band's leadership also consists of Robert Doughtery, Dep. Bandmaster, Lydia Smith, Quartermaster, and Capts. Ray & Heidi Valdez, Commanding Officers (Pastor).  The Chapel also receives musical ministry from a songster brigade (choir) and contemporary worship band. Selections and worship items are drawn from the extensive catalog of brass music published nationally and internationally by The Salvation Army and include traditional Christian music and modern worship songs in a variety of settings and styles. The band would like to provide a special thanks to Pat and Diana Herak for their generous support and the invitation to perform for you at this festival.  Please know that we are praying for the fellowship and safe travels of all festival participants and that all are welcome to join us in worship tomorrow at 11am.  We are located at 760 Worthington Woods Blvd, corner of Sancus Blvd, and any bandsmen participating today are welcome to bring an instrument and join in worshipping through music.  If you have connections to the Army, or need special spiritual support in your life, we are always happy to speak with you!",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media%2F49%2Fband_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media%2F49%2Fband_logo.png",
      "conductor_name": "Eric Snowden",
      "conductor_bio": "",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media%2F49%2Fconductor_photo.jpg",
      "band_section": "Exhibition",
      "contact_email": "",
      "choice_pieces": [
        {
          "title": "Sing Hosanna",
          "composer": "arr. David Rowsell",
          "performance_slot": "B_1"
        },
        {
          "title": "National Anthems of the United Kingdom, Canada and the United States of America",
          "composer": "arr. The Salvation Army",
          "performance_slot": "B_1"
        },
        {
          "title": "Unto Thee",
          "composer": "Ruben Schmidt",
          "performance_slot": "B_1"
        },
        {
          "title": "Invocation and Praye",
          "composer": "Capt. Ray Valdez",
          "performance_slot": "B_1"
        },
        {
          "title": "March - Nicely Saved",
          "composer": "Ray Steadman-Allen",
          "performance_slot": "B_1"
        }
      ],
      "contest_draw_identifiers": ["B_1"]
    },
    {
      "id": 50,
      "name": "Oakland University Youth Brass Band",
      "website": "https://www.facebook.com/OUBrassBand/",
      "band_bio": "Oakland University Youth Brass Band was founded in January of 2022. The group is comprised of high school brass and percussion students from southeastern Michigan. Students explore and perform music written for the British brass band genre while also developing their playing skills and musicianship. Expert weekly instruction is provided by members of the university’s brass faculty, as well as members of the Oakland University Brass Band. The Oakland University Youth Brass Band is led by Dr. Kenneth Kroesche and Dr. Amanda Ross.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/50/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/50/band_logo.png",
      "conductor_name": "Kenneth Kroesche",
      "conductor_bio": "Kenneth Kroesche is the Professor of Trombone, Euphonium and Tuba at Oakland University in Rochester, Michigan.  He holds a master's and doctorate of musical arts degree in performance from the University of Michigan, in addition to a Bachelor of Music Education degree from Texas State University. He has appeared as a euphonium soloist with a number of notable ensembles, ranging from the National Symphony Orchestra at the Kennedy Center for the Performing Arts to the U.S. Army Band at the West Point Military Academy. The Washington Post described him as 'an expert on the instrument.' As an orchestral musician, he is the principal trombonist of the Oakland Symphony Orchestra and the Saginaw Bay Symphony Orchestra. He is a frequent guest musician with the area’s leading ensembles which include the Detroit Symphony, Grand Rapids Symphony, Flint Symphony and Detroit Chamber Winds. In addition, each summer he performs as euphoniumist with the Toledo Symphony Concert Band. In 2009, he formed the Oakland University Brass Band which since its inception has gone on to receive national and international recognition. From 2008-2011, he served as the conductor of the award winning Capital City Brass Band of Lansing, Michigan.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/50/conductor_photo.JPG",
      "band_section": "youth",
      "contact_email": "kroesche@oakland.edu",
      "choice_pieces": [

        {
          "title": "Death or Glory",
          "composer": "Robert Browne Hall",
          "performance_slot": "B_10"
        },

        {
          "title": "A Little Prayer",
          "composer": "Evelyn Glennie, arranged by Robert Childs ",
          "performance_slot": "B_10"
        },
        {
          "title": "The Journal of Phileas Fogg",
          "composer": "Peter Graham",
          "performance_slot": "B_10"
        }
      ],
      "contest_draw_identifiers": ["B_10"]
    }
  ],
  
  "performance_schedule": {
    "2023-03-25": [
      {
        "band_id": 1001,
        "band_draw": "session_1",
        "stage": "Main",
        "title": "Doors open",
        "performance_times": {            
            "start_timestamp": "2023-03-18T08:30:00.000-04:00",
            "end_timestamp": "2023-03-18T09:30:00.000-04:00"
          }
        
      },
      {
        "band_id": 49,
        "band_draw": "B_1",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T09:30:00.000-04:00",
            "end_timestamp": "2023-03-18T10:00:00.000-04:00"
          }
        
      },
      {
        "band_id": 46,
        "band_draw": "B_2",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T10:00:00.000-04:00",
            "end_timestamp": "2023-03-18T10:30:00.000-04:00"
          }
        
      },
      {
        "band_id": 32,
        "band_draw": "B_3",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T10:30:00.000-04:00",
            "end_timestamp": "2023-03-18T11:00:00.000-04:00"
          }
      },
      {
        "band_id": 21,
        "band_draw": "B_4",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T11:00:00.000-04:00",
            "end_timestamp": "2023-03-18T11:30:00.000-04:00"
          }
      },
      {
        "band_id": 47,
        "band_draw": "B_5",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T11:30:00.000-04:00",
            "end_timestamp": "2023-03-18T12:00:00.000-04:00"
          }
      },
      {
        "band_id": 48,
        "band_draw": "B_6",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T12:00:00.000-04:00",
            "end_timestamp": "2023-03-18T12:30:00.000-04:00"
          }
      },
      {
        "band_id": 1002,
        "band_draw": "session_2",
        "stage": "Main",
        "title": "Lunch",
        "performance_times": {            
            "start_timestamp": "2023-03-18T12:30:00.000-04:00",
            "end_timestamp": "2023-03-18T13:45:00.000-04:00"
          }
      },
      {
        "band_id": 22,
        "band_draw": "B_7",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T13:45:00.000-04:00",
            "end_timestamp": "2023-03-18T14:15:00.000-04:00"
          }
      },
      {
        "band_id": 14,
        "band_draw": "B_8",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T14:15:00.000-04:00",
            "end_timestamp": "2023-03-18T14:45:00.000-04:00"
          }
      },
      {
        "band_id": 4,
        "band_draw": "B_9",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T14:45:00.000-04:00",
            "end_timestamp": "2023-03-18T15:15:00.000-04:00"
          }
      },
      {
        "band_id": 50,
        "band_draw": "B_10",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T15:15:00.000-04:00",
            "end_timestamp": "2023-03-18T15:45:00.000-04:00"
          }
      },
      {
        "band_id": 1003,
        "band_draw": "session_3",
        "stage": "Main",
        "title": "Awards",
        "performance_times": {            
            "start_timestamp": "2023-03-18T16:00:00.000-04:00",
            "end_timestamp": "2023-03-18T16:30:00.000-04:00"
          }
      }
    ]
    
  },
  "venue_details": {
    "name": "Dublin Jerome Performing Arts Center",
    "image": "https://s3.us-east-1.amazonaws.com/columbusmakesart-content/site-images/_hero/artmakesus-hero.jpg",
    "address": "Dublin Jerome Performing Arts Center, Dublin, OH",
    "map_file": "https://goo.gl/maps/n9R3WrBdMK6Bi9MV7",
    "description": "The Dublin Festival of Brass is held in March every year. It hosts British-style brass bands from across the Midwest, USA, and beyond. The competition requires bands perform a march, slow melody, and major work. In addition to band performances, there are also some brief solo and ensemble performances. The judges for the 2023 Dublin Festival of Brass are Dr. John Phillips, Allan Ramsay, and Jessica Sneeringer.",
    "link": "https://www.columbusmakesart.com/place/3994-dublin-jerome-high-school-center-for-the-performing-arts",
    "contest_name": "The Dublin Festival of Brass",
    "judge_link": "https://nabba.org/wp-content/uploads/2023/01/2023-NABBC-Band-Judges.pdf",
    "solo_ensemble_link": ""
  },
  "partner_details": [
    {
      "image_src": "http://sparrowcourt.com/assets/images/sparrow-court-logo.png",
      "name": "Sparrow Court Consulting",
      "link": "http://www.sparrowcourt.com",
      "background": "#000000"
    },
    {
      "image_src": "https://nabba.org/wp-content/uploads/2019/05/NabbaNew-1.png",
      "name": "North American Brass Band Association",
      "link": "https://nabba.org",
      "background": "#000000"
    }
  ]
}
