{
  "band_list": [
    {
      "id": 1,
      "name": "Chicago Brass Band",
      "website": "https://chicagobrassband.org",
      "band_bio": "The Chicago Brass Band is a 30-piece brass and percussion ensemble formed in the British brass band tradition, but with Chicago flair. The band, led by music director Dr. Mark Taylor, just celebrated its 20th anniversary. During its first two decades, the Chicago Brass Band has won the North American Brass Band Championship, been awarded Most Entertaining Band at the US Open Brass Band Championships, twice competed in the World Music Contest in the Netherlands, participated in the renowned Whit Friday Marches in England, has been a featured ensemble in front of 40,000 brass fans at the Great American Brass Festival, competed in the 2019 New Zealand National Brass Band Championships, and won first prize at the 2019 Gateway British Brass Band Festival. The band’s favorite activity, however, remains dazzling audiences in Chicago, one of the world’s premiere cities for brass musicianship. The band has particularly enjoyed performances with soloists drawn from the Chicago Symphony Orchestra’s celebrated brass section, including Chris Martin, Charlie Vernon, Gene Pokorny, John Hagstrom, and Mark Ridenour, and multiple collaborations with famed artist Rex Richardson. The Chicago Brass Band was selected to be a Chamber Group at the 2011 Midwest Band and Orchestra Clinic in Chicago, with guest soloist Jens Lindemann- rekindling the brass band movement at this annual convention. Additionally, the Chicago Brass Band has continued engaging young musicians with its Project Horizon initiative, a program developed to promote and enhance the performance and enjoyment of live music in public schools. Through collaborative concerts, workshops, and clinics, the band inspires students to continue to perform and enjoy live music at a high level into and throughout adulthood, even if they do not pursue music as their chosen profession.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/1/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/1/band_logo.jpg",
      "conductor_name": "Mark Taylor",
      "conductor_bio": "Mark A. Taylor is honored to serve as the new Music Director of the internationally award-winning Chicago Brass Band. Dr. Taylor is a conductor, educator, and performer in demand throughout the Great Lakes region. His new appointment follows nearly twenty years as a section percussionist with the band. No stranger to brass band leadership, Dr. Taylor is now entering his second decade as Music Director of the Milwaukee Festival Brass. He is also the Music Director of the Waukegan Band and serves as Band Director at College of DuPage. He received the Doctor of Musical Arts degree in 2016 from the University of North Texas, where his principal conducting teachers were Eugene Migliaro Corporon, Dennis Fisher, and Nicholas Enrico Williams. Dr. Taylor’s dissertation, 'British-Style Brass Bands in U.S. Colleges and Universities,' documented the existence of brass bands in American college music programs, past and present. Prior to his doctoral study, he served five years as Director of Bands and Coordinator of Ensembles at Loyola University Chicago, and taught on the music education faculty at the Chicago College of Performing Arts at Roosevelt University. He received the Master of Music degree from Northwestern University, where he studied conducting with John P. Paynter and Stephen G. Peterson and music education with Bennett Reimer and Peter Webster. He received his undergraduate degrees from the University of Notre Dame, where his first conducting teachers were Walter Ginter and Carl Stam. Dr. Taylor and his wife and son reside in Lake Forest, IL.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/1/conductor_photo.jpg",
      "contact_email": "vicepresident@chicagobrassband.org",
      "choice_pieces": [
        {
          "title": "Titan's Progress",
          "composer": "Hermann Pallhuber",
          "performance_slot": "C_B"
        },
        {
          "title": "A Gabrieli Fantasy",
          "composer": "Bert Appermont",
          "performance_slot": "C_B"
        }
      ],
      "band_section": "championship",
      "contest_draw_identifiers": ["C_B"]
    },
    {
      "id": 27,
      "name": "Fountain City Brass Band",
      "website": "https://www.fcbb.net/",
      "band_bio": "The Fountain City Brass Band (FCBB), founded in 2002, is an all-volunteer thirty‐piece brass and percussion ensemble based in Kansas City, but draws its members from around the United States. FCBB is committed to a mission of cultural enrichment by performing eclectic concerts that expand the brass band art form and are both entertaining and educational for audiences. Performing a wide variety of music including mod- ern compositions written specifically for brass band, as well as arrangements of classical works, jazz, and Broadway hits, FCBB seeks to bridge the gap between popular and classical art music. Offering audience friendly concerts, the band actively seeks to initiate cultural revitalization and arts awareness in the local community. When not performing for regional audiences, FCBB competes nationally and internationally. FCBB has won 10 U.S. Open Brass Band Championships, 9 North American Brass Band Championships, and 1 Scottish Open Brass Band Championship, becoming the first U.S. band ever, and the first non‐UK band in over 50 years, to win a major brass band competition on UK soil.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/27/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/27/band_logo.png",
      "conductor_name": "Joseph Parisi",
      "conductor_bio": "Joseph Parisi is a Curators’ Distinguished Professor at the UMKC Conservatory where he conducts the Conservatory Wind Ensemble and serves as a music education and conducting faculty member. Recognized as one of the most well-rounded faculty members at UMKC, Parisi has amassed an impressive career as a conductor, performing artist, pedagogue, and scholar. He has appeared throughout the world conducting music festivals, adjudicating ensembles, performing, and presenting clinics, research, lectures and workshops. Recognized as one of America’s outstanding brass conductors, Parisi is the principal conductor of Summit Brass at the Rafael Méndez Brass Institute (www.mendezbrassinstitute.com) and Fountain City Brass Band (www.fcbb.net). Both groups have a rich and distinguished history of outstanding brass playing, and under Parisi’s leadership, Fountain City Brass Band leads the United States as one of the world’s top brass bands. Parisi has been recognized numerous times with the Brass Band Conductor of the Year Award, and received the winning conductor award at the Scottish Open Championship. Fountain City Brass Band has recorded several albums, and the latest recording, Celtic Impressions, has received wide-spread praise for its ensemble precision, excitement, and musicality. As a researcher his work on teaching effectiveness, perception, and musical preference have been published in numerous top tier academic journals. Dr. Parisi completed a bachelor’s degree in music education at the State University of New York at Potsdam (Crane School of Music); and a master’s degree in trumpet performance and a PhD in instrumental conducting/music education from Florida State University. While at the UMKC Conservatory, Parisi has won numerous awards including the Kauffman Outstanding Service Award, the Kauffman Excellence in Teaching Award, and the Kauffman Award for Outstanding Research and Creative Activity.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/27/conductor-photo-gateway.png",
      "band_section": "championship",
      "contact_email": "fcbb@fcbb.net",
      "choice_pieces": [
        {
          "title": "Titan's Progress",
          "composer": "Hermann Pallhuber",
          "performance_slot": "C_D"
        },
        {
          "title": "Journey of the Lone Wolf",
          "composer": "Simon Dobson",
          "performance_slot": "C_D"
        }
      ],
      "contest_draw_identifiers": ["C_D"]
    },
    {
      "id": 28,
      "name": "Fountain City Youth Brass Academy",
      "website": "https://fcyba.net/",
      "band_bio": "The Fountain City Youth Brass Academy (FCYBA) is the educational outreach component of the Fountain City Brass Band (FCBB), North America’s premiere volunteer brass and percussion ensemble. The mission of the FCYBA is to inspire young musicians of all performance ability levels to achieve a high standard of musicianship and to foster a life-long love of music. FCYBA was founded in 2008 by Helen Harrelson, while she was on a sabbatical from her job in England. Helen is a native of England and grew up in the brass band tradition before attending the Royal Northern College of Music. From there she became one of the world’s foremost baritonist and performed with some of the finest bands in the United Kingdom. It was her passion for music education coupled with this rich tradition that led her to establish the FCYBA. The FCYBA began as day-long ‘Expo’ workshops and has grown into season-long brass bands with over 150 members. There are four bands within the Academy made up of brass and percussionists of all standards and abilities from late elementary through young adult. The bands of the FCYBA are non-cut programs for those participants that are 18 years of age and younger. The conductors for the FCYBA bands are professional music educators that also perform with the Fountain City Brass Band. The bands meet during the spring academic semester, once per week on Sundays. Since its inception the bands of the FCYBA have won numerous national championships at the North Ameri- can Brass Band Championships, the U.S. Open Brass Band Championships (Division II), and been featured at prestigious events such as the Great American Brass Band Festival and the Kansas Music Educators Association’s annual conference. ",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/28/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/28/band_logo.png",
      "conductor_name": "Lee Harrelson",
      "conductor_bio": "Lee Harrelson is a Professor of Music at Missouri Western State University. At Missouri Western he serves as the Director of Instrumental Studies and Bands. Dr. Harrelson attended the University of Southern Mississippi, where he studied music education and music performance before completing his masters and doctorate at the University of Missouri-Kansas City’s Conservatory of Music and Dance. Dr. Harrelson is the founder of the Fountain City Brass Band and currently serves as its artistic director, executive director and principal euphomiumist. The Fountain City Brass Band (FCBB) is one of America’s premiere brass and percussion ensembles and has been featured throughout the U.S. and Europe in concerts and competitions. The FCBB is currently the top ranked brass band in the United States. Under Dr. Harrelson’s artistic leadersip, the band has won eight North American Brass Band Association Championships, nine U.S. Open Brass Band Championships and one Scottish Open Brass Band Championship, since it began competing in 2004. At the 2011 All England International Brass Band Competition, as a member of the FCBB, Lee was named Best Instrumentalist; a first for an American at an English brass band competition. During his tenure the FCBB has produced four commercial recordings, performed with countless world-class soloists and develped a youth brass program, the Fountain City Youth Brass Academy, that serves over 120 students per year. Dedicated to furthering the brass band movement in America, Dr. Harrleson regularly serves on the faculty of the North American Brass Band Summer School and in 2019, along with his wife Helen, founded the National Youth Brass Band of America. In the fall of 2019 Dr. Harrelson was awarded the first ever Visiting International Professor position with the world famous Brighouse & Rastrick Band (England). In addition to collaborating with and conducting the band, Dr. Harrleson was able to work closely with Professor David King, during preparations for the band’s appearances at the British Open Brass Band Championships (Symphony Hall, Birmingham) and the National Brass Band Championships of Great Britain (Royal Albert Hall, London). Dr. Harrleson can be heard on numerous commercially released recordings and has appeared throughout North America and Eruope as a clincian, soloist and chamber musician. Lee Harrelson is a Buffet Group/Besson Performing Artist.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/28/conductor-photo-gateway.png",
      "band_section": "Non-Traditional",
      "contact_email": "helen@fcbb.net",
      "choice_pieces": [
        {
          "title": "Sinfonietta No. 4",
          "composer": "Etienne Crausaz",
          "performance_slot": "NT_B"
        },
        {
          "title": "The Dark Side of the Moon",
          "composer": "Paul Lovatt-Cooper",
          "performance_slot": "NT_B"
        }
      ],
      "contest_draw_identifiers": ["NT_B"]
    },
    {
      "id": 40,
      "name": "River Brass",
      "website": "https://riverbrass.com/",
      "band_bio": "River Brass was founded in 1991 under the original name 'Bend in the River Brass Band'. The group took its name from the ox bow bend of the Ohio River that separates the cities of Evansville, Indiana and Henderson, Kentucky. As the band added members from across the entire IN/KY/IL tristate region, the band rebranded to 'River Brass' in the fall of 2015 to equally represent members near both the Wabash and Ohio Rivers. The band currently rehearses at Epworth United Methodist Church in Newburgh, IN. Its conductor is Dr. Pat Stuckemeyer. River Brass follows the tradition of British brass bands in instrumentation and literature. Its members are post-high school players from southwestern Indiana, western Kentucky, and southern Illinois. Members range in age from the late teens to the eighties. This diverse group is brought together by their common interest in making and sharing high quality brass music. In 2019, as an educational outreach of the adult band, the River Brass Youth Band was formed. The RBYB gives are students the opportunity to gain exposure to the brass band world and network with other brass players from across the region. ",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/40/band_photo.jpeg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/40/band_logo.png",
      "conductor_name": "Pat Stuckmeyer",
      "conductor_bio": "Dr. Pat Stuckemeyer has served as the music director for River Brass since 2016 and is the current Director of Bands and Assistant Professor of Music at Kentucky Wesleyan College. As a soloist, Stuckemeyer’s career has taken him to a dozen countries and three continents. As a brass band solo euphoniumist, Pat honed his skills in the United Kingdom performing with the Grimethorpe Colliery Band, Besses o’ ‘Th Barn Band, and the Leyland Band. His extensive brass banding experience has served him well as a member of the Fountain City Brass Band, Central Ohio Brass Band, and the Salt River Brass Band. Stuckemeyer holds a Bachelor of Music and Bachelor of Music Education from the Conservatory of Music at Capital University, a Master of Music from the University of Kansas, an Artist Diploma from the Royal Northern College of Music in the United Kingdom, and the Doctorate of Musical Arts degree from Arizona State University.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/40/conductor_photo.jpeg",
      "band_section": "Open",
      "contact_email": "",
      "choice_pieces": [
        {
          "title": "Hollywood",
          "composer": "Goff Richards",
          "performance_slot": "O_A"
        },
        {
          "title": "Gallipoli '100' March",
          "composer": "Martin Ellerby",
          "performance_slot": "O_A"
        },
        {
          "title": "By Trevone Bay",
          "composer": "Paul Lovatt-Cooper",
          "performance_slot": "O_A"
        }
      ],
      "contest_draw_identifiers": ["O_A"]
    },
    {
      "id": 34,
      "name": "St. Louis Brass Band",
      "website": "https://www.stlbb.org/",
      "band_bio": "Founded in 1998, the Saint Louis Brass Band features some of the area’s finest brass musicians, educators, and students, who come together to perform classics, marches, jazz, and the very best contemporary brass band music. Acclaimed by the St. Louis Post-Dispatch as “one of the city’s newest treasures,” the STLBB has won award at NABBA and the US Open Bass Band Championships. Generous financial support has come from the Missouri Arts Council, Regional Arts Commission, Ameren Illinois, the Garvey Foundation, Boeing, and area music stores throughout the region In 2014 the St. Louis Academy Brass Band was established as part of the Educational Outreach Program. The Fall of 2017 saw the establishment of Brass Extravaganza!: two days of brass and percussion workshops, clinics, rehearsals, and performances for students Grades 8 through college level, all led by members of the Saint Louis Brass Band. Guest soloists with the Saint Louis Brass Band include Karin Bliznik (Principal Trumpet - St. Louis Symphony Orchestra), Gerry Pagano (Bass Trombone - St. Louis Symphony Orchestra), J.D. Shaw (Boston Brass co-founder and horn), Christine Brewer (Grammy award-winning soprano) and Demondrae Thurman (Professor of Euphonium, Indiana University).",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "John Bell",
      "conductor_bio": "Dr. John Bell has served as the Music Director for the St. Louis Brass Band since 2009 and serves on the NABBA Board. In addition to his work in the brass band arena, he is the newly appointed Director of Wind Ensemble at McKendree University, in Lebanon, Illinois, and Professor of Music Emeritus at Southern Illinois University Edwardsville, a role he held for 30 years.Dr. Bell is an elected member of the prestigious American Bandmasters Association and has been an invited clinician and adjudicator throughout the United States, Asia and Canada, for DCI, Music for All, the World Music Festival, and numerous championship events. Previous appointments include Music Director of the Rocky Mountain Brassworks Brass Band in Denver, Colorado, Associate Director of Bands at the University of Northern Colorado, Doctoral Conducting intern at the University of Illinois, and band director at Willowbrook and Rolling Meadows High Schools in the Chicago suburbs Ensembles under his direction have been selected for performance at the international conference of the World Association for Symphonic Bands and Ensembles in Chiayi City, Taiwan; the national convention of the Music Educators National Conference (now NAfME); divisional conferences of the Southwest and North-Central College Band Directors National Association; the state conferences of the Illinois Music Educators and Colorado Music Educators; and twice in New York City’s Carnegie Hall. He resides in Lebanon, Illinois, with his spouse, Dr. Jennifer Moder-Bell and their pup, Wiggles.",
      "conductor_photo": "",
      "band_section": "Exhibition",
      "contact_email": "stlouisbrassband@gmail.com",
      "choice_pieces": [
        {
          "title": "Purcell Variations",
          "composer": "Oliver Waespi",
          "performance_slot": "EX_A"
        },
        {
          "title": "The Raid",
          "composer": "Oliver Waespi",
          "performance_slot": "EX_A"
        }
      ],
      "contest_draw_identifiers": ["EX_A"]
    },

    {
      "id": 41,
      "name": "Ft. Zumwalt South High School Brass Choir",
      "website": "https://sites.google.com/fz.k12.mo.us/fzsbands/about/program-overview",
      "band_bio": "The Fort Zumwalt South Band Program is a comprehensive 6-12 band program that begins with Sixth Grade Beginning Band. Students are placed in small-sized classes with like instruments, which allows your child to receive one-on-one instruction in a small group lesson-style class, giving him or her the best opportunity for success. As students move through the Band Program, they will have more and more opportunities to perform and participate in other Band activities. In seventh and eighth grade, students can participate in our after-school Jazz Band, audition for district honor bands, and perform at special events, such as Medieval Day, Veterans Day, and even a half time show at the South High School varsity football game! In high school, Band students have the opportunity to join our award-winning Bulldog Brigade Marching Band, as well as other ensembles, including Jazz Band, Symphonic Band, Wind Ensemble, Woodwind Choir, Brass Choir, Modulation Z Drumline, Pep Band, and Pit Orchestra. In addition, our bands have traveled across the country to destinations including Chicago and Disney World! The possibilities for musical growth are endless! Band is so much more than just a class during the school day – it is an outlet for your child to learn a new skill, make new friends, and perhaps even find a lifelong passion. At Fifth Grade Preview Night, your child can try as many of the instruments below as he or she likes in order to find the one that best suits him or her. There will professionals on each instrument there to help your child make his or her first sounds. If you have any questions about the Fort Zumwalt South Band Program, please do not hesitate to contact us! Brass Choir focuses on performing brass choir literature and participates in the State Large Ensemble Festival. All brass instrumentalists (trumpet, horn, trombone, euphonium, tuba) are welcome to participate. Rehearsals are once a week after school, starting after Marching Band season. Auditions are for chair placements only. The director will not turn away any interested students.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/41/band-logo.gif",
      "band_logo": "",
      "conductor_name": "",
      "conductor_bio": "",
      "conductor_photo": "",
      "band_section": "Brass Choir",
      "contact_email": "",
      "choice_pieces": [
        {
          "title": "Second Suite in F",
          "composer": "Gustav Holst",
          "performance_slot": "BC_A"
        }
      ],
      "contest_draw_identifiers": ["BC_A"]
    },

    {
      "id": 42,
      "name": "St. Louis Academy Brass Band",
      "website": "https://www.stlbb.org/academy",
      "band_bio": "Contact STLAcademyBrassBand@gmail.com for more information",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "Matt Kuebler",
      "conductor_bio": "Mr. Matt Kuebler (Master Sergeant retired), St. Louis Academy Brass Band Director, is Adjunct Low Brass Professor and Lecturer with McKendree University and Southern Illinois University Edwardsville. At McKendree University, he has conducted the High School Honors Brass Ensemble, the Low Brass Ensemble, and the Middle School Band Camp.  Mr. Kuebler has been a private tuba and euphonium instructor since 1996 and has taught masterclasses all over the United States and internationally in Kyrgyzstan and Qatar during a deployment. Mr. Kuebler attended the University of Kentucky and earned a Bachelor of Music degree in 1995. In 2001, he earned a Master of Music Degree from Indiana University, Bloomington, Indiana. He also was accepted in the doctoral program of Cincinnati College Conservatory of Music (CCM) were he attended from 1997- 1999. In 2001, he became a tubist in the United States Air Force Regional Bands, with assignments at both the USAF Band of Liberty in Boston, Massachusetts and the Air Force Band of Mid-America in the metro east St. Louis area where he retired from military service in 2021. During his Air Force career, Mr. Kuebler performed all over the continental United States and internationally in Japan, Djibouti, Kuwait, Afghanistan, Iraq, Kyrgyzstan and Qatar. He has worked in Missouri, Massachusetts, Indiana, Ohio, Virginia, and Kentucky as a freelance musician. Additionally, Mr. Kuebler was member of the All-American College Band for Disneyland in 1994 and played with Columbus Brass Quintet from 1996-2001. He has been a substitute for the St. Louis Symphony, Metropolitan Orchestra of St. Louis, Richmond Symphony and the Evansville Philharmonic. He has performed with the St. Louis Low Brass Collective and the Lexington Brass Band (KY).  Mr. Kuebler was also a member and featured soloist with the Bay Colony Brass (Greater Boston Metropolitan Area) and the Jack Daniels Original Silver Cornet Band.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/42/conductor_photo.png",
      "band_section": "Non-Traditional",
      "contact_email": "STLAcademyBrassBand@gmail.com",
      "choice_pieces": [
        {
          "title": "The Standard of St. George",
          "composer": "Kenneth Alford",
          "performance_slot": "NT_A"
        },
        {
          "title": "The Dark Side of the Moon",
          "composer": "Paul Lovatt-Cooper",
          "performance_slot": "NT_A"
        }
      ],
      "contest_draw_identifiers": ["NT_A"]
    },


    {
      "id": 43,
      "name": "Free State Brass Band",
      "website": "https://freestatebrassband.org/home",
      "band_bio": "Considered one of the region's hidden musical treasures, the Free State Brass Band has been providing excellence in British-style brass banding to the Northeast Kansas region with concerts throughout the Lawrence, Kansas City, and Topeka metro areas for nearly ten years. Made up of over 30 professional musicians and music educators from around the region, the Free State Brass Band has been feature concert artists at the Kansas Music Educators Workshop and the Kansas Bandmasters Association Conference, and has established itself as a competitive ensemble at both the North American Brass Band Association and the United States Open Brass Band Championships (3rd place in 2019 and 2021). Free State Brass Band is an incorporated non-profit in the state of Kansas and is dedicated to the development of brass band music for the masses throughout Northeast Kansas area and the United States.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/43/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/43/band_logo.jpg",
      "conductor_name": "Tom Davoren",
      "conductor_bio": "Tom Davoren (b.1986) is a conductor and composer with a growing international reputation. He began his conducting career with the BTM Band from South Wales, in the United Kingdom, and has since held positions with Britain's famous Desford Colliery and Fairey Bands, as well as  Bristol’s Filton Concert Brass, with whom he won a National Championship title in 2014. In 2015 he directed Maidstone Wind Symphony to British National Concert Band Championship honors, served as conductor to the National Youth Brass Band of Wales in 2016, and has appeared as a guest conductor in Austria, Lithuania, Norway, Sweden, the United States, Canada, Japan, and South Korea. He led conducting students and directed bands at the University of Salford from 2015 - 2019. Tom's music for band has been premiered, recorded and commissioned by artists including ‘The President’s Own’ United States Marine Band, Central Band of the Royal Air Force, Brass Band of Battle Creek, Cory Band, Jens Lindemann, Steven Mead, and Glenn Van Looy. Memorable performances include New York's Carnegie Hall, the College Band Directors National Association National Conference, BASBWE London Festival, Royal Northern College of Music Festival of Brass, World Music Contest (Kerkrade), Jeju International Wind Ensemble Festival (South Korea), International Tuba Euphonium Association Conferences, International Trumpet Guild Conferences, and the solo and band sections of the National Championships of New Zealand, Australia and Great Britain. He has a special relationship with the Belgian ensemble Brassband Buizingen, acting as their Associate Composer through 2015/16 and became Composer in Residence with the Band of the Welsh Guards, of the Household Division of the British Army, in 2019. Tom studied tuba with Nigel Seaman at the Royal Welsh College of Music & Drama and holds bachelor’s and Master’s degrees in composition from Cardiff University School of Music, where in 2009/10 he was awarded a research scholarship from the Arts and Humanities Research Council and the Welsh Livery Guild Composition Award. He was also a BASCA British Composer Award nominee in 2011, a prizewinner at the EBBA European Composers Competition 2012, the recipient of a Harvey Phillips Award for excellence in composition, presented by the International Tuba Euphonium Association, in 2014, and winner of the American National Band Association 'Merrill Jones' Composition Contest in 2020. Away from traditional band repertoire Tom composed a fanfare for the Royal opening  of the fifth National Assembly for Wales in 2016 whilst his work 'Legacy', commissioned by Tredegar Town Band and the Aneurin Bevan Society, celebrated the 70th Anniversary of the British National Health Service through a performance at Westminster Palace, the Houses of British Parliament. His first work for orchestra, Tourbillon, was premiered by Denmark's Aalborg Symfoniorkester in 2017. Tom is currently on the faculty of Benedictine College in Kansas, as well as a Doctoral Teaching Assistant in Wind Conducting at the University of Kansas, USA, working with Dr. Paul Popiel.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/43/conductor_photo.jpg",
      "band_section": "Open",
      "contact_email": "",
      "choice_pieces": [
        {
          "title": "Prelude on 'Tallis'",
          "composer": "Peter Graham",
          "performance_slot": "O_B"
        },
        {
          "title": "Glow",
          "composer": "Eric Whitacre arr Jacob Vilhelm Larsen",
          "performance_slot": "O_B"
        },
        {
          "title": "Star Lake March",
          "composer": "Eric Ball",
          "performance_slot": "O_B"
        },
        {
          "title": "Land of the Living Skies",
          "composer": "Peter Meechan",
          "performance_slot": "O_B"
        },
        {
          "title": "Tokyo Rising",
          "composer": "Tom Davoren",
          "performance_slot": "O_B"
        }
      ],
      "contest_draw_identifiers": ["O_B"]
    },
    {
      "id": 44,
      "name": "Frontier Brass Band",
      "website": "https://www.facebook.com/frontierbrassbandok/",
      "band_bio": "The Frontier Brass Band was founded in the spring of 2014 and is draws its members from the Oklahoma City Area including brass faculty from OCU, OU, and UCO as well as freelance musicians and community members. FBB is committed to celebrating the unique British brass band genre and takes a leading role in the community to raise arts awareness. Frontier presents four eclectic concerts each season performing a wide range of styles and genres and has collaborated with artists such as Vince DiMartino, Wiff Rudd, Greg Wing, Brian Bowman, and more. The band has enjoyed the opportunities to perform three times at the International William Adam Trumpet Festival as well as performances for the Oklahoma Music Educators Conference, Oklahoma Bandmaster’s Association Summer Conference, and regional International Trumpet Guild and International Tuba Euphonium Conferences. The Frontier Brass Band is thrilled to make the first appearance at the Gateway Championships today and is honored to share the stage with the other groups as well as being part of an expanding brass band scene in the United States.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/44/band_photo.png",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/44/band_logo.png",
      "conductor_name": "Douglas Henderson",
      "conductor_bio": "Douglas Henderson is a musician based out of Stillwater, Oklahoma, and the conductor of the Frontier Brass Band. He served for twelve years as an Associate Professor of Music at Oklahoma State University, where his duties included conducting the Wind Ensemble, Symphonic Band, and Cowboy Marching Band, and taught several courses in music education. Dr. Henderson is active as a guest conductor, adjudicator, and clinician throughout the United States, and he has guest conducted in Austria and Japan. He is a frequent guest conductor of the World Youth Wind Orchestra Project (WYWOP), an ensemble of talented young international musicians from Europe, Australia, Japan, and North America that is associated with the annual Mid Europe Festival. Dr. Henderson received his Bachelor of Music degree from The University of Texas at Austin, his Master of Music degree in Wind Conducting from Michigan State University, and his Doctor of Musical Arts degree in Wind Conducting from The University of Texas at Austin. His primary conducting mentors were Jerry Junkin, Kevin Sedatole, and Robert Carnochan.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/44/conductor_photo.png",
      "band_section": "championship",
      "contact_email": "frontierbrassband@gmail.com",
      "choice_pieces": [
        {
          "title": "Dances and Arias",
          "composer": "Edward Gregson",
          "performance_slot": "C_A"
        },
        {
          "title": "In Love for Me",
          "composer": "Philip harper",
          "performance_slot": "C_A"
        },
        {
          "title": "Journey in Freedom",
          "composer": "Eric Ball",
          "performance_slot": "C_A"
        }
      ],
      "contest_draw_identifiers": ["C_A"]
    },
    {
      "id": 45,
      "name": "Iowa Brass",
      "website": "https://www.iowabrass.com/",
      "band_bio": "Iowa Brass is the only independent, full-time British style brass band in Iowa and is celebrating its 37th anniversary in 2023. In 1985, Don Stine, the director of the city band in Mt. Vernon, Iowa, attended a seminar on the growing brass band movement in the States. A workshop was arranged in eastern Iowa in February of 1986. There were 34 brass and percussion musicians who attended that 2-day event which culminated in a concert at Lindale Mall in Cedar Rapids. Following the clinic, regular rehearsals were held in Mt. Vernon in preparation for the 1986 NABBA Championships in Indianapolis, Indiana. After a strong second place finish, Eastern Iowa Brass Band, Inc. was established as a non-profit, tax-exempt corporation. In 2018 Iowa Brass relocated to its current home in Solon, Iowa. Eastern Iowa Brass Band was put into a hiatus like most live music performance groups during the pandemic. During that time, the members envisioned a new future for brass entertainment, committed themselves to a new chapter in the life of the group and rebranded as Iowa Brass. Since 1986, Iowa Brass has been entertaining audiences throughout Iowa, the Midwest, and beyond. Iowa Brass is comprised of about 35 amateur musicians who live around the Iowa City/Cedar Rapids metro area and rehearsals are held on Thursday evenings in Solon. Iowa Brass typically performs 15 - 20 concerts each year featuring original works for brass band as well as arrangements of popular, jazz, orchestral and wind band music.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/45/band_photo.jpeg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/45/band_logo.png",
      "conductor_name": "Alex Beamer",
      "conductor_bio": "Alexander Beamer has been the Principal Conductor of Iowa Brass since 2013, making this his 10 year anniversary with the group. Throughout his tenure, the band has performed at numerous competitions, including the North American Brass Band Association Championships, the US Open Brass Band Championships, the Dublin Festival of Brass, and the Gateway Brass Band Championships. Mr. Beamer has led the band to accomplishments including Best Performance of a March and 2nd place at the Gateway Brass Band Festival in 2019. He has participated in numerous conducting competitions throughout Europe and in 2016 received a finalist award at the Brass Band conducting competition in Manchester, England. Mr. Beamer completed a master’s degree in Orchestral Conducting at the University of New Mexico (Albuquerque, NM) and a Bachelor’s degree in Music Education from Messiah College. His conducting teachers include Dr. Jorge Perez-Gomez, Dr. Timothy Dixon, and Dr. Bradley Genevro. He has studied percussion with Steve Fidyk, Chris Rose, Doug Cardwell and David Knott. Alex has also participated in many master classes and clinics with some of the nation’stop conductors, such as Mallory Thompson, Eugene Corporon, Dennis Fisher, and Col. Timothy Holton. Alex is the Vice President of School Music Services at West Music. During his down time, he enjoys life in the Amana Colonies with his wife Jessi, 3 boys Oliver, Henry and Paul, and their dog Lola.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/45/conductor_photo.png",
      "band_section": "championship",
      "contact_email": "TheIowaBrass@gmail.com",
      "choice_pieces": [
        {
          "title": "Through the Flames",
          "composer": "Paul Lovatt-Cooper",
          "performance_slot": "C_C"
        },
        {
          "title": "Elegie",
          "composer": "Peter Meechan",
          "performance_slot": "C_C"
        },
        {
          "title": "Lions of Legends",
          "composer": "Thierry Deleruyele",
          "performance_slot": "C_C"
        },
        {
          "title": "The President",
          "composer": "William German",
          "performance_slot": "C_C"
        },
        {
          "title": "Swedish Folk Song",
          "composer": "Peter Graham",
          "performance_slot": "C_C"
        }
      ],
      "contest_draw_identifiers": ["C_C"]
    }
  ],
  
  "performance_schedule": {
    "2023-03-18": [
      {
        "band_id": 34,
        "band_draw": "EX_A",
        "stage": "Main",
        "performance_times": {            
            "start_timestamp": "2023-03-18T11:00:00.000-05:00",
            "end_timestamp": "2023-03-18T11:40:00.000-05:00"
          }
        
      },{
        "band_id": 42,
        "band_draw": "NT_A",
        "stage": "Main",
        "performance_times": {            
          "start_timestamp": "2023-03-18T11:40:00.000-05:00",
          "end_timestamp": "2023-03-18T12:10:00.000-05:00"
          }
        
      },{
        "band_id": 28,
        "band_draw": "NT_B",
        "stage": "Main",
        "performance_times": {            
          "start_timestamp": "2023-03-18T12:10:00.000-05:00",
          "end_timestamp": "2023-03-18T12:45:00.000-05:00"
          }
        
      },{
        "band_id": 41,
        "band_draw": "BC_A",
        "stage": "Main",
        "performance_times": {            
            
          "start_timestamp": "2023-03-18T12:45:00.000-05:00",
          "end_timestamp": "2023-03-18T13:25:00.000-05:00"
          }
        
      },{
        "band_id": 40,
        "band_draw": "O_A",
        "stage": "Main",
        "performance_times": {            
          "start_timestamp": "2023-03-18T13:25:00.000-05:00",
          "end_timestamp": "2023-03-18T14:00:00.000-05:00"
          }
        
      },{
        "band_id": 43,
        "band_draw": "O_B",
        "stage": "Main",
        "performance_times": {            
          "start_timestamp": "2023-03-18T14:00:00.000-05:00",
          "end_timestamp": "2023-03-18T14:40:00.000-05:00"
          }
        
      },{
        "band_id": 44,
        "band_draw": "C_A",
        "stage": "Main",
        "performance_times": {
          "start_timestamp": "2023-03-18T14:40:00.000-05:00",
          "end_timestamp": "2023-03-18T15:30:00.000-05:00"
          }
        
      },{
        "band_id": 1,
        "band_draw": "C_B",
        "stage": "Main",
        "performance_times": {            
          "start_timestamp": "2023-03-18T15:30:00.000-05:00",
          "end_timestamp": "2023-03-18T16:20:00.000-05:00"
          }
        
      },{
        "band_id": 45,
        "band_draw": "C_C",
        "stage": "Main",
        "performance_times": {            
          "start_timestamp": "2023-03-18T16:20:00.000-05:00",
          "end_timestamp": "2023-03-18T17:10:00.000-05:00"
          }
        
      },{
        "band_id": 27,
        "band_draw": "C_D",
        "stage": "Main",
        "performance_times": {            
          "start_timestamp": "2023-03-18T17:10:00.000-05:00",
          "end_timestamp": "2023-03-18T18:00:00.000-05:00"
          }
        
      }
        ]
    
  },
  "venue_details": {
    "name": "Ritenour High School",
    "image": "https://www.ritenour.k12.mo.us/cms/lib/MO01910124/Centricity/ModuleInstance/1466/large/RHS%20grad%20web.jpg",
    "address": "9100 St. Charles Rock Rd., St. Louis, MO 63114",
    "map_file": "https://goo.gl/maps/jNuj2RwdyKqqqne58",
    "description": "The Gateway British Brass Band Festival is happy to once again be taking place at Ritenour High School in St. Louis, MO. The unparalleled fine arts wing holds several rehearsal rooms, a large performance hall, and lots of opportunity for bands to get together and socialize between sets.",
    "link": "https://www.ritenour.k12.mo.us/RHS",
    "contest_name": "Gateway British Brass Band Championships",
    "judge_link": "https://www.stlbb.org/rules",
    "solo_ensemble_link": ""
    
  },
  "partner_details": [
    {
      "image_src": "http://sparrowcourt.com/assets/images/sparrow-court-logo.png",
      "name": "Sparrow Court Consulting",
      "link": "http://www.sparrowcourt.com",
      "background": "#000000"
    },
    {
      "image_src": "https://nabba.org/wp-content/uploads/2019/05/NabbaNew-1.png",
      "name": "North American Brass Band Association",
      "link": "https://nabba.org",
      "background": "#000000"
    }
  ]
}