{
    "band_list": [
        {
            "id": 1,
            "name": "Chicago Brass Band",
            "website": "https://chicagobrassband.org",
            "band_bio": "The Chicago Brass Band is a 30-piece brass and percussion ensemble formed in the British brass band tradition, but with Chicago flair. The band, led by music director Dr. Mark A. Taylor, just celebrated its 20th anniversary. During its first two decades, the Chicago Brass Band has won the North American Brass Band Championship, been awarded Most Entertaining Band at the US Open Brass Band Championships, twice competed in the World Music Contest in the Netherlands, participated in the renowned Whit Friday Marches in England, has been a featured ensemble in front of 40,000 brass fans at the Great American Brass Festival, competed in the 2019 New Zealand National Brass Band Championships, and won first prize at the 2019 Gateway British Brass Band Festival. The band’s favorite activity, however, remains dazzling audiences in Chicago, one of the world’s premiere cities for brass musicianship. The band has particularly enjoyed performances with soloists drawn from the Chicago Symphony Orchestra’s celebrated brass section, including Chris Martin, Charlie Vernon, Gene Pokorny, John Hagstrom, and Mark Ridenour, and multiple collaborations with famed artist Rex Richardson. The Chicago Brass Band was selected to be a Chamber Group at the 2011 Midwest Band and Orchestra Clinic in Chicago, with guest soloist Jens Lindemann- rekindling the brass band movement at this annual convention. Additionally, the Chicago Brass Band has continued engaging young musicians with its Project Horizon initiative, a program developed to promote and enhance the performance and enjoyment of live music in public schools. Through collaborative concerts, workshops, and clinics, the band inspires students to continue to perform and enjoy live music at a high level into and throughout adulthood, even if they do not pursue music as their chosen profession.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/01/band_photo.jpg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/01/band_logo.jpg",
            "conductor_name": "Mark A. Taylor",
            "conductor_bio": "Mark A. Taylor is honored to serve as the Music Director of the internationally award-winning Chicago Brass Band. Dr. Taylor is a conductor, educator, and performer in demand throughout the Great Lakes region. No stranger to brass band leadership, Dr. Taylor is now in his second decade as Music Director of the Milwaukee Festival Brass and serves on the NABBA Board as its current Vice President for Contest Operations. Elsewhere, he is the Music Director of the Waukegan Band (one of America's oldest and most historic civic ensembles) and serves as Band Director at College of DuPage. He received the Doctor of Musical Arts degree in 2016 from the University of North Texas, where his principal conducting teachers were Eugene Migliaro Corporon, Dennis Fisher, and Nicholas Enrico Williams. Dr. Taylor’s dissertation, 'British-Style Brass Bands in U.S. Colleges and Universities,' documented the existence of brass bands in American college music programs, past and present. Prior to his doctoral study, he served five years as Director of Bands and Coordinator of Ensembles at Loyola University Chicago and taught on the music education faculty at the Chicago College of Performing Arts at Roosevelt University. He received the Master of Music degree from Northwestern University, where he studied conducting with John P. Paynter and Stephen G. Peterson and music education with Bennett Reimer and Peter Webster. He received his undergraduate degrees from the University of Notre Dame, where his first conducting teachers were Walter Ginter and Carl Stam. Dr. Taylor and his wife and son reside in Lake Forest, IL.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/11/Mark%20Taylor%20-%20Tom%20Robertson.jpg",
            "contact_email": "matt@billock.org",
            "choice_pieces": [
                {
                    "title": "Metropolis 1927",
                    "composer": "Peter Graham",
                    "performance_slot": "C_L"
                },
                {
                    "title": "Other Lives",
                    "composer": "Oliver Waespi",
                    "performance_slot": "C_L"
                }
            ],
            "band_section": "Championship Section",
            "contest_draw_identifiers": [
                "C_L"
            ]
        },
        {
            "id": 47,
            "name": "East Central University Brass Band",
            "website": null,
            "band_bio": "The East Central University Brass Band, led by Assistant Director of Bands Christi Wans, was founded in January 2019 in Ada, Oklahoma by former director Dr. Jace Vickers. It is the first, and currently the only, collegiate British-style brass band in state of Oklahoma. The group is comprised largely of ECU students and includes music majors, minors, non-majors, and community members who love to play brass band music. The band had strong showings at the 2022-2023 North American Brass Band Association Championships, and the 2019 Gateway Brass Band Festival in St Louis, Missouri. They have previously performed as guest artists at the Fall 2021 Oklahoma Music Educators’ Association Conference and the South Central Regional Tuba-Euphonium Conference at Oklahoma State University.\r\n\r\nThe overall mission of the ECU Brass Band is to foster community and spread joy through musical performance, and the members agree that this is more than just a performing ensemble; they have given back to the community through public concerts at local elementary schools, churches, and homeless shelters. They perform three free concerts per year on the ECU campus in Ada, and the band travels to several Oklahoma high schools annually to recruit and educate prospective students on the magic of British-style brass banding. \r\n\r\nThe ECU Brass Band is excited to return to Gateway this year!",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/47/Band%20pic.jpeg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/47/Band%20logo.png",
            "conductor_name": "Christi Wans",
            "conductor_bio": "Christi Wans is a trumpet player in the Oklahoma City metro area, specializing in piccolo trumpet and soprano cornet. She currently serves as interim Assistant Director of Bands and Instructor of High Brass at East Central University (ECU) in Ada, Oklahoma, where she teaches the ECU Brass Band, ECU Symphonic Band, music education courses, and applied trumpet and horn. She previously held adjunct teaching positions at the University of Oklahoma, University of Science and Arts of Oklahoma, Rose State College, and Southern Nazarene University. \r\n\r\nBefore ECU, Wans served in music ministry for the Salvation Army of Arkansas and Oklahoma as Assistant Divisional Music Director for Music Education, where she restructured the music education curriculum, created foundational corps music programs, and acted as the high brass expert for the division. In this role she also served as assistant director of the AOK Music and Arts Conservatory, where she led the Apache Brass Band, the Catherine Baird Women’s Chorus, and oversaw all private brass instruction.\r\n \r\nPrior to teaching, Wans spent several years as a professional trumpet player. She held positions with the Yakima and Mid-Columbia Symphonies in Washington state, and has performed with the Arkansas Philharmonic, Oklahoma City Philharmonic, Norman Philharmonic, and the Enid Symphony. She traveled Australia, New Zealand, and the South Pacific islands as a showband musician with Princess Cruise Lines, and was the trumpet player for the North America and Asia tours of Kinky Boots, performing over 300 shows in 47 states, Canada, China, and Singapore. Wans is frequently requested as a soloist and recitalist: she has recently performed concertos with the Oklahoma Haydn Festival, East Central University Wind Ensemble, AOK Divisional Band, Frontier Brass Band, Central Washington University Symphony Orchestra, Coeur D’Alene Symphony, and University of Oklahoma Symphony Band, with whom she played the Oklahoma premiere of James Stephenson’s Concerto for Piccolo Trumpet.\r\n\r\nActive in brass banding, Christi plays solo cornet with the United States Southern Staff Band, soprano cornet with the Oklahoma City Citadel band, and principal cornet with the Salvation Army AOK Divisional Band. She has performed in concert and competition on soprano cornet with the Frontier Brass Band, Arkansas Musicworks Brass Band, Fountain City Brass Band, and Dallas Brass Band. \r\n\r\nShe earned her bachelor’s degrees in instrumental music education and trumpet performance from Central Washington University and completed her master’s degree and doctoral coursework in trumpet performance from The University of Oklahoma. Outside of performing, Christi has a deep love for hot sauce – she has over 300 bottles in her personal collection and operates a small-scale pepper farm in her back yard.\r\n \r\nChristi is an Endorsing Artist for Conn-Selmer/Vincent Bach trumpets and Robinson’s Remedies.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/47/Director%20pic.jpeg",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "Horizons",
                    "composer": "Paul Lovatt-Cooper",
                    "performance_slot": "O_D"
                },
                {
                    "title": "Celestial Morn",
                    "composer": "Leslie Condon",
                    "performance_slot": "O_D"
                },
                {
                    "title": "Variations on Laudate Dominum",
                    "composer": "Edward Gregson",
                    "performance_slot": "O_D"
                }
            ],
            "band_section": "Open Section",
            "contest_draw_identifiers": [
                "O_D"
            ]
        },
        {
            "id": 40,
            "name": "Fort Zumwalt South Brass Choir",
            "website": null,
            "band_bio": "The Fort Zumwalt South Brass Choir is an extension of the Fort Zumwalt South Band Program in Saint Peters, Missouri. The group is formed from high school students who volunteer their time and efforts to come together forming this brass choir. The group is led by the FZS Director of Bands, Paul Ahlemeyer.\r\nAt Fort Zumwalt South High School there is a thriving and strong band program. Students are able to enjoy Marching Band, Pep Band, Wind Ensemble, Symphonic Band, Jazz Band, Solos, Small Ensembles, Indoor Drumline, Winter Color Guard, Percussion Ensemble, Woodwind Choir, and Brass Choir. The Band program continues to compete at the district and state level with continued high success.\r\nThe FZS Brass Choir has been in existence for 9 years. Each year the ensemble changes as the high school students continue to graduate and new students join the High School Band Program. Due to the unending events of the Band Program this ensemble only rehearses together during the winter months.\r\nThe director, Paul Ahlemeyer, pushes to keep the desire for high quality music alive in young men and women. The future of great brass music lies with the teenagers of today.",
            "band_photo": null,
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/40/Band%20logo.png",
            "conductor_name": "Paul Ahlemeyer",
            "conductor_bio": "Paul Ahlemeyer, Director of Fort Zumwalt South Brass Choir, was born and raised in Lincoln, Nebraska. Paul Ahlemeyer started playing trombone when he was 11 years old. The original plan was percussion, but he was destined for trombone. In high school Paul took the next step and took on the bass trombone. Paul went on to study music education at the University of Nebraska. After earning his bachelor’s degree Paul moved to the St. Louis area. He was quickly integrated into the St. Louis music scene. Paul is the Director of Bands at Fort Zumwalt South High School. He has been the Director of Bands since 2015. The Band Program has continued to grow in quality and quantity over the last 9 years. The FZS Band Program continues to build upon high levels of integrity and dedication to the art of great music making. The biggest part of Paul’s life is his family. Paul’s wife, Lauren, makes all of this possible. Paul looks forward to teaching his two sons, Isaac and Luke, how to make great music when they are old enough. The two young Ahlemeyers will hopefully be future brass musicians of the highest caliber.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/40/Director%20pic.png",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "How Great Our Joy",
                    "composer": "Dana F. Everson",
                    "performance_slot": "NT_A"
                },
                {
                    "title": "Prelude, Ballad, and Celebration",
                    "composer": "Naoya Wada",
                    "performance_slot": "NT_A"
                }
            ],
            "band_section": "Non-Traditional Brass Band",
            "contest_draw_identifiers": [
                "NT_A"
            ]
        },
        {
            "id": 31,
            "name": "Fountain City Brass Band",
            "website": "www.fcbb.net",
            "band_bio": "Founded in 2002, the Fountain City Brass Band, based in Kansas City, USA, seeks to bridge the gap between popular and classical art music by performing a wide variety of music, including modern compositions written specifically for brass bands and innovative arrangements of classical works, jazz, and Broadway hits.\r\n\r\nFountain City has been featured performers throughout North America and Europe at such events as the Midwest Clinic, Brass in Concert, Great American Brass Band Festival, U.S. Masters Brass Entertainment Championships, Glenn Miller Festival, International Trombone Festival, International Tuba & Euphonium Conference, Longs Peak Scottish Irish Highlands Festival, Missouri Music Educators Association Conference, Kansas Music Educators Association Conference, Missouri Bandmasters Association, Nebraska Bandmasters Association, Celebration at the Station, and the Scottish Festival of Brass, as well as collaborated with many of the world's most prominent brass and percussion solo artists.\r\n\r\nThe band actively seeks to initiate cultural revitalization and arts awareness in the Kansas City community. In 2008, Dr. Helen Harrelson established The Fountain City Youth Brass Academy as the educational outreach component of the Fountain City Brass Band. The mission of the Academy is to inspire young musicians of all performance ability levels to achieve a high standard of musicianship and to foster a life-long love of music.\r\n\r\nWhen not performing in concert, Fountain City maintains an active competition schedule. Since the band’s first competition in 2005, it has won 10 U.S. Open Brass Band Championships, 9 North American Brass Band Championships, and 1 Scottish Open Brass Band Championship, becoming the first U.S. band ever and the first non‐UK band in over 50 years, to win a major brass band competition on UK soil. For over a decade, Fountain City has been the top-ranked brass band in North America.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/31/fcbb%20blue%20stage%20cropped%20-%20Lee%20Harrelson.jpeg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/31/FCBB%20Logo%20Stroke%20-%20Lee%20Harrelson.png",
            "conductor_name": "Michael Fowles",
            "conductor_bio": "Widely regarded as one of the leading conductors of his generation Michael hails from the rich musical tradition of North Staffordshire. He is an honours and post-graduate of the Royal Northern College of Music and has been Musical Director of Foden’s Band since 2009 and Professional Conductor of the Desford Colliery Band since 2016.\r\n\r\nHaving worked with many of the country’s leading bands Michael has a reputation for entertaining concert programming and high standards in competition. He is well known for having transferable skills having won Championship section contests with 11 different bands either in regular working relationships or on a freelance basis. As such he is much in demand both in the UK and abroad.\r\n\r\nMichael is also a member of the Association of Brass Band Adjudicators and has officiated at numerous Regional Qualifying contests, The National Finals, Butlins Mineworkers Festival and the Swiss Nationals amongst others.\r\n\r\nEducational work also forms an important part of Michael’s musical life. He is Course Director of both the Wessex Band Summer School and Fodens Armagh Summer School. He is Musical Director of Fodens Youth Band and Associate Conductor and Musical Adviser of Lions Youth Band. As a guest conductor he undertakes much training work throughout the UK with bands of all levels from championship to youth.\r\n\r\nMichael’s work in the recording studio is also highly respected having directed around 45 CDs including numerous solo discs, his skills for accompanying being held in high regard. In addition, he has given many premiere performances, conducted concerto appearances of eminent soloists and directed broadcasts for both BBC Radio 2 and 3. He has also written articles and reviews for both Brass Band World and British Bandsman.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/31/GS1_6772b%20-%20Lee%20Harrelson.jpg",
            "contact_email": "fcbb@fcbb.net",
            "choice_pieces": [
                {
                    "title": "Angels and Demons",
                    "composer": "Philip Sparke",
                    "performance_slot": "C_K"
                },
                {
                    "title": "Other Lives",
                    "composer": "Oliver Waespi",
                    "performance_slot": "C_K"
                }
            ],
            "band_section": "Championship Section",
            "contest_draw_identifiers": [
                "C_K"
            ]
        },
        {
            "id": 24,
            "name": "Fountain City Youth Brass Academy",
            "website": "www.fcyba.net",
            "band_bio": "The Fountain City Youth Brass Academy (FCYBA) is the educational outreach component of the Fountain City Brass Band, North America’s premiere volunteer brass and percussion ensemble. The mission of the FCYBA is to inspire young musicians of all performance ability levels to achieve a high standard of musicianship and to foster a life-long love of music.\r\n\r\nThe Fountain City Youth Brass Academy was founded in 2008 by Helen Harrelson while she was on a sabbatical from her job in England. Helen is a native of England and grew up in the brass band tradition before attending the Royal Northern College of Music. From there, she became one of the world’s foremost baritonists and performed with some of the finest bands in the United Kingdom. Her passion for music education and this rich tradition led her to establish the FCYBA.\r\n\r\nThe FCYBA began as day-long ‘Expo’ workshops and has grown into season-long brass bands with over 150 members. The bands within the Academy are made up of brass and percussionists of all standards and abilities from late elementary through young adult. The bands of the FCYBA are non-cut programs for participants 18 years of age and younger. The conductors and specialists for the FCYBA bands are professional music educators that also perform with the Fountain City Brass Band.\r\n\r\nSince its inception, the bands of the FCYBA have won numerous national championships at the North American Brass Band Championships and the US Open Brass Band Championships, and been featured at prestigious events such as the Great American Brass Band Festival and the Kansas Music Educators Association’s annual conference.",
            "band_photo": null,
            "band_logo": null,
            "conductor_name": "Lee Harrelson",
            "conductor_bio": "Lee Harrelson is a Professor of Music at Missouri Western State University. At Missouri Western, he serves as the Director of Instrumental Studies and Bands, low brass specialist, and conducts the Missouri Western Symphonic Winds. Dr. Harrelson has also served on the faculties of the University of Kansas, the University of Central Missouri, and the UMKC Conservatory. Dr. Harrelson attended the University of Southern Mississippi, where he studied music education and performance before completing his masters and doctorate at the UMKC Conservatory.\r\n\r\nDr. Harrelson is the founder of the Fountain City Brass Band and currently serves as its artistic director, executive director, and principal euphoniumist.\r\n\r\nDedicated to furthering the development of brass bands in America, Dr. Harrelson, along with his wife Helen, founded the Fountain City Youth Brass Academy in 2009, which regularly serves 120 students per year, and in 2019, the National Youth Brass Band of America. After serving three years as the executive director of the U.S. Open Brass Band Championships, in 2022, Dr. Harrelson founded the US Masters Brass Band Entertainment Championships.\r\n\r\nIn the fall of 2019, Dr. Harrelson was awarded the first-ever Visiting International Professor position with the world-famous Brighouse & Rastrick Band.\r\n\r\nDr. Harrelson can be heard on numerous commercially released recordings and has appeared throughout North America and Europe as a clinician, soloist, and chamber musician. He is a Besson/Buffet Crampon performing artist.",
            "conductor_photo": null,
            "contact_email": "helen@fcbb.net",
            "choice_pieces": [
                {
                    "title": "Fearless",
                    "composer": "Andrew Wainwright",
                    "performance_slot": "O_G"
                },
                {
                    "title": "The Unfortunate Traveler",
                    "composer": "Imogen Holst",
                    "performance_slot": "O_G"
                }
            ],
            "band_section": "Third Section",
            "contest_draw_identifiers": [
                "O_G"
            ]
        },
        {
            "id": 46,
            "name": "Free State Brass Band",
            "website": null,
            "band_bio": "Free State Brass Band- Considered one of the region's musical treasures, the Free State Brass Band has been providing excellence in British-style brass banding to the northeast Kansas region with concerts throughout the Lawrence, Kansas City, and Topeka metro areas for ten years. Free State Brass Band is dedicated to the development of brass band music for the masses throughout the northeast Kansas area and the United States.\r\nMade up of over 30 professional musicians and music educators from around the region, the Free State Brass Band has been feature concert artists at the Kansas Music Educators Workshop and the Kansas Bandmasters Association Conference, and has established itself as a competitive ensemble at the North American Brass Band Association and the United States Masters Brass Band Championships (3rd place in 2019 and 2021), and Gateway Championships (2nd in 2023).",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/46/Band%20photo.jpg",
            "band_logo": null,
            "conductor_name": "Stuart O'Neil",
            "conductor_bio": "Stuart O’Neil has taught vocal and instrumental music in Kansas public schools since 1993. He received a Bachelor of Music Education from the University of Nebraska and a Master of Music Theory from the University of Kansas. In addition to his work as a teacher and performer, Stuart is also a composer, and his works are published by Keiser Southern, TRN, Tapspace Publications, Cherry Classics, Alliance Music Publications, Santa Barbara Music Press, Colla Voce Music, and the UNC Jazz Press. Stuart currently lives in Lawrence, KS, with his family.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/46/oneil_stuart_photo.jpg",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "The Unfortunate Traveler",
                    "composer": "Imogen Holst",
                    "performance_slot": "O_E"
                },
                {
                    "title": "Momentum",
                    "composer": "Stuart P. O'Neil",
                    "performance_slot": "O_E"
                },
                {
                    "title": "Cross of Honor",
                    "composer": "William Rimmer",
                    "performance_slot": "O_E"
                },
                {
                    "title": "Vidda",
                    "composer": "Ole Edvard Antonsen and Atle Halstensen",
                    "performance_slot": "O_E"
                },
                {
                    "title": "A Little Prayer",
                    "composer": "Evelyn Glennie",
                    "performance_slot": "O_E"
                },
                {
                    "title": "Dance: Zeibékikos",
                    "composer": "Philip Wilby",
                    "performance_slot": "O_E"
                }
            ],
            "band_section": "Open Section",
            "contest_draw_identifiers": [
                "O_E"
            ]
        },
        {
            "id": 45,
            "name": "Frontier Brass Band",
            "website": null,
            "band_bio": "The Frontier Brass Band is celebrating their 10th Anniversary this spring and is draws its members from the Oklahoma City Area including brass faculty from the regional universities as well as music educators, freelance musicians, and community members. FBB is committed to celebrating the unique British brass band genre and takes a leading role in the community to help raise arts awareness. Frontier presents four eclectic concerts each season performing a wide range of styles and genres and has collaborated with artists such as Vince DiMartino, Wiff Rudd, Greg Wing, Brian Bowman, and more. The band has performed three times at the International William Adam Trumpet Festival as well as performances for the Oklahoma Music Educators Conference, Oklahoma Bandmaster’s Association Summer Conference, regional International Trumpet Guild and International Tuba Euphonium Conferences, and last fall was selected to perform for the 100th Anniversary of the Marine Corps League, the first time any ensemble has been asked to do so. Frontier Brass was the 2022 and is the reigning 2023 U.S. Masters Brass Band Champions and is very active in regional brass band competitions and events.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/45/FBB%20bio%20photo%20.png",
            "band_logo": null,
            "conductor_name": "Doug Lindsey",
            "conductor_bio": "Dr. Douglas Lindsey has recently joined the Frontier Brass Band as their new Music Director after moving to Oklahoma to accept his new position as Assistant Professor of Trumpet at the University of Oklahoma. Prior to his time at OU, Dr. Lindsey was the Associate Professor of trumpet and brass area coordinator at Kennesaw State University and served as President and Principal Cornet of the Georgia Brass Band for many years. He has also performed on many occasions with the international award-winning Fountain City Brass Band and is currently serving as their principal solo cornetist. As a soloist, he has performed many times at the International Trumpet Guild conference, at the Atlanta Trumpet Festival, at the Trumpet Festival of the Southeast and recently, in collaboration with pianist Kristy Olefsky, Dr. Lindsey released his first solo album, Impressions of France. As an orchestral musician, he has performed as principal trumpet of the Memphis Symphony, as section trumpet with the Atlanta Symphony Orchestra, as principal trumpet of the Georgia Symphony Orchestra, as section trumpet with the Macon Symphony, and spent two summers as an orchestral fellowship winner at the Aspen Music Festival.\r\nPrevious to earning his DMA at the University of Wisconsin-Madison, Dr. Lindsey studied with Allan Dean at Yale, earning his Master of Music with the distinction of winning the John Swallow excellence in brass prize. Prior to Yale he studied with Ray Mase, Louis Ranger, Kevin Cobb, Scott Moore and Richard Rulli. Dr. Lindsey received his music performance and music education degrees magna cum laude from the University of Arkansas-Fayetteville. Dr. Lindsey is a Mercer and Barker mouthpiece and Schilke trumpet artist.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/45/Doug%20Linsey%20-%20headshot.jpeg",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "Dances and Alleluias",
                    "composer": "Philip Sparke",
                    "performance_slot": "C_H"
                },
                {
                    "title": "Paganini Variations",
                    "composer": "Philip Wilby",
                    "performance_slot": "C_H"
                }
            ],
            "band_section": "Championship Section",
            "contest_draw_identifiers": [
                "C_H"
            ]
        },
        {
            "id": 42,
            "name": "Iowa Brass",
            "website": null,
            "band_bio": "Iowa Brass is the only independent, full-time British style brass band in Iowa and is celebrating its 37th anniversary in 2023. In 1985, Don Stine, the director of the city band in Mt. Vernon, Iowa, attended a seminar on the growing brass band movement in the United States. A workshop was arranged in eastern Iowa in February of 1986. There were 34 brass and percussion musicians who attended that 2-day event which culminated in a concert at Lindale Mall in Cedar Rapids.\r\n​\r\nFollowing the clinic, regular rehearsals were held in Mt. Vernon in preparation for the 1986 NABBA Championships in Indianapolis, Indiana. After a strong second place finish, Eastern Iowa Brass Band, Inc. was established as a non-profit, tax-exempt corporation. In 2018 Iowa Brass relocated to its current home in Solon, Iowa. Eastern Iowa Brass Band was put into a hiatus like most live music performance groups during the pandemic. During that time, the members envisioned a new future for brass entertainment, committed themselves to a new chapter in the life of the group and rebranded as Iowa Brass. \r\n​\r\nSince 1986, Iowa Brass has been entertaining audiences throughout Iowa, the Midwest, and beyond. Iowa Brass is made up of about 35 amateur musicians who live around the Iowa City/Cedar Rapids metro area and rehearsals are held on Thursday evenings in Solon. Iowa Brass typically performs 15 - 20 concerts each year featuring original works for brass band as well as arrangements of popular, jazz, orchestral and wind band music.",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/42/Band%20Photo.jpg",
            "band_logo": null,
            "conductor_name": "Alex Beamer",
            "conductor_bio": null,
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/42/Alex%20Beamer%20pic.jpg",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "Where Eagles Sing",
                    "composer": "Paul Lovatt-Cooper",
                    "performance_slot": "C_J"
                },
                {
                    "title": "Battle Abbey",
                    "composer": "George Allan",
                    "performance_slot": "C_J"
                },
                {
                    "title": "Song for Ina",
                    "composer": "Philip Sparke",
                    "performance_slot": "C_J"
                },
                {
                    "title": "Voyage to Worlds Unknown",
                    "composer": "Peter Graham",
                    "performance_slot": "C_J"
                }
            ],
            "band_section": "Championship Section",
            "contest_draw_identifiers": [
                "C_J"
            ]
        },
        {
            "id": 43,
            "name": "SIUE Trumpet Ensemble",
            "website": null,
            "band_bio": "The SIUE Trumpet Ensemble is comprised of students from the SIUE Trumpet Studio. From 1995-2021, the group was directed by Dr. John Korak, the current music department chair. During that time the group performed with such artists as Crispian Steele-Perkins, Philip Smith, and Susan Slaughter, and Leonard Candelaria.\r\n \r\nThe ensemble was selected to perform at the International Trumpet Guild Conference in Harrisburg, Pennsylvania, where they were the only collegiate ensemble to feature Baroque trumpets during the conference.\r\n\r\nBeginning in the Fall of 2021, renowned teacher and performer Mary Weber began her tenure as the director of the ensemble as well as the trumpet studio teacher. A frequent performer with the Saint Louis Symphony, Mary brings a wealth of performing and pedagogical experience to the trumpet studio.\r\n \r\nCurrent members of the studio are:\r\n \r\n                Ariana Coan, senior, music performance, Staunton, IL\r\n                Scott DeLozier, junior, music minor, Granite City, IL\r\n                Daniel Ramirez, sophomore, music education, Troy, IL\r\n                Aubrey Morgan, sophomore, music education, Edwardsville, IL\r\n                Maya Chapman, freshman, music minor, Granite City, IL",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/43/Ensemble%201.heic",
            "band_logo": null,
            "conductor_name": "Mary Weber",
            "conductor_bio": "Mary works in numerous ensembles throughout the St. Louis Metro area, including the St. Louis Symphony were she has been a Sub / Replacement / Extra since 1986, Principal Replacement / 2nd Illinois Symphony 1993 – 2006, Principal and frequent soloist with the Compton Heights Concert Band, Opera Theater St. Louis, Union Avenue Opera, Bob Coleman Orchestra and formerly with the St. Louis Brass Band where she was a featured soloist on Eb Soprano and Bb Cornet on numerous occasions.\r\nMary was Principal Trumpet in the New Orleans Symphony for two years. Her virtuosity and enthusiasm for music has provided her with far-ranging performances with such notables as Mannheim Steamroller, Luciano Pavarotti, Mel Torme, Ann Hampton-Callaway, The Temptations and Pope John Paul II ! She has toured throughout the United States and Europe including Carnegie Hall with the St. Louis Symphony. She attended the Tanglewood Institute as a Fellowship of Leonard Bernstein, the Spoleto Festival (U.S. and Spoleto, Italy), Classical Music Festival (Eisenstadt, Austria).\r\nShe is actively engaged in recordings, competitions, recitals and lectures, and is the manager of the Clarion Brass. She holds a Bachelor of Music Performance from university of Miami (FL), a Bachelor of Sports Psychology from University of Miami, a Master of Music Performance from Syracuse University. She was Adjunct Professor at St. Louis University teaching Music Appreciation, Development of the Orchestra, Bio-Musicology, Symphonic Literature and Music Theory from 1998 – 2007. Mary also taught Trumpet at SIUE during the Spring 2006 for Dr. John Korak when he took Sabbatical, and is currently teaching there again during Dr. Korak’s tenure as department chair. She has also been the Conductor of several ensembles including the Oasis New Horizon’s Band when it began in St. Louis in 1999.\r\nAt present, Mary has been a Bugler doing Military Honors at Jefferson Barracks National Cemetery since 2006. Most recently, Mary produced her first Holiday CD with the members of Clarion Brass titled “Sleigh Ride - Over The Top!” She is thrilled to be an Artist on the “Eye-full-tower” Record Label. She loves teaching private trumpet lessons with students ranging in age from 10 — 77!",
            "conductor_photo": null,
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "Cinq Petites Pieces",
                    "composer": "Yvonne DesPortes",
                    "performance_slot": "NT_C"
                }
            ],
            "band_section": "Non-Traditional Brass Band",
            "contest_draw_identifiers": [
                "NT_C"
            ]
        },
        {
            "id": 44,
            "name": "St. Louis Academy Brass Band",
            "website": null,
            "band_bio": null,
            "band_photo": null,
            "band_logo": null,
            "conductor_name": "Ryan Goetter, Bradley Eston",
            "conductor_bio": "Meet Mr. Bradley Eston, the other director of our 2023-24 St. Louis Academy Brass Band. Bradley Eston was raised in Quincy, Il where he first started on trumpet. In 8th grade, he made the switch to Euphonium which he has stuck with ever since. Bradley is currently finishing up his Music Education degree from McKendree University. During his time at McKendree, he was involved in the McKendree Marching Band, Jazz Band, Concert Band, Wind Ensemble, Spirit Band, Concert Choir, and Chamber Choir. Mr. Eston has also had the opportunity to conduct the McKendree Concert Band, Concert Choir, Chamber Choir, and Chamber Ensembles on several concerts. Outside of band, he served on the McKendree ILCMEA Chapter board as Vice president one year and President for two. Bradley Eston has been the Brass Technician for the Collinsville High School Marching Band for the past three years. He has also assisted in sectionals at CHS as well as Madison High School. Currently, he is in his student teaching in the Granite City School District where he gets to work with and observe 7-12 graders. Mr. Eston loves traveling and attending conducting symposiums. In the Spring of 2023, Mr. Eston traveled to the Northern Illinois University Symposium to learn from Dr. Thomas Bough and Dr. Wendy Matthews. Then, in the Summer of 2023, he traveled to the University of Missouri Kansas City, where he had the opportunity to learn from Dr. Joe Parisi, Dr. Beth Peterson, Dr. Jamie Nix, Dr. Mallory Thompson, and Dr. Stephen Davis. Outside of music, Mr. Eston enjoys relaxing in his hammock and spending time outside.\r\n\r\n\r\nMeet Mr. Ryan Goetter, one of our 2023-24 St. Louis Academy Brass Band Directors. Ryan Goetter was raised in Collinsville, IL. He started band in 5th grade on trumpet. As he got older he learned Euphonium, French Horn, and Mellophone. Ryan earned his Bachelor of Music Education degree from Missouri State University. During this time he was a member of the PRIDE of Missouri State Marching Band, Jazz Studies program, Concert Bands, Pep Band, and various small ensembles. Mr. Goetter also spent 2 marching seasons as a Crew member for the PRIDE of Missouri State. Outside of band Mr. Goetter was a founding Father of Lambda Chi Alpha - Beta-Psi Zeta where he held multiple position including Academics Chair, Ritualist, Judicial Board Rep, and Leadership Development Chair. He was a member of the Honorary Band Service Fraternity Kappa Kappa Psi. Ryan served as the Director of Bands/Music educator at DuQuoin Middle School from 2019-2021. At DuQuoin he taught beginning band, concert band, marching band, pep band, 6th music history, and 7th grade ukulele. In 2021, Ryan moved back home to Collinsville where he was the Assistant Band Director at Collinsville Middle School and Dorris Intermediate School as well as assisted with the high school Marching Band and Wind Ensemble. In fall, 2022, Ryan started in his current position as the Assistant Director of Bands for Collinsville High School where he leads the Symphonic Band and Pep Band and assists with the Marching Band and Wind Ensemble. Outside of school related activities, Ryan was selected as part of an Illinois All State band that toured Europe for two weeks performing concerts in multiple countries. He also loves to Disc Golf.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/44/BEston%20pic.jpeg",
            "contact_email": null,
            "choice_pieces": [
                {
                    "title": "Images for Brass",
                    "composer": "Stephen Bulla",
                    "performance_slot": "NT_B"
                },
                {
                    "title": "Radetzky March",
                    "composer": "Johann Strauss, arr. W.B. Hargreaves",
                    "performance_slot": "NT_B"
                },
                {
                    "title": "Deep Inside the Sacred Temple",
                    "composer": "Georges Bizet, arr Keith Wilkinson",
                    "performance_slot": "NT_B"
                }
            ],
            "band_section": "Non-Traditional Brass Band",
            "contest_draw_identifiers": [
                "NT_B"
            ]
        },
        {
            "id": 16,
            "name": "St. Louis Brass Band",
            "website": "stlbb.org",
            "band_bio": "Founded in 1998, the Saint Louis Brass Band features some of the area’s finest brass musicians, educators, and students, who come together to perform classics, marches, jazz, and the very best contemporary brass band music. Acclaimed by the St. Louis Post-Dispatch as “one of the city’s newest treasures,” the STLBB has won awards at NABBA and the US Open Brass Band Championships. Generous financial support has come from the Missouri Arts Council, Regional Arts Commission, Ameren Illinois, the Garvey Foundation, Boeing, and area music stores throughout the region.\r\n\r\nIn 2014, the St. Louis Academy Brass Band was established as part of the Educational Outreach Program. The Fall of 2017 saw the establishment of Brass Extravaganza!: two days of brass and percussion workshops, clinics, rehearsals, and performances for students Grades 8 through college level, all led by members of the Saint Louis Brass Band.\r\n\r\nGuest soloists with the Saint Louis Brass Band include Patrick Sheridan (Brass Gym co-writer), Karin Bliznik (former Principal Trumpet - St. Louis Symphony Orchestra), Gerry Pagano (Bass Trombone, retired - St. Louis Symphony Orchestra), J.D. Shaw (Boston Brass co-founder and horn), Christine Brewer (Grammy award-winning soprano), and Demondrae Thurman (Professor of Euphonium, Indiana University).",
            "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/16/STLBB%2023%20-%20David%20Drillinger.jpg",
            "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/16/STLBB%20Logo%20-%20David%20Drillinger.png",
            "conductor_name": "John Bell",
            "conductor_bio": "Dr. John Bell has served as the Music Director of the Saint Louis Brass Band since 2009. In this role he has developed the band’s repertoire and guided the ensemble to participation at the US Open, the Dublin Festival of Brass, and the North American Brass Band Championships in Huntsville, Alabama.\r\n\r\nDr. Bell served as Professor of Music and Director of Bands at Southern Illinois University Edwardsville beginning in 1990, where he conducted the Wind Symphony and Chamber Winds, taught conducting and music education courses, and coordinated recruiting and auditions for the Department of Music. Dr. Bell retired from SIUE in May, 2020. He currently is on the teaching staff at McKendree University, where he has responsibility for the university’s wind ensemble.\r\n\r\nPrior to coming to Illinois Dr. Bell was Associate Director of Bands at the University of Northern Colorado, where he founded and directed the university’s marching band and the UNC Brass Band. He was also appointed the Music Director and conductor of the Rocky Mountain Brassworks in Denver.\r\n\r\nDr. Bell is an elected member of the ABA and ASBDA and holds memberships in Phi Mu Alpha Sinfonia, the CBDNA, and Pi Kappa Lambda, the national Music Honor Society. He has received the National Band Association’s Citation of Excellence.\r\n\r\nDr. Bell continues to adjudicate pageantry and symphonic championships across the US, in Canada, Japan, and Thailand, as well as for DCI, BOA, and US Bands. He is the Illinois coordinator for the Illinois Ambassadors of Music European Tour and led a 450 person All-Illinois entourage in the summer of 2023.",
            "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/16/JBell%20pic%20-%20David%20Drillinger.jpeg",
            "contact_email": "stlouisbrassband@gmail.com",
            "choice_pieces": [
                {
                    "title": "Kingdom of Dragons",
                    "composer": "Philip Harper",
                    "performance_slot": "C_I"
                },
                {
                    "title": "Albinus Variations",
                    "composer": "Etienne Crausaz",
                    "performance_slot": "C_I"
                }
            ],
            "band_section": "Second Section",
            "contest_draw_identifiers": [
                "C_I"
            ]
        }
    ],
    "performance_schedule": {
        "2024-03-16": [
            {
                "band_id": 40,
                "band_draw": "NT_A",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T08:30:00-05:00",
                    "end_timestamp": "2024-03-16T08:50:00-05:00"
                }
            },
            {
                "band_id": 44,
                "band_draw": "NT_B",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T08:50:00-05:00",
                    "end_timestamp": "2024-03-16T09:20:00-05:00"
                }
            },
            {
                "band_id": 43,
                "band_draw": "NT_C",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T09:20:00-05:00",
                    "end_timestamp": "2024-03-16T09:50:00-05:00"
                }
            },
            {
                "band_id": 47,
                "band_draw": "O_D",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T11:05:00-05:00",
                    "end_timestamp": "2024-03-16T11:40:00-05:00"
                }
            },
            {
                "band_id": 46,
                "band_draw": "O_E",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T11:40:00-05:00",
                    "end_timestamp": "2024-03-16T12:15:00-05:00"
                }
            },
            {
                "band_id": 24,
                "band_draw": "O_G",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T12:15:00-05:00",
                    "end_timestamp": "2024-03-16T12:50:00-05:00"
                }
            },
            {
                "band_id": 45,
                "band_draw": "C_H",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T13:30:00-05:00",
                    "end_timestamp": "2024-03-16T14:20:00-05:00"
                }
            },
            {
                "band_id": 16,
                "band_draw": "C_I",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T14:20:00-05:00",
                    "end_timestamp": "2024-03-16T15:10:00-05:00"
                }
            },
            {
                "band_id": 42,
                "band_draw": "C_J",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T15:10:00-05:00",
                    "end_timestamp": "2024-03-16T16:00:00-05:00"
                }
            },
            {
                "band_id": 31,
                "band_draw": "C_K",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T16:00:00-05:00",
                    "end_timestamp": "2024-03-16T16:50:00-05:00"
                }
            },
            {
                "band_id": 1,
                "band_draw": "C_L",
                "stage": "Main Stage",
                "title": null,
                "details": null,
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T16:50:00-05:00",
                    "end_timestamp": "2024-03-16T17:40:00-05:00"
                }
            },
            {
                "band_id": null,
                "band_draw": "session_1",
                "stage": "Main Stage",
                "title": "Awards",
                "details": "Band awards will start 10 minutes after the final performance",
                "slot_image": null,
                "performance_times": {
                    "start_timestamp": "2024-03-16T17:50:00-05:00",
                    "end_timestamp": "2024-03-16T18:00:00-05:00"
                }
            }
        ]
    },
    "venue_details": {
        "name": "Ritenour High School",
        "image": "https://ritenourlive.org/wp-content/uploads/2015/04/RHS-Auditorium.jpg",
        "address": "9100 St Charles Rock Rd, St. Louis, MO 63114",
        "map_file": "https://maps.app.goo.gl/TFmNgrwADQVW7qff9",
        "description": "The Gateway Brass Band Festival is once again happy to host the event at Ritenour High School.",
        "link": "https://rhs.ritenourschools.org/",
        "contest_name": "Gateway Brass Band Festival 2024",
        "judge_link": null,
        "solo_ensemble_link": null
    },
    "partner_details": [
        {
            "image_src": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/partner_logos/sparrow-court-logo.png",
            "name": "Sparrow Court Consulting",
            "link": "https://www.sparrowcourt.com",
            "background": "#FFFFFF"
        }
    ]
}