{
  "band_list": [
    {
      "id": 1,
      "name": "The Chicago Brass Band",
      "website": "https://chicagobrassband.org",
      "band_bio": "The Chicago Brass Band is a 30-piece brass and percussion ensemble formed in the British brass band tradition, but with Chicago flair. The band, led by music director Dr. Mark Taylor, just celebrated its 20th anniversary. During its first two decades, the Chicago Brass Band has won the North American Brass Band Championship, been awarded Most Entertaining Band at the US Open Brass Band Championships, twice competed in the World Music Contest in the Netherlands, participated in the renowned Whit Friday Marches in England, has been a featured ensemble in front of 40,000 brass fans at the Great American Brass Festival, competed in the 2019 New Zealand National Brass Band Championships, and won first prize at the 2019 Gateway British Brass Band Festival. The band’s favorite activity, however, remains dazzling audiences in Chicago, one of the world’s premiere cities for brass musicianship. The band has particularly enjoyed performances with soloists drawn from the Chicago Symphony Orchestra’s celebrated brass section, including Chris Martin, Charlie Vernon, Gene Pokorny, John Hagstrom, and Mark Ridenour, and multiple collaborations with famed artist Rex Richardson. The Chicago Brass Band was selected to be a Chamber Group at the 2011 Midwest Band and Orchestra Clinic in Chicago, with guest soloist Jens Lindemann- rekindling the brass band movement at this annual convention. Additionally, the Chicago Brass Band has continued engaging young musicians with its Project Horizon initiative, a program developed to promote and enhance the performance and enjoyment of live music in public schools. Through collaborative concerts, workshops, and clinics, the band inspires students to continue to perform and enjoy live music at a high level into and throughout adulthood, even if they do not pursue music as their chosen profession.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/1/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/1/band_logo.jpg",
      "conductor_name": "Mark Taylor",
      "conductor_bio": "Mark A. Taylor is honored to serve as the new Music Director of the internationally award-winning Chicago Brass Band. Dr. Taylor is a conductor, educator, and performer in demand throughout the Great Lakes region. His new appointment follows nearly twenty years as a section percussionist with the band. No stranger to brass band leadership, Dr. Taylor is now entering his second decade as Music Director of the Milwaukee Festival Brass. He is also the Music Director of the Waukegan Band and serves as Band Director at College of DuPage. He received the Doctor of Musical Arts degree in 2016 from the University of North Texas, where his principal conducting teachers were Eugene Migliaro Corporon, Dennis Fisher, and Nicholas Enrico Williams. Dr. Taylor’s dissertation, 'British-Style Brass Bands in U.S. Colleges and Universities,' documented the existence of brass bands in American college music programs, past and present. Prior to his doctoral study, he served five years as Director of Bands and Coordinator of Ensembles at Loyola University Chicago, and taught on the music education faculty at the Chicago College of Performing Arts at Roosevelt University. He received the Master of Music degree from Northwestern University, where he studied conducting with John P. Paynter and Stephen G. Peterson and music education with Bennett Reimer and Peter Webster. He received his undergraduate degrees from the University of Notre Dame, where his first conducting teachers were Walter Ginter and Carl Stam. Dr. Taylor and his wife and son reside in Lake Forest, IL.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/1/conductor_photo.jpg",
      "contact_email": "vicepresident@chicagobrassband.org",
      "choice_pieces": [
        {
          "title": "A Gabrieli Fantasy",
          "composer": "Bert Appermont"
        }
      ],
      "band_section": "championship",
      "contest_draw_identifiers": ["C_G","C_DD"]
    },
    {
      "id": 2,
      "name": "The Illinois Brass Band",
      "website": "https://illinoisbrassband.org",
      "band_bio": "Dedicated to bringing British – style brass band music to audiences in Chicago and across the Midwest, George Foster and William Homer founded The Illinois Brass Band in February of 1991 with assistance from Boosey and Hawkes. The band is composed of thirty volunteer musicians and is the most senior of Illinois’ brass bands As a member of the North American Brass Band Association (NABBA), IBB attended its first competition in 1993. IBB won first place in NABBA’s Honors Division in 1994 and followed with an unprecedented string of six championships in seven years (1996- 2002) in the Championship Division. IBB also represented NABBA at the Great American Brass Band Festival in 1999 and was honored to attend the 2003 British Open Brass Band Championships – the first brass band outside the British Commonwealth to compete in this prestigious event. The band has released several recordings: 'A Christmas Fantasy; Championship Brass'; 'Shaken’ … not Stirred'; 'Live and Kickin'; 'Hark!' and most recently 'Cookin’ With Brass'. IBB has also showcased exceptional guest soloists, including internationally renowned euphonium virtuosi Robert and David Childs, cornet soloist Roger Webster, trombone soloist Brett Baker, euphonium soloist David Thornton, and tenor horn soloist Paul Bennett. IBB has astonished audiences with the power, virtuosity, and beauty of the British - style brass band and breadth of its repertoire. Through performances, recordings, and participation in competitions and festivals, IBB continues to bring the excitement of brass band music to general audiences and brass aficionados alike. The Illinois Brass Band is an IRS 501(c)(3) tax exempt and Illinois non-profit corporation and is supported in part by a grant from the Illinois Arts Council, a state agency. For more information on The Illinois Brass Band please visit http://www.illinoisbrassband.org",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/2/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/2/band_logo.jpg",
      "conductor_name": "Stephen Squires",
      "conductor_bio": "Stephen Squires is a musician with a career that blends his passions for conducting, teaching, and performing.  As a professional conductor, Mr. Squires has worked with many exceptional artists, including Frederica von Stade, Samuel Ramey, Janos Starker, Pinchas Zuckerman, Samuel Ashkenasi, John Browning, Leon Bates, Stewart Goodyear, Richard Stoltzman, Ani Kavafian, Wendy Warner, James Tocco and most of the principal players of the Chicago Symphony and Lyric Opera Orchestras. Fully committed to the music of living composers, he has conducted premieres of over 100 new works. Mr. Squires received his musical training at the Preparatory School of the Eastman School of Music, and earned his Bachelor of Music Education degree from the Crane School of Music, State University of New York at Potsdam.  He earned his Master of Music in Instrumental Conducting and Trumpet Performance at California State University, Northridge.  Further conducting studies were with Helmuth Rilling, Maurice Abravanel, Daniel Lewis, Tsung Yeh, and at the Aspen Music Festival.  Mr. Squires has conducted recordings for the Albany, Delos, Spring Hill (a division of EMI), MEDR, and Centaur labels.  Stephen Squires is Professor of Conducting in the Music Conservatory at the Chicago College of Performing Arts, Roosevelt University.  Prior to this appointment, he served on the faculties of Plymouth State College (New Hampshire), and the Northern Illinois University School of Music. This year Mr. Squires marks his sixteenth season as Music Director of The Illinois Brass Band. His other professional appointments include Music Director of the Fox Valley Orchestra (Aurora, IL), and Music Director of the Millar Brass Ensemble (Evanston). He is the former Music Director of the Illinois Chamber Symphony, the Mendelssohn Chamber Orchestra (Rockford, IL), and Resident Conductor of the Elgin Symphony Orchestra.  Mr. Squires has guest conducted the Chicago Symphony Orchestra, the Syracuse Symphony, the Green Bay Symphony, the Columbus (OH) Symphony, and the Chicago Composers Orchestra, as well as numerous educational festivals around the country. In addition to his conducting and teaching activities, he is an accomplished recital accompanist and freelance trumpeter",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/2/conductor_photo.png",
      "band_section": "first",
      "contact_email": "treasurer@illinoisbrassband.org",
      "choice_pieces": [
        {
          "title": "Music of the Spheres",
          "composer": "Philip Sparke"
        }
      ],
      "contest_draw_identifiers": ["1_D","1_AA"]
    },
    {
      "id": 3,
      "name": "The Motor City Academy Brass Band",
      "website": "http://www.mcbb.org/mcabb/index.html",
      "band_bio": "The Motor City Academy Brass Band, formerly Motor City Youth Brass Band, was established in 2006 as an educational outreach program of the Motor City Brass Band and welcomes dedicated musicians that wish to achieve a high level of musicianship through performing brass band literature. MCABB consists of high school, college and beyond college members that have a variety of musical backgrounds. The main focus of the band is to help members improve in all areas of brass and percussion performance and introduce them to the world of British-style Brass Banding. The band participated in the North American Brass Band Association Championships consistently from 2014-2018 and was awarded second place in the Youth division in 2017. Two soloists and an ensemble have also placed in the top three at NABBA. Guest clinicians have included Brett Baker, Philip Hannevik, Helen Harrelson, David King, John Madden, Christopher Ward, and Gordon Ward. This season, MCABB performed on the Motor City Brass Band Sounds of the Season concert and a combined concert also featuring Motor City Brass Band and Five Lakes Silver Band. The mission of the Motor City Academy Brass Band is to provide high quality instruction and performing opportunities for brass players and percussionists in Southeastern Michigan using the traditional British Brass Band instrumentation. MCABB uses talented artistic direction, visionary leadership, and community involvement to ensure a successful experience. Instructors include: Andrew Cicchelli, cornet, Zach Musienko, cornet, Jennifer Kmet, tenor horn, Scott Voytush, trombone, Iyla Miller, baritone and euphonium, Colin Holstein, tuba, and Patricia Fisher, percussion. Motor City Academy Brass Band is a family of musicians that are committed to lifelong learning and exceeding expectations.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/3/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/3/band_logo.jpg",
      "conductor_name": "Bona Opatich",
      "conductor_bio": "Bona Opatich became the conductor of the Motor City Academy Brass Band, formerly Motor City Youth Brass Band, in January, 2011. Miss Opatich received her Bachelor of Music Education from Michigan State University and her Master of Music degree from Bowling Green State University, where she conducted the tuba-euphonium ensemble and was a graduate assistant on full scholarship. During her 35 years of teaching public and private school musicians, she was the K-12 Director of Music in De Tour Village, in the Upper Peninsula of Michigan and following her masters degree, she became Director of Music at Wayne Trace High School in Paulding, OH. After returning to Michigan, she held various positions in the Waterford School District including the Director of Bands at Mott High School. Opatich currently has a private lesson studio, including students from the Crescendo Detroit program, and volunteer teaches for the Salvation Army. She is a member of two committees of Detroit Harmony, an initiative to give every student in Detroit an instrument. Throughout her career, Opatich has always been an active performer. She has performed throughout the United States, United Kingdom, Europe, China, and currently plays euphonium in Motor City Brass Band since 1997. She has been a member of the MCBB Board of Directors as Secretary, Treasurer, Artistic Committee Chair, and is currently the Education Outreach Chair and a Member at Large. She has studied euphonium with Steven Mead and conducting with David King and Christopher Ward.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/3/conductor_photo.jpg",
      "band_section": "third",
      "contact_email": "mcabbconductor@gmail.com",
      "choice_pieces": [
        {
          "title": "Viking Age",
          "composer": "Thierry Deleruyelle"
        }
      ],
      "contest_draw_identifiers": ["3_E"]
    },
    {
      "id": 4,
      "name": "The Five Lakes Silver Band",
      "website": "https://www.fivelakessilverband.com/",
      "band_bio": "The Five Lakes Silver Band is a nationally acclaimed British style Brass Band based in Rochester Hills, Michigan. The band was founded in 2006 and our name ‘Five Lakes Silver Band’ refers to the five great lakes surrounding Michigan. The band is comprised of music educators and freelance musicians as well as many nonprofessionals. They travel from all over Michigan and some from other states to be part of this group. As well as performing in a variety of venues (concert halls, cathedrals, amphitheaters, schools, libraries, parks), FLSB is also a contesting band that has regularly competed in the North American Brass Band Association Championships, Dublin Festival of Bands, the Hannaford Festival of Bands in Toronto Canada, and The US Open Brass Band Championship. The Five Lakes Silver Band won the Hannaford Cup in 2011 & 2012 and in 2013, the band captured its first national championship title, by winning the First Section at the North American Brass Band (NABBA) Championships. 2022 was quite the year for the band, as they were awarded the Droste Shield after winning the Dublin Festival of Brass. The band also placed second in the First Section at the NABBA Championships and were most recently crowned Grand Champion and Most Entertaining Band at the U.S. Open Brass Band Championships.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/4/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/4/band_logo.png",
      "conductor_name": "Christopher Ward",
      "conductor_bio": "Christopher Ward became the Musical Director of the Five Lakes Silver Band in July of 2019. He moved to Michigan from New York with his family in March of 2018 to become the Director of Music and Gospel Arts for the Eastern Michigan Division of the Salvation Army. As part of his responsibilities he is the conductor of the Eastern Michigan Divisional Band, and is the founder and conductor of the Eastern Michigan Divisional Choir. Christopher also serves on the North American Brass Band Association Board of Directors and is the chairman of the Great Lakes Brass Band Association. Prior to his appointment in Michigan, Christopher served as an Assistant Music Director for the Salvation Army in Greater New York for 16 years, and concurrently served as conductor for a number of groups, including the Greater New York Youth Band and the Hempstead Citadel Band. He was a member of the New York Staff Band for 23 years, 11 of those as its Eb Soprano Cornet Soloist. Christopher has performed or conducted in 22 different countries, and in venues such as Carnegie Hall, Lincoln Center, Brooklyn Tabernacle, Royal Festival Hall, The Royal Albert Hall and Buckingham Palace. He has had the privilege of performing with the New York Philharmonic, The Canadian Brass, The Kings Singers and Sir Elton John. Christopher received his formal music training at New York's Mannes College of Music and also The State University of New York - Purchase, where he received degrees in Fine Arts of Music & Trumpet Performance.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/4/conductor_photo.jpg",
      "band_section": "championship",
      "contact_email": "",
      "choice_pieces": [
        {
          "title": "On the Shoulders of Giants",
          "composer": "Peter Graham"
        }
      ],
      "contest_draw_identifiers": ["C_I","C_AA"]
    },
    {
      "id": 5,
      "name": "The Motor City Brass Band",
      "website": "http://www.mcbb.org/",
      "band_bio": "Motor City Brass Band (MCBB) was established in 1996 and performs in a variety of venues throughout the year in a wide range of musical styles from classical to jazz, pop to sacred. MCBB has performed throughout the state, the Midwest, and Ontario, Canada. MCBB was established in 1996 by John Aren, a Salvation Army officer and former member of the then National Champion Illinois Brass Band and has a long tradition of participation in brass band competitions. The Band annually participates in the North American Brass Band Association (NABBA) Championships and, in 2022, placed first in the Second Section. In 2005 MCBB participated in the US Open Brass Band Championship and won the award for Best Performance of a March as well as taking Second Place in the overall competition. In 2022 MCBB has also won its fourth consecutive Detroit Music Award as the Outstanding Classical Small Ensemble. MCBB continues to spread a love of the brass band sound and philosophy throughout the State of Michigan, and in 2010, inaugurated the Motor City Festival of Bands. This event has brought together some of the finest community and brass bands from across Michigan to perform separately, and as a massed band. Conducting the massed bands have been such notable figures as Leonard Slatkin, Music Director of the Detroit Symphony Orchestra, William Himes, noted composer and conductor, and Colonel Thomas Palmatier, retired commander of the US Army Band (Pershing’s Own).",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/5/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/5/band_logo.png",
      "conductor_name": "Gordon Ward",
      "conductor_bio": "Gordon Ward was born in Hull, Yorkshire, England and started learning the cornet at age 6. After attending the Royal Northern College of Music in Manchester he was employed as a brass teacher and conductor of the Hull Youth Concert Band. He also attended the University of Hull and gained a post graduate certificate in education. He was offered the position as Director of Music for the Salvation Army for New York in 1980 and emigrated to the USA. He became the conductor of the Greater New York Youth Band and oversaw the music programs in 30 centers as well as extensive summer camps and conservatories at the Star Lake Camp. Under his musical direction the GNY Youth Band undertook tours throughout the USA, Canada, Australia, Argentina, and Europe. In 2019 after leaving New York, he moved to Michigan residing in Northville and serves as President of the Five Lakes Silver Band and became a playing member of that band. He also joined the Royal Oak Salvation Army Band as principal cornet and the Eastern Michigan Divisional Band. After serving as Interim Conductor for MCBB, Gordon accepted the position of Music Director and Conductor of the band in June 2022.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/5/conductor_photo.JPG",
      "band_section": "second",
      "contact_email": "webmaster@mcbb.org",
      "choice_pieces": [
        {
          "title": "The Patriots",
          "composer": "Jan de Haan"
        }
      ],
      "contest_draw_identifiers": ["2_F","2_AA"]
    },
    {
      "id": 6,
      "name": "The Colorado Brass Band",
      "website": "https://coloradobrass.org",
      "band_bio": "Founded in January of 2018 by Dr. Michael McLean, the Colorado Brass is the premiere competing British-style brass band on the Front Range. The ensemble is comprised of thirty brass players and percussionists from all over Colorado. Members come to the band as professional musicians, music educators, and students pursuing advanced music degrees. Their 2022 - 2023 season includes five concert programs in addition to participation in the Rocky Mountain Brassworks Festival, the U.S. Masters Brass Band Championships, and the North American Brass Band Association Championships. Conducted by Dr. Brett M. Keating, the group performs a variety of compositions beyond test pieces, engaging audiences with British standards and toe-tapping favorites. The band has been privileged with premiering works by a number of composers and has big plans for the future, including the development of a youth brass band to work alongside members of the Colorado Brass.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/6/band_photo.jpeg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/6/band_logo.png",
      "conductor_name": "Brett Keating",
      "conductor_bio": "As a performer Brett Keating has appeared as a featured soloist with orchestra, brass bands, and wind bands in the US and Europe, including Switzerland, Italy, Germany, and the UK. His playing has been recognized at national and international competitions including: The Fischoff International & Plowman Chamber Music Competitions, Swiss National and North American Brass Band Championships. Brett has been brass banding for over fifteen years and has enjoyed the opportunity to compete in England, Switzerland, and the US while being a member of bands stateside and abroad. Most recently Brett has performed with the award-winning Fountain City Brass Band (Kansas City) and recorded with the Gramercy Brass Orchestra (New York City). Beyond performing as a soloist and with brass bands, Brett is an active chamber musician. nominal duo, an experimental project with tubist Tom Curry, merges brass performance with electro-acoustic practices through their original compositions, improvisations, adaptations, thievery, and loads of wires. nominal has performed throughout the US and in Canada, and was recently featured in the 2021 Virtual Tuba Euphonium Conference and the 2022 new music festival, Omaha Under the Radar. Their debut EP, s.i.p_1, was released in 2020. Currently Brett serves as Director of Bands & Brass at Western Colorado University. In this role he directs the Symphonic Band, Brass Ensemble, Jazz Ensemble, and the Athletic Band Program. He teaches applied brass lessons and courses in conducting and brass methods. Additionally, Brett is the Musical Director of the Colorado Brass Band (Gunnison, CO). Prior to his appointment at WCU, Brett was Director of Athletic Bands and professor of low brass at Carroll University. Prior to that, he served as Interim Instructor of euphonium and tuba and served on the Athletic Band Staff at the University of Kansas. Brett held simultaneous Graduate Teaching Assistantships with the wind conducting and the tuba/euphonium studios while earning his DMA in tuba/euphonium performance, an MM in wind band conducting, and a cognate in electro-acoustic composition at KU. Brett holds an MM in performance and interpretation of classical & contemporary music from the Hochschule Luzern-Musik, where he lived in beautiful Lucerne, Switzerland for three years. He earned an Artist’s Certificate in low brass performance, as well as a BA in performance from the University of Wisconsin.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/6/conductor_photo.jpeg",
      "band_section": "first",
      "contact_email": "mho@coloradobrass.org",
      "choice_pieces": [
        {
          "title": "The Devil and the Deep Blue Sea",
          "composer": "Derek Bourgeois"
        }
      ],
      "contest_draw_identifiers": ["1_A","1_CC"]
    },
    {
      "id": 7,
      "name": "The Princeton Brass Band",
      "website": "https://princetonbrassband.org/",
      "band_bio": "The Princeton Brass Band was founded in May 2004. It is now a major cultural presence in New Jersey and the USA, attracting top players from throughout the region. In 2008 the band brought the first trophy in NABBA history back to New Jersey. In 2013, the Princeton Brass Band became National Champions of North America (NABBA). The band has an extensive collection of performance videos on You Tube, many of those videos can also be found in the ‘Images and Video’ page on our site - just a few clicks over. The band has toured nationally and were Guest Artists at the Great American Brass Band Festival in Kentucky. The band motto ‘Resurgam’ means ‘I Shall Rise Again’.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/7/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/7/band_logo.png",
      "conductor_name": "Aaron VanderWeele",
      "conductor_bio": "Aaron VanderWeele currently serves on the faculty of Mason Gross School of the Arts at Rutgers University, the State University of New Jersey. He has been Principal Euphonium and Euphonium Soloist of the world-renowned New York Staff Band since 1993. In 2007, Mr. VanderWeele was awarded International Euphonium Player of the Year — only the third American to receive this prestigious recognition. He is a Buffet Crampon Artist and performs exclusively on the Besson Brass 2052 Prestige Euphonium. He has over twenty recordings to his credit — four of which are solo album recordings. He received his FTCL and LTCL Euphonium Performance Diplomas from Trinity College, London.  Mr. VanderWeele has been featured as a soloist and clinician at many Northeast Regional Tuba Euphonium Conferences and the U.S. Army Band’s Tuba Euphonium Workshop. He is an avid pedagogue and brass band exponent in the United States. In 2013, Mr. VanderWeele was Principal Euphonium in the Princeton Brass Band when the band won the Championship Section competition at the North American Brass Band Association Competition in Fort Wayne, Indiana. His single greatest memory as a brass band artist was accompanying famed rock star Elton John at Carnegie Hall with fellow members of the New York Staff Band. Aaron has two sons who are both brass band musicians.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/7/conductor_photo.png",
      "band_section": "first",
      "contact_email": "princetonbrassband@gmail.com",
      "choice_pieces": [
        {
          "title": "Variations on an Enigma",
          "composer": "Philip Sparke"
        }
      ],
      "contest_draw_identifiers": ["1_H","1_GG"]
    },
    {
      "id": 8,
      "name": "The Austin Brass Band",
      "website": "https://austinbrassband.com/",
      "band_bio": "",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/8/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/8/band_logo.jpg",
      "conductor_name": "John Caputo",
      "conductor_bio": "",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/8/conductor_photo.JPG",
      "band_section": "",
      "contact_email": "",
      "choice_pieces": [
        {
          "title": "",
          "composer": ""
        }
      ],
      "contest_draw_identifiers": ["",""],
      "inactive": true
    },
    {
      "id": 9,
      "name": "The Dallas Brass Band",
      "website": "https://www.dallasbrassband.org/",
      "band_bio": "Dallas Brass Band was founded in January 2017 as an outreach project of The Salvation Army, with the organization providing a rehearsal venue and the use of instruments and equipment. The band is based on the British brass band tradition and now consists of over 30 members. The current band is made up of players from a variety of different musical backgrounds, with many coming out of the Salvation Army banding tradition, as well as a number from institutions such as the University of North Texas, Texas Christian University and University of Texas at Arlington. During its short existence, the band has already hosted masterclasses with well-known personalities such as Prof. David Childs and Dr. Jonathan Corry and performed at some of Dallas’s most prestigious venues, including the Murchison Hall Performing Arts Center (University of North Texas), Ed Landreth Auditorium (Texas Christian University), Irving Arts Center and Nicholas Martin Hall (Texas Wesleyan University). It has also accompanied international soloists Owen Farr (International Tenor Horn Soloist), Thomas Hultén (Principal Trombone - Houston Grand Opera), Charlie Green (Britain’s Got Talent finalist) and Elmer Churampi (Trumpet - Dallas Symphony Orchestra). The band was named 1st Section Champions at NABBA in 2022. The band’s current leadership is Principal Conductor Grant Jameson. Its mission is to provide high quality music making to the Dallas Fort Worth Metroplex, and give brass players and percussionists the opportunity to experience a traditional British brass band setting.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/9/band_photo.JPG",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/9/band_logo.jpg",
      "conductor_name": "Grant Jameson",
      "conductor_bio": "Originally from Dublin, Ohio, Grant Jameson has spent extensive time both in the United States and the United Kingdom. He received his Bachelor of Music and Masters degrees from the Royal Welsh College of Music and Drama (RWCMD) in Cardiff (UK) where he studied with David Childs for six years. During his time in the UK, Grant immersed himself in the British brass band tradition and won many awards and prizes within this genre, including the Best soloist prize at the Welsh Open (2014). Grant has also performed as guest soloist with many of the UK's finest bands, including Cory - the world's No. 1 ranked band, Grimethorpe Colliery from the movie 'Brassed Off!', Brighouse and Rastrick and the current National Champions of Great Britain (2018), Foden's. Grant was also principal euphonium of Tredegar Town, Tongwynlais and Woodfalls bands, before joining the Flowers Band with whom he won various contests and featured as soloist, performing part of Sir Karl Jenkin's Euphonium Concerto, on the band's highly acclaimed CD release - Celebrate! - 5o years of Flowers. As a recording artist, Grant has released two solo albums: Genesis (2015) and Versatility Reimagined (2019). He's also been featured on TV and radio with broadcasts by the BBC and S4C, as well as NPR. In 2019 Grant appeared alongside fellow Besson Euphonium Artist, David Childs, performing duets at New York's Rainbow Lounge in a concert to honor Hollywood A-lister, Catherine Zeta-Jones CBE. On multiple occasions, Grant had the honor of performing as a soloist and chamber musician for HRH The Prince of Wales at his private residence in the UK. Currently a DMA candidate and Teaching Fellow at the University of North Texas, Grant is busy as both performer as Principal Euphonium with the Dallas Winds and Musical Director or the Dallas Brass Band.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/9/conductor_photo.JPG",
      "band_section": "championship",
      "contact_email": "dallasbrassband@gmail.com",
      "choice_pieces": [
        {
          "title": "Journey of the Lone Wolf",
          "composer": "Simon Dobson"
        }
      ],
      "contest_draw_identifiers": ["C_F","C_CC"]
    },
    {
      "id": 10,
      "name": "The Madison Brass Band",
      "website": "https://www.mbbweb.net/",
      "band_bio": "The Madison Brass Band, founded in 2002 is an all-volunteer 30-piece ensemble based in Madison Wisconsin. We perform in the British Brass Band style with traditional British Brass Band instrumentation.  We play a wide variety of styles of music in and around the Midwest. Bavarian immigrant George Scherer founded the original Madison Brass Band in 1863.  Its first members were businessmen, cobblers, cigar-makers, stonecutters, and a saloon proprietor. Only one member was a professional musician. George Scherer led the band from 1863 to 1878. The band went into remission in the 1890s, in 2002 it was reestablished in its current form. The band is currently directed by Andrew Malovance. The Madison Brass Band was incorporated in 2004 as a 501(c)3 non-profit organization with a mission to bring the great British and American brass band tradition back to the greater Madison area.  The band is active 12 months per year presenting concerts throughout the southern Wisconsin region.  Since 2012 The Madison Brass Band has competed in the North American Brass Band Association contest.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/10/band_photo.jpeg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/10/band_logo.jpg",
      "conductor_name": "Andy Malovance",
      "conductor_bio": "Andy Malovance entered the world of brass banding in 2005 when he played cornet with the international award winning Chicago Brass Band in his first North American Brass Band Championship. Currently assistant principal cornet of the CBB, Andy has performed and competed across the world. Highlights include performing as principal cornet at the World Music Contest in Kerkrade, Netherlands and the New Zealand Brass Band Championships, winning first prize in the NABBA high brass technical solo contest in 2008 and 2010, and being awarded, “Most Outstanding Brass Soloist” at the 2013 US Open Brass Band Championships. In addition to his work with the Chicago Brass Band, Andy is an active trumpeter/cornetist and active clinician in the Chicago area. His educational background includes a Bachelor of Music Education degree from DePaul University in Chicago, Illinois and a Masters in Music Education with emphasis in conducting at Colorado State University. His conducting teachers have included Rebecca Phillips, Wes Kenney, Rodney Dorsey, and James Kim. Andy is currently a band director at London Middle School in Wheeling, previous conductor for the McHenry County Youth Orchestra, and music director for the Madison Brass Band.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/10/conductor_photo.jpg",
      "band_section": "first",
      "contact_email": "1bbtubas@gmail.com",
      "choice_pieces": [
        {
          "title": "From San Marco Quarter",
          "composer": "Joop van Dijk"
        }
      ],
      "contest_draw_identifiers": ["1_C","1_BB"]
    },
    {
      "id": 11,
      "name": "The Crossroads Brass Band",
      "website": "https://www.crossroadsbrass.org/",
      "band_bio": "Crossroads Brass Band of Central Indiana is a non-profit, amateur, performing arts ensemble that aspires to the highest musical standards and is dedicated to the growth of the brass band movement in Central Indiana. The group was chartered in 2012. Although amateur in status, the band features many experienced musicians from around central Indiana. Donald Bookout, who was also the founder and music director of the organization, has served as past vice-president and a board member of NABBA.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/11/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/11/band_logo.png",
      "conductor_name": "Jon Noworyta",
      "conductor_bio": "Dr. Jon Noworyta is Assistant Professor of Music and Director of Bands, Instrumental Activities, and Outreach at the University of Indianapolis, where he administers all aspects of the instrumental area, conducts the Symphonic Wind Ensemble and Pep Band, and teaches courses in conducting and music education. A versatile conductor who is equally comfortable with orchestras as well as wind and brass groups, he is the Artistic Director of the Queen City Freedom Band of Cincinnati, Assistant Conductor of the Cincinnati Chamber Orchestra, and Director of the Crossroads Brassband of Franklin, Indiana; ensembles he works with in addition to his duties at UIndy. As a brass band conductor, Noworyta has led the Fillmore Philharmonic Brass (2017) and served as the Music Director of the Cincinnati Brass Band (2018 – 2020), leading both groups in award winning competitive seasons. These include top three placement of both groups in the Second Section at the North American Brass Band Association Championships in successive years. Noworyta currently serves on the NABBA committee for Equity and Inclusion.",
      "band_section": "third",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/11/conductor_photo.jpg",
      "contact_email": "admin@crossroadsbrass.org",
      "choice_pieces": [
        {
          "title": "Rise Again",
          "composer": "Trent Phillip Taylor"
        }
      ],
      "contest_draw_identifiers": ["3_G"]
    },
    {
      "id": 12,
      "name": "The Massanutten Brass Band",
      "website": "http://www.massanuttenbrassband.org/",
      "band_bio": "The Massanutten Brass Band, from Virginia’s beautiful Shenandoah Valley, was formed in September of 2001 and has developed a loyal and enthusiastic following of brass band enthusiasts. Now celebrating their 21st season, the ensemble is comprised of outstanding musicians from Northern Virginia, Charlottesville, and the Shenandoah Valley. The band’s personnel include school band directors, music professors, university music students, and serious amateur musicians. The ensemble performs throughout the central Shenandoah Valley region and has performed as the featured ensemble at the Virginia Music Educators Conference. The Massanutten Brass Band was awarded first prize in the 2nd Section (2007) and third prize in the 1st Section (2009, 2010) at the NABBA Championships. In the Spring of 2011, the band collaborated with the Shenandoah Valley Choral Society in presenting the U.S. premiere of the brass band version of Karl Jenkins' The Armed Man: A Mass for Peace.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/12/band_photo.jpg",
      "band_logo": "",
      "conductor_name": "Kevin Stees",
      "conductor_bio": "Kevin Stees, now in his 31st year as Professor of Tuba and Euphonium at James Madison University, leads an active career as a soloist, chamber musician, conductor, and music educator. He has studied with tuba artists Daniel Perantoni (Indiana University), Charles Daellenbach (Canadian Brass) and Jack Tilbury (U.S. Army Brass Quintet, ret.) and holds music degrees from University of Illinois and Arizona State University. He has been a finalist in several solo competitions and was a prize winner in the Second International Brass Congress Tuba Solo Competition. Stees has presented solo and chamber music performances at numerous universities, conferences, music festivals and workshops, including the U.S. Army Band Tuba-Euphonium Conference, Southeast Regional Tuba-Euphonium Conference, International Tuba-Euphonium Conference and the Keystone Brass Institute. He has performed with a number of orchestras including the Roanoke Symphony Orchestra, Phoenix Symphony, Canadian Chamber Orchestra and the Calgary Philharmonic, and was a member of the Southwest Brass Quintet and the Skyline Brass. He is very active as the conductor of the internationally recognized James Madison University Brass Band, having led the ensemble in performances at the John F. Kennedy Center for the Performing Arts in Washington, D.C. and the Brucknerhaus Concert Hall in Linz, Austria, as well as music venues throughout England, Wales and Austria. Stees is also the conductor of the award winning Massanutten Brass Band. Additionally, he is a member of the International Tuba Euphonium Association and a former member of the Board of Directors of the North American Brass Band Association.",
      "band_section": "second",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/12/conductor_photo.jpg",
      "contact_email": "massanuttenbrassband@gmail.com",
      "choice_pieces": [
        {
          "title": "Kingdom of Dragons",
          "composer": "Philip Harper"
        }
      ],
      "contest_draw_identifiers": ["2_C","2_EE"]
    },
    {
      "id": 13,
      "name": "The San Francisco Brass Band",
      "website": "http://www.sfband.org/",
      "band_bio": "Formed in 2019, the San Francisco Brass Band is the Bay Area's ONLY competitive British Style Brass Band! Representing all of Northern California, our members are composed of music teachers, professional players, students, business leaders and retirees.  We are thrilled with our solo and small ensemble results at our very first NABBA in Huntsville 2022 and look forward to building on this success!",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/13/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/13/band_logo.png",
      "conductor_name": "Craig McKenzie",
      "conductor_bio": "Craig McKenzie is the conductor of the San Francisco Brass Band, a newly formed competitive ensemble in the California Bay Area steeped in the British Brass Band tradition. He is also the Assistant Director of Bands / Director of Athletic Bands at San José State University. His responsibilities at SJSU include directing the Symphonic Band, Spartan Marching Band, and Spartan Basketball Band, teaching Music Education classes, and supervising student teachers. Dr. McKenzie received his D.M.A. from the University of Miami, Frost School of Music where he studied instrumental conducting with Robert M. Carnochan. He holds a Bachelor of Music Education from the University of Colorado at Boulder and a Master of Arts with an emphasis in instrumental conducting from San José State University. With twenty years of middle school, high school, and college teaching experience, Dr. McKenzie is also the 2019 Grand Champion of the International Conducting Competition hosted by the National Association of Brass Band Conductors in Eccles, England. He is a long-standing member of the California Music Educators Association, the California Band Directors Association, the National Association for Music Education, and the College Music Society. He enjoys returning to the San Bernardino mountains of California each summer to visit Arrowbear Music Camp where he has directed the Intermediate Session Band every year since 2002. He credits Arrowbear Music Camp with an influential portion of his musical education and attended as a camper in his childhood. Dr. McKenzie believes that music and the arts are an integral part of a well-rounded education and that training the next generation of music teachers is of paramount importance.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/13/conductor_photo.jpg",
      "band_section": "second",
      "contact_email": "admin@sfband.org",
      "choice_pieces": [
        {
          "title": "The Patriots",
          "composer": "Jan de Haan"
        }
      ],
      "contest_draw_identifiers": ["2_I","2_FF"]
    },
    {
      "id": 14,
      "name": "The Cincinnati Brass Band",
      "website": "https://www.cincinnatibrassband.com/",
      "band_bio": "The Cincinnati Brass Band (CBB) was founded in 1993 and organized by William Harvey of Buddy Rogers Music; Director, Anita Cocker Hunt; and Assistant Director, Drew Cremisio.  The CBB performs regularly throughout the greater-Cincinnati area bringing their signature sound in the British brass band tradition.  The Cincinnati Brass Band was proclaimed as the “Official Brass Band of Cincinnati” by the Mayor of Cincinnati in recognition for contributions to the musical culture of Cincinnati. Community Outreach has always been an important aspect of the band’s history, and it continues today. The band has collaborated with other members of the Cincinnati art community including: Xavier University’s Symphonic Winds Ensemble, Cincinnati’s Music Resource Center, the Cincinnati Conservatory of Music Prep Brass Choir, the Cincinnati School for the Creative and Performing Arts, along with several private and public schools throughout the greater Cincinnati area. The Cincinnati Brass Band is a member of the North American Brass Band Association (NABBA) which promotes the growth and development of brass bands in North America and sponsors an annual competition of the member bands. The Cincinnati Brass Band has entered their first NABBA competition in 1996 and currently competes in the Second Section.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/14/band_photo.png",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/14/band_logo.jpg",
      "conductor_name": "Benjamin A. Chamberlain",
      "conductor_bio": "Dr. Benjamin A. Chamberlain is proud to serve his third season as the Music Director of the Cincinnati Brass Band. In addition to his role with the CBB, Dr. Chamberlain serves as assistant professor of music and director of instrumental activities at Xavier University. He is Chair of the Music and Theater department, directs the Symphonic Wind Ensemble and teaches courses in conducting and music education. A champion of new music, he has been instrumental in commissioning and performing new works throughout his career. Dr. Chamberlain earned the bachelor of music degree in music education from the University of Minnesota, the master of music degree from Louisiana State University, and the doctor of musical arts from Northwestern University. Chamberlain has appeared as conductor and clinician throughout the United States. He previously served on the faculty of the National High School Music Institute and the Music Institute of Chicago. Chamberlain's professional affiliations include the College Band Directors National Association, Conductors Guild, the National Band Association, Phi Mu Alpha Sinfonia, and Pi Kappa Lambda National Music Honor Society.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/14/conductor_photo.jpg",
      "band_section": "second",
      "contact_email": "daniel.oehrle@ge.com",
      "choice_pieces": [
        {
          "title": "Fantasy For Brass Band",
          "composer": "Malcolm Arnold"
        }
      ],
      "contest_draw_identifiers": ["2_E","2_DD"]
    },
    {
      "id": 15,
      "name": "The Triangle Brass Band",
      "website": "https://www.cincinnatibrassband.com/",
      "band_bio": "The Triangle Brass Band was formed in 1986 as a joint venture of the A.J. Fletcher Foundation and Capitol Broadcasting Company of Raleigh, NC, and was known as the WRAL British Brass Band in its early years.  The band found immediate success in competition, winning either First or Second place at the North American Brass Band Association’s (NABBA) annual Championships in 1987, 88, 89, 90 and 92. TBB was the 3rd Section Champion at the 2018 and 2022 NABBA Championships, and runner-up in 2019. Using the traditional British brass band instrumentation of Cornets, Flugelhorn, Tenor Horns, Baritones, Euphoniums, Trombones, Tubas and Percussion, this all brass and percussion group is extremely versatile, performing music from virtually all genres, from classical transcriptions, to pop and jazz, movie and Broadway music, and, of course, original brass band literature. Members of the ensemble come from all walks of life, including lawyers, educators, IT professionals and retirees, to name a few. Continuing in the long-standing brass band tradition of amateur music making, players volunteer their time and talents to this unique type of band, and play just for the love of it. Weekly rehearsals, regular concerts and occasional competition appearances provide wonderful musical opportunities (and many challenges) for the group, resulting in a strong sense of camaraderie among the members. Education has always been a cornerstone of the Triangle Brass Band organization, as many music educators perform in the band. The first Triangle Youth Brass Band was founded In 1997, and the program has grown steadily to include three complete bands, which have also shown competitive success at the NABBA Championships. It is considered to be one of the premier youth brass band programs in the country. Music Directors of the band, since its inception, have included Dr. David Reed, of the University of North Carolina at Chapel Hill, Mr. Stan Tamplin, a native of Great Britain, Dr. Jack Stamp, of Campbell University and Indiana University of Pennsylvania, Dr. James Hile, of the University of North Carolina at Chapel Hill, and Dr. Michael Votta, of the University of North Carolina at Chapel Hill and the University of Maryland. The band’s current Artistic Director is Tony Granados. <br />",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/15/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/15/band_logo.png",
      "conductor_name": "Tony Granados",
      "conductor_bio": "Tony Granados serves as the Artistic Director and Conductor for the Triangle Brass Band, a position he has held since 2008. Tony is a freelance tuba player in the central North Carolina region and has appeared with the North Carolina Symphony, North Carolina Symphony Brass Quintet, Boylan Brass, Carolina Brass Quintet, Carolina Ballet, North Carolina Opera, and the Roanoke Symphony in Virginia. As a soloist, he has made appearances with college bands, high schools bands, all-county bands, and was a featured artist at the 2002 International Tuba Euphonium Conference, performing the Gregson Tuba Concerto with the Triangle Brass Band. Tony maintains a large and active private studio, teaching students on the middle school and high school levels. In addition, he gives clinics and teaches sectionals in many school band programs, including marching brass fundamentals with several leading band programs. Tony was the Triangle Youth Brass Band Director from 2001 – 2013, and is currently serving as the President of the North American Brass Band Association (NABBA).Tony attended the University of Kentucky, and has studied at the University of North Carolina at Greensboro and Towson State in Maryland. While a student in Kentucky, he was first runner up in the UK Concerto Competition in 1997, played solo E-flat tuba with the Lexington Brass Band and was featured with the Bass section of that band several times, including the LBB compact disc release Images. Tony also played with the Advocate-Messenger Brass Band in Danville, KY, appearing on three compact discs and making a solo appearance. Tony was also a driving force in the Four Horsemen Tuba Quartet, the resident student tuba quartet at the University of Kentucky. The FHTQ was the busiest performing ensemble at UK during this time, making an appearance at the 1998 Great American Brass Band Festival, and winning the Adult Ensemble competition at the 1998 NABBA competition.<br />",
      "band_section": "first",
      "contact_email": "director@trianglebrass.org",
      "choice_pieces": [
        {
          "title": "Chivalry",
          "composer": "Martin Ellerby"
        }
      ],
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/15/conductor_photo.jpg",
      "contest_draw_identifiers": ["1_F","1_EE"]
    },
    {
      "id": 16,
      "name": "Old Crown Brass Band",
      "website": "https://oldcrownbrassband.org/",
      "band_bio": "The Old Crown Brass Band was formed in 2007 and has become one of Fort Wayne's premier performing ensembles. The band is a traditional British Brass Band. Our 32 members are non-compensated. the band is made up of local music educators, members of the Fort Wayne Philharmonic and dedicated amateur's. Members are from Northeast Indiana and northwest Ohio. The band perms 8-10 concerts per year throughout the greater Fort Wayne area. The band has also formed a separate performing 10 piece ensemble known as the 'Black Swamp Ten'. The band has received numerous honors including first place in the Open Section of the 2014 and 2015 NABBA Championships. OCBB moved up to the third section for the 2016-19 NABBA Championships placing third three times and winning the title in 2019. The band competed in the third section in 2022 and will move to the second section in 2023. Old Crown Brass Band was a featured ensemble at the 2010 and 2018 Indiana Music Educator's Conference. Old Crown Brass band proudly served as host band for the North American Brass Band Association Championships at the Embassy Theatre in Fort Wayne. OCBB has welcomed guest soloist Rex Richardson, Adam Johnson , Tim Zimmerman and the Synergy Brass Quintet, In 2014  the band also enjoyed a side by side concert with the famous Stavanger band from Norway. We have also enjoyed several side by side concerts with Five Lakes Silver Band. The band has enjoyed having several conductors through the years. We are currently led by a team on two conductors who are also playing members of the band. T.J Faur (cornet) and Bryen Warfield( tuba) are serving as co-conductors of the Old Crown Brass Band. the band is a proud member of the North American Brass band Association",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/16/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/16/band_logo.png",
      "conductor_name": "Bryen Warfield",
      "conductor_bio": "Bryen Warfield is currently serving as a co-conductor of the Old Crown Brass Band. Bryen is Director of bands and Orchestra at Homestead HS in Fort Wayne, IN.  The award winning Homestead program supports the 300 student Spartan Alliance marching band, 3 concert bands,3 jazz bands,3 winter guards, Homestead Symphony Orchestra and Indoor Percussion and the Blue Show Choir Band.  Prior to his tenure at Homestead, Bryen was Assistant Director of Bands at Whiteland Community High School in Whiteland, IN. All ensembles under Bryen's direction have received gold medals honors and distinctions from contest at national and state wide events. The Homestead Wind Ensemble and Homestead Symphony Orchestra were named as Invited Ensembles at the 2023 Music for All National Concert Festival. In addition, the Homestead Symphony Orchestra was featured at the 2020 Indiana Music Educator's Conference. The Spartan Alliance is a two time Bands of America Grand Nationaal Finalist, 2022,2018 Finalistinalist, 2022, 2019 & 2017 Bands of America Toledo Regional & Class Champion, 2017 ISSMA Class A State Champion. Bryen received his Bachelors of Music in Tuba Performance from the University of Louisville where he studied with John Jones, Darryl Johnson, and Kimcherie Lloyd. Bryen received his Masters of Music in Wind Conducting from The Ohio State University where he studied with Dr. Russel Mikkelson and Dr. Scott A. Jones.  He served as a graduate conducting associate with the band department, taught courses in conducting, and was a Graduate Assistant Director with The Ohio State University Marching Band. Bryen has participated in conducting masterclasses, workshops, and festivals around the country with many esteemed conducting teachers such as Jerry Junkin, Jeffrey Grogan, Esa-Pekka Salonen, Hugh Wolff, Donald Thulean, Kevin Sedatole, Kevin Noe, John Lynch, and Robert Ambrose. Bryen was a performing member of the Bluecoats Drum and Bugle Corps for three seasons and later served as a brass educator for the Columbus Saints, Santa Clara Vanguard, and the Bluecoats.  Currently, Bryen is the Co-Brass Caption Head with the Sacramento Mandarins Drum and Bugle Corps.  Bryen is an active performer, adjudicator, clinician, and conductor throughout the United States. Bryen maintains affiliations with Phi Mu Alpha Sinfonia, Pi Kappa Lambda, Kappa Kappa Psi Band Fraternity, Conductor’s Guild, NAfME, IMEA, and ASTA.9, Bryen also serves on the Board of Directors for NABBA.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/16/conductor_photo.jpg",
      "band_section": "second",
      "contact_email": "oldcrownbrassband@gmail.com",
      "choice_pieces": [
        {
          "title": "The Patriots",
          "composer": "Jan de Haan"
        }
      ],
      "contest_draw_identifiers": ["2_D","2_BB"]
    },
    {
      "id": 17,
      "name": "Atlantic Brass Band",
      "website": "https://www.atlanticbrassband.org/",
      "band_bio": "Originally formed as the Wheaton Brass Band by Yorkshire-born Herb Roselle in 1984, the three-time National Champion Atlantic Brass Band, and 2017 US Open Champion, is one of the premier volunteer performing ensembles in the greater Philadelphia and Southern New Jersey area and are artists-in-residence at Rowan University in Glassboro, NJ.  Comprised of professional musicians, professors, educators, and community members, the band is committed to bringing the arts to the community through entertainment, educational collaborations, and fundraising efforts for local schools and charities.  Performances throughout the year at a variety of conferences, festivals, and concert venues with a repertoire spanning hymns, marches, orchestral transcriptions, pop music, and traditional brass band literature make this group a favorite throughout the region. The band has previously performed at the Cape May Victorian Week, the Great American Brass Band Festival, the Gettysburg Brass Band Festival, the International Trumpet Guild Conference, the National Trumpet Competition, and the 2017 NAfME Eastern Division Conference; and has performed internationally with a tour of Italy, two tours of England, an appearance at both the NATO JFC Brunssum and the World Brass Band Championship in Kerkrade, Netherlands, the Brass In Concert Championships in Gateshead, England, and the Scottish Open in Perth, Scottland. Recent initiatives to promote brass banding include the inception of the Mid-Atlantic Brass Band Festival(www.midatlanticbrassbandfestival.com) in 2012, an annual event including masterclasses, clinics, solo competitions, and band performances, as well as the collaborative effort with Rowan Prep to form the Rowan Prep Atlantic Youth Brass Band; an introductory brass band experience for area middle and high school musicians.  Read more about the band at http://www.atlanticbrassband.org, and make sure to get all the latest news by following them on Facebook(www.facebook.com/AtlanticBrassBand).",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/17/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/17/band_logo.png",
      "conductor_name": "",
      "conductor_bio": "",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/17/conductor_photo.jpg",
      "band_section": "championship",
      "contact_email": "info@atlanticbrassband.org",
      "choice_pieces": [
        {
          "title": "Saints Triumphant",
          "composer": "Philip Wilby"
        }
      ],
      "contest_draw_identifiers": ["C_B","C_EE"]
    },
    {
      "id": 18,
      "name": "Natural State Brass Band",
      "website": "https://www.nsbb.org/",
      "band_bio": "Established on July 1, 2003, the Natural State Brass Band has become one of the premier performing ensembles in Arkansas while bringing the sounds and styles of the traditional British Brass Band to new audiences statewide. The avocational musicians who comprise the membership of the band come from all walks of life, bonding together to share their mutual love of the brass and percussion medium they have embraced. The band has performed not only within the borders of the Natural State, but in several states and in 2010 the United Kingdom during a ten-day tour. They hold the distinction of being the last ensemble to play in the original Black Dyke rehearsal room. In their thirteen-year history the ensemble has garnered two North American Brass Band Association Championships and in 2010 became the first U.S. brass band to perform at the English National Championships. The group performs a wide variety of musical styles in many varied types of venues from the concert hall to the outdoor music festival stage, having been an opening act for Earth, Wind and Fire and playing for President Bill Clinton several times. The band performed under the leadership of founding member and Music Director Russell Morris from its inception until April 2016. In November 2016, Dr. Gretchen Renshaw was appointed Music Director and Nevada Mills became the band’s MD in January 2022. Throughout its history, the band has worked to abide by its mission statement, 'To provide an enjoyable musical experience for our audience, to promote the brass band idiom, and to enhance the musicianship of our members through the performance of quality literature'.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/18/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/18/band_logo.jpg",
      "conductor_name": "Nevada Mills",
      "conductor_bio": "The NSBB will be conducted at the 2023 NABBA Championships by Nevada Mills, who became the band’s Music Director in January 2022. Mills graduated from Henderson State University in 2006 with a Bachelor of Music degree in instrumental music education. He completed his master’s degree in Education at Arkansas State University in 2015. Mills has served as music coordinator for the Ouachita School District, Assistant Director of Bands, and marching band director at Ouachita Baptist University, and directed bands at Mena High School, Lakeside Junior High, and Watson Chapel Junior High. He joined Henderson State University as interim associate director of bands and coordinator of athletic bands for the 2021-2022 school year. He is presently the Director of Bands at Malvern High School in Malvern, Arkansas. Marching and concert bands under Mills’ direction have earned first division ratings and sweepstakes awards from the Arkansas School Band and Orchestra Association (ASBOA). He has designed marching drills for schools throughout Arkansas, including high schools and collegiate bands. Mills is a member of the ASBOA, Arkansas Choral Directors Association, Kappa Kappa Psi, and Phi Beta Mu.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/18/conductor_photo.jpg",
      "band_section": "second",
      "contact_email": "ricobelotti@comcast.net",
      "choice_pieces": [
        {
          "title": "Eternal Home",
          "composer": "Dean Jones"
        }
      ],
      "contest_draw_identifiers": ["2_H","2_GG"]
    },
    {
      "id": 19,
      "name": "James Madison University Brass Band",
      "website": "http://www.jmubrassband.org/",
      "band_bio": "Under the direction of Professor Kevin Stees, the JMU Brass Band is one of the most successful collegiate brass bands in the world today. Formed by Stees in the Fall of 2000, the band was named the North American Brass Band Association 1st Section Champion in 2004 and 2005 and was the 2006, 2007, 2010, 2016, 2019, and 2022  NABBA Championship Section Runner-up. The group maintains an active schedule, performing regularly throughout the academic year, and has been a featured ensemble at numerous festivals and conferences including the American Trombone Workshop; Virginia Music Educators Conference; Great American Brass Band Festival; U.S. Army Tuba Euphonium Workshop, and the Southeast Regional Tuba Euphonium Conference. In the summer of 2008, the ensemble embarked on a concert tour of England and Wales sharing the stage with many outstanding bands including the No. 1 ranked brass band, Cory Band. In 2009, the group became the first brass band to perform a full length concert at the John F. Kennedy Center for the Performing Arts in Washington, D.C. In 2012, the band traveled to Linz, Austria to perform as a featured ensemble at the International Tuba Euphonium Conference. Always interested in showcasing new repertoire, the band has given the North American premiere of over a dozen major works for brass band. The band performed as a featured ensemble at the 2017 Royal Northern College of Music Brass Band Festival in Manchester, England. This past summer, the band competed in the Concert Division of the 2022 World Music Contest in Kerkrade, The Netherlands. The JMU Brass Band is currently ranked in the top 100 brass bands worldwide.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/19/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/19/band_logo.jpg",
      "conductor_name": "Kevin stees",
      "conductor_bio": "Kevin Stees, now in his 38th year as Professor of Tuba and Euphonium at James Madison University, leads an active career as a soloist, chamber musician, conductor, and music educator. He has been a finalist in several solo competitions and was a prize winner in the Second International Brass Congress Tuba Solo Competition. Kevin has presented solo and chamber music performances at numerous universities, conferences, music festivals, and workshops throughout the United States. In addition to performances on tuba, he is very active as the conductor of the internationally recognized James Madison University Brass Band, having led the ensemble in performances at the John F. Kennedy Center for the Performing Arts in Washington, D.C., Brucknerhaus Concert Hall in Linz, Austria, Royal North College of Music in Manchester, England and the World Music Contest in Kerkrade, The Netherlands,  as well as music venues throughout England, Wales, and Austria. Kevin is also the conductor of the award winning Massanutten Brass Band.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/19/conductor_photo.jpg",
      "band_section": "championship",
      "contact_email": "steeskj@jmu.edu",
      "choice_pieces": [
        {
          "title": "Perihelion: Closer to the Sun",
          "composer": "Philip Sparke"
        }
      ],
      "contest_draw_identifiers": ["C_E","C_BB"]
    },
    {
      "id": 20,
      "name": "The Georgia Brass Band",
      "website": "http://www.georgiabrassband.com/",
      "band_bio": "Hailed as 'a major force in the North American brass banding world,' the Georgia Brass Band has been entertaining audiences since its founding in 1999. The band is made up of Atlanta-area professional and avid amateur musicians, all of whom volunteer their time and talents to the band and commit to a year-round schedule of rehearsals and performances. The Georgia Brass Band is proud to preserve and advance the rich tradition of the British-style brass band. The band seeks to entertain and educate its audiences, as well as inspire brass players of all ages and instill an appreciation for brass banding. The Georgia Brass Band has performed at concert halls, churches, and universities throughout the state of Georgia. The band has also hit the road and performed in Alabama, Tennessee, Kentucky, Indiana, North Carolina, Massachusetts, and Vermont. The band has been featured at numerous prestigious festivals and conferences including the International Euphonium Institute, the Trumpet Festival of the Southeast, the US Army Tuba/Euphonium Conference, the Southeast Regional Tuba/Euphonium Conference, the Atlanta Trumpet Festival, the International Trumpet Guild Conference, the International Trombone Festival, Kennesaw State University’s Brass Blast, the Deep South Brass Band Festival, the Great American Brass Band Festival, and the Georgia Music Educators Association Conference. The band has been the subject of feature articles in both the Atlanta Journal-Constitution and the Louisville Courier Journal, and several of the band’s live concert performances have been aired on WABE-FM’s Atlanta Music Scene. Over the years the Georgia Brass Band has been privileged to perform with many of the world’s leading brass soloists. Past band programs have featured Scott Hartman, Patrick Sheridan, David Zerkel, Thomas Ruedi, Jukka Myllys, Demondrae Thurman, Matthew van Emmerik, Vincent DiMartino, Thomas Hooten, Christopher Martin, David Childs, Richard Marshall, Colin Williams, Chris Gekker, Joe Gransden, Ingrid Jensen, Brett Baker, Allen Vizzutti, Charles Vernon, Mike Roylance, Rex Richardson, Jose Sibaja, Joanna Ross Hersey, Steven Mead, and Philip Smith. The Georgia Brass Band has earned a reputation for musical excellence through its successes at the annual North American Brass Band Championships. In 2022 the band earned 4<sup>th</sup> place, its highest placement in the Championship section.  The band’s dynamic performances have garnered favorable reviews in both national and international brass publications such as Brass Band Bridge, British Bandsman, The Brass Herald, and 4barsrest.com. The band has scored victories in two different divisions at the Championships and has established itself as one of the finest brass bands in the United States.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/20/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/20/band_logo.jpg",
      "conductor_name": "",
      "conductor_bio": "",
      "conductor_photo": "",
      "band_section": "championship",
      "contact_email": "donations@georgiabrassband.com",
      "choice_pieces": [
        {
          "title": "Dynasty",
          "composer": "Peter Graham"
        }
      ],
      "contest_draw_identifiers": ["C_A","C_FF"]
    },
    {
      "id": 21,
      "name": "The Dublin Metro Brass",
      "website": "https://dublinbands.com/dublin-metro-brass/",
      "band_bio": "The Dublin Metro Brass is the most recent addition to the Dublin Community Bands family. This ensemble was created to allow musicians the opportunity to experience the Brass Band world without the high intensity and full-year commitment of most competitive Bands. The abbreviated rehearsal season runs from January through June each year, with the goal of competing and performing at events like the Dublin Festival of Brass, the North American Brass Band Association Championships, and the Ohio Brass Arts Festival. Merging the 'community band' and 'competition band' experiences, Dublin Metro Brass is open to all interested musicians (no audition necessary).",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/21/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/21/band_logo.png",
      "conductor_name": "Keith M. Wilkinson",
      "conductor_bio": "Dr. Keith M. Wilkinson has been successfully directing brass bands for more than 50 years!  He commenced regularly conducting brass bands while he was a student at the University Of Manchester and following two enjoyable periods directing Salvation Army bands he entered the highly competitive British brass band contesting scene in the Fall of 1976.  In the following 20 years he enjoyed an enormous amount of success, including having the privilege of directing the first-placed band in more than 40 contests.  In several of these competitions upwards of 20 bands would have been performing.  The majority of these successes were with his own band, the GUS Band and later the William Davis Band, while some were as a guest conductor, primarily with Scotland's Newtongrange Band.  While living in England he was happy to accept invitations to conduct at various locations around Europe and for a period he was principal guest conductor of Switzerland's Brass Band Fribourg. Since moving, with his wife Audrey and  daughters Debbie and Katie, to USA in 1996 he has been delighted to receive a number of invitations to return to Britain to conduct and, following a recent appearance with Newtongrange Band, one commentator wrote 'a welcome return to the UK of a conductor of proven 24 carat class '.  (Iwan Fox, www.4barsrest.com). Keith's first home in USA was in northern Ohio and shortly after his arrival knowledge that he was living in the area led to the formation of Brass Band Of The Western Reserve, a band he led with distinction until the Summer of 2021.  In recognition of his 24 years with BBWR he is now their Music Director Emeritus. Keith continues to receive frequent invitations to use his talent and experience to direct brass bands.  In the Fall of 2021 he directed Central Ohio Brass Band as they progressed from the pandemic-enforced break in their regular activities and in September, 2022, he is leading a retreat in Canada for two of their finest bands - Orillia Silver Band and Weston Silver Band.  He directed Dublin Metro Brass in a couple of successful events in June, 2022, and looks forward to a number of future projects with them. While brass band competitions are less prominent in this country than in Britain he has continued his previous success by conducting the first-placed band on 5 occasions in different sections of the North American Brass Band Championships.  He is regularly in demand to adjudicate at the North American Championships where he is able to make use of his experience as a regularly-featured adjudicator around Britain and Europe. Alongside Keith's busy musical activities he has also been a successful university Professor of Mathematics, at the University of Nottingham in England and, more recently, at Capital University in Columbus, Ohio. Each of the bands he has directed has established an outstanding reputation for their concert presentations and these have been enhanced by the inclusion of some of Keith's brass band arrangements.  He has more than 120 published arrangements with publishers in Britain, Switzerland and USA.  Some of his arrangements have been used as test pieces at major championships.  In order to make his arrangements available more rapidly he has formed his own publishing company, Alum Creek Music (www.alumcreekmusic.com).",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/21/conductor_photo.jpg",
      "band_section": "third",
      "contact_email": "pherak@nabba.org",
      "choice_pieces": [
        {
          "title": "Saint-Saëns Variations",
          "composer": "Philip Sparke"
        }
      ],
      "contest_draw_identifiers": ["3_B"]
    },
    {
      "id": 22,
      "name": "The Oakland University Brass Band",
      "website": "https://www.facebook.com/OUBrassBand/",
      "band_bio": "The Oakland University Brass Band, formed in September 2009, enjoys the distinction of being one of the few collegiate brass bands in the United States. Oakland University is located in the  beautiful suburban city of Rochester, Michigan which is north of Detroit. The members of the band come from across the state of Michigan, as well as the United States and Canada. During the months of the pandemic, the band was named the University Section winners of the 2021 Kapitol Cory Online Brass Band Championships. In addition, they are the 2019 and 2018 Dublin Festival of Brass Champions (USA) where they consistently swept all three categories of Best March, Best Slow Melody and Best Major Work. In January of 2015 they accepted an invitation to travel to England to perform in the Butlin’s National Mineworkers Open Brass Band Festival and Competition. While there, the band was awarded 2nd place in their division and now holds the distinction of being the highest placing American band in the history of the competition. This invitation was extended as a result of having won the First Section of the North American Brass Band Association Championships in 2014 in Grand Rapids, Michigan. In June of 2015, the band performed at the Great American Brass Band Festival in Danville, Kentucky where they gave three featured concerts. The festival is known for being the largest brass band event of its kind in North America, with audiences in the tens of thousands in attendance each summer. The band is comprised primarily of undergraduate and graduate music majors. Graduates of the school’s brass and percussion programs have gone on to receive scholarships to attend the country’s leading graduate music programs, as well as perform in major professional ensembles.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/22/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/22/band_logo.png",
      "conductor_name": "Kenneth Kroesche",
      "conductor_bio": "Kenneth Kroesche is the Professor of Trombone, Euphonium and Tuba at Oakland University in Rochester, Michigan.  He holds a masters and doctorate of musical arts degree in performance from the University of Michigan, in addition to a Bachelor of Music Education degree from Texas State University. He has appeared as a euphonium soloist with a number of notable ensembles, ranging from the National Symphony Orchestra at the Kennedy Center for the Performing Arts to the U.S. Army Band at the West Point Military Academy. The Washington Post described him as an 'an expert on the instrument.' As an orchestral musician, he is the principal trombonist of the Oakland Symphony Orchestra and the Saginaw Bay Symphony Orchestra. He is a frequent guest musician with the area’s leading ensembles which include the Detroit Symphony, Grand Rapids Symphony, Flint Symphony and Detroit Chamber Winds. In addition, each summer he performs as euphoniumist with the Toledo Symphony Concert Band. In 2009, he formed the Oakland University Brass Band which since its inception has gone on to receive national and international recognition. From 2008-2011, he served as the conductor of the award winning Capital City Brass Band of Lansing, Michigan.",
      "conductor_photo": "",
      "band_section": "first",
      "contact_email": "kroesche@oakland.edu",
      "choice_pieces": [
        {
          "title": "Heroes",
          "composer": "Bruce Broughton"
        }
      ],
      "contest_draw_identifiers": ["1_B","1_FF"]
    },
    {
      "id": 23,
      "name": "The Jacksonville State University Brass Band",
      "website": "",
      "band_bio": "The Jacksonville State University Brass Band, formed in February of 2022, is excited to compete in the 2023 NABBA Championships! The Brass Band is an offshoot of the JSU Brass Choir, which has been in existence since the early 1950’s. JSU is located in northeast Alabama, nearly halfway between Atlanta and Georgia, with a total enrollment of approximately 9,500 students. The David L. Walters Department of Music has 38 faculty members and more than 200 undergraduate and graduate music majors and undergraduate music minors. Undergraduate and graduate music degrees are offered in general music, performance, and education.  ",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/23/band_photo.jpg",
      "band_logo": "",
      "conductor_name": "Casey Thomas",
      "conductor_bio": "Originally from Cedartown, Georgia, Dr. Casey Thomas is Assistant Professor of Trombone at Jacksonville State University. Dr. Thomas completed both his Masters and Doctor of Musical Arts degrees in trombone performance and pedagogy from The University of Iowa in Iowa City and his Bachelors degree in music education from Jacksonville State University. He is a low brass instructor with The Cadets Drum and Bugle Corps (www.cadets.org). He is also a member of Resonant Projection, a professional trombone quartet dedicated to promoting new and undiscovered works, and is a founding member of the Durward Ensemble (www.durwardmusic.com), which performs across the country and is a chamber ensemble that promotes the diversity of contemporary music to a broad audience through performances of rarely performed works and by commissioning new works by living composers. Dr. Thomas is the principal trombonist of the Gadsden (AL) Symphony Orchestra, bass trombonist with the Rome (GA) Symphony Orchestra and has performed with various ensembles throughout the U.S. and Canada. He is also the owner of Potenza Music (www.potenzamusic.com), a publishing house for new compositions and arrangements. Previous academic appointments were at Berry College, Georgia Highlands College, Georgia Northwestern Technical College, Ouachita Baptist University, Cornell College, and Saint Ambrose University. Casey married to Teresa Beary (a tubist) and together they have one cat, The Dude.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/23/conductor_photo.jpg",
      "band_section": "third",
      "contact_email": "cwthomas@jsu.edu",
      "choice_pieces": [
        {
          "title": "Images for Brass",
          "composer": "Stephen Bulla"
        }
      ],
      "contest_draw_identifiers": ["3_C"]
    },
    {
      "id": 24,
      "name": "The San Antonio Brass Band",
      "website": "https://www.sabrass.org/",
      "band_bio": "",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/24/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/24/band_logo.png",
      "conductor_name": "",
      "conductor_bio": "",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/23/conductor_photo.jpg",
      "band_section": "",
      "contact_email": "",
      "choice_pieces": [
        {
          "title": "",
          "composer": ""
        }
      ],
      "contest_draw_identifiers": ["",""],
      "inactive": true
    },
    {
      "id": 25,
      "name": "The Roman Festival Brass",
      "website": "https://www.romanfestivalbrass.org/",
      "band_bio": "Located in scenic northwest Georgia, Roman Festival Brass is a performing group of Roman Festival, Inc., a nonprofit 501(c)(3). The mission of Roman Festival, Inc. is the education and promotion of British and American brass music.  Roman Festival Brass has a very diverse membership. From physicians to educators, retired to graduating seniors, the group brings together volunteer brass and percussion musicians from 3 states with a common goal to promote this unique genre of music.  Our wealth of excellent music educators fosters this mission in an unparalleled fashion. Roman Festival Brass plays numerous concerts throughout the year including seasonal Christmas and 4th of July concerts as well as thematic concerts.  One of the cornerstone concerts of the Roman Festival Brass is the God and Country concert series celebrating the freedoms of our Country through patriotic music.  This year, Roman Festival Brass embarks on it’s 23rd annual God and County concert series.  Roman Festival Brass has also performed on the national stage at The Great American Brass Band Festival and competed in the North American Brass Band Association festival.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/25/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/25/band_logo.jpg",
      "conductor_name": "Don Robinson",
      "conductor_bio": "Don Robinson is a lifelong musician and educator.  Don was a charter member of Roman Festival brass and has served as Musical Director since 2009.  As a member of Roman Festival Brass, Don competed at NABBA and performed at the Great American Brass Band Festival.  Don is Minister of Music for the First Methodist Church of Cedartown, and is an occasional player with the Rome Symphony, Georgia Philharmonic, 8th Regiment Band of Georgia, NorthWest Georgia Winds and various ensembles in the area. Don is a graduate of Dalton High School and Jacksonville State University where he was a member of the Marching Catamount band and the Marching Southerners.  While at Jacksonville State, he participated in numerous ensembles including A Capella Choir, Brass Choir and Jazz Band.  He was Band Director for Oxford Middle School and High School Band Director at Southside High School in Gadsden AL and Cedartown High School.  Don was also a charter member of Spirit of Atlanta and continued as a member of the marching staff throughout the 1980's.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/25/conductor_photo.jpg",
      "band_section": "third",
      "contact_email": "donr@romanfestivalbrass.org",
      "choice_pieces": [
        {
          "title": "Dimensions",
          "composer": "Peter Graham"
        }
      ],
      "contest_draw_identifiers": ["3_A"]
    },
    {
      "id": 26,
      "name": "Arkansas Musicworks Brass Band",
      "website": "https://www.arkansasmusicworks.com/",
      "band_bio": "Arkansas Musicworks Brass Band, founded in 2017, is an entirely volunteer brass band based in the Northwest Arkansas area. Performing a wide variety of music including opera, jazz, Broadway and modern compositions written especially for British style brass band, Arkansas Musicworks Brass Band seeks to create world class performances featuring regional musicians, fostering a culture of professional excellence in the amateur music-making community. The band takes pride in offering a high quality outlet for musicians, composers, and conductors seeking to push their artistry to new heights in a friendly and constructive environment.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/26/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/26/band_logo.jpg",
      "conductor_name": "Brandon R. Hults",
      "conductor_bio": "First Lieutenant Brandon R. Hults, a native of Morehead City, North Carolina, is a flight officer for The United States Air Force Band. He is responsible to the Band commander for oversight of equipping and training a 184-member unit to accomplish more than 1600 missions annually. Previously, Lt. Hults held the position of flight commander and associate conductor of the United States Air Force Band of Mid-America, Scott Air Force Base, Illinois. Lt. Hults graduated Magna Cum Laude with a Bachelor of Music Education degree with an emphasis in piano and trombone from East Carolina University in 2008. After his undergraduate studies, Lt. Hults served as the director of bands for New Bern High School, New Bern, NC. In 2011 he was offered a graduate assistantship to the University of Arkansas where he completed a Master of Music degree in wind conducting and piano performance. For the next four years, Lt. Hults served as the associate director of bands for Bentonville High School in Bentonville, AR, and began his doctoral coursework in wind conducting at Michigan State University under the guidance of Dr. Kevin Sedatole. He is currently writing his dissertation.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/26/conductor_photo.jpg",
      "band_section": "first",
      "contact_email": "brassband@arkansasmusicworks.com",
      "choice_pieces": [
        {
          "title": "Coventry Variations",
          "composer": "Bramwell Tovey"
        }
      ],
      "contest_draw_identifiers": ["1_G","1_DD"]
    },
    {
      "id": 27,
      "name": "Fountain City Brass Band",
      "website": "https://www.fcbb.net/",
      "band_bio": "The Fountain City Brass Band, a 501(c)(3) nonprofit organization, is a thirty-piece, all-volunteer ensemble and is committed to cultural enrichment by performing eclectic concerts that expand the brass band art form and are both entertaining and educational for audiences. Fountain City seeks to bridge the gap between popular and classical art music by performing a wide variety of music, including modern compositions written specifically for brass bands and arrangements of classical works, jazz, and Broadway hits. Fountain City has been featured performers throughout North America and Europe at such events as the Midwest Clinic, Brass in Concert, Great American Brass Band Festival, U.S. Masters Brass Entertainment Championships, Glenn Miller Festival, International Trombone Festival, International Tuba & Euphonium Conference, Longs Peak Scottish Irish Highlands Festival, Missouri Music Educators Association Conference, Kansas Music Educators Association Conference, Missouri Bandmasters Association, Ohio Brass Arts Festival, Nebraska Bandmasters Association, Celebration at the Station, and the Scottish Festival of Brass. The band has collaborated with artists such as Garry Cutt, David King, Ryan Anthony, Joe Burgstaller, Jens Lindemann, Rex Richardson, Jose Sibaja, Jonathan Bates, Owen Farr, Marty Hackleman, Helen Tyler, Brett Baker, Tony Baker, Michael Dease, Brian Hecht, Wycliffe Gordon, Yu Tamaki Hoso, Christian Lindberg, David Childs, Matthew van Emmerik, Tormod Flaten, Steven Mead, Øystein Baadsvik, Patricio Cosentino, James Gourlay, Les Neish, Steve Rosse, and Patrick Sheridan. When not performing in concert, Fountain City maintains an active competition schedule. Since the band’s first competition in 2004, it has won 10 U.S. Open Brass Band Championships, 9 North American Brass Band Championships, and 1 Scottish Open Brass Band Championship, becoming the first U.S. band ever and the first non‐UK band in over 50 years, to win a major brass band competition on UK soil.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/27/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/27/band_logo.png",
      "conductor_name": "Michael Fowles",
      "conductor_bio": "Widely regarded as one of the leading conductors of his generation Michael hails from the rich musical tradition of North Staffordshire. He is an honours and post-graduate of the Royal Northern College of Music. He has been Musical Director of Foden’s Band since 2009 and the Professional Conductor of the Desford Colliery Band since 2016. Having worked with many of the country’s leading bands, Michael has a reputation for entertaining concert programming and high standards in competition. He is well known for having transferable skills, having won Championship section contests with 11 different bands in regular working relationships or on a freelance basis. As such, he is much in demand both in the UK and abroad. Michael is also a member of the Association of Brass Band Adjudicators and has officiated at numerous contests. Educational work also forms an important part of Michael’s musical life. He is the Course Director of the Wessex Band Summer School and Fodens Armagh Summer School. He is the Musical Director of Fodens Youth Band, Associate Conductor, and Musical Adviser of Lions Youth Band. As a guest conductor, he undertakes much training work throughout the UK with bands of all levels. Michael’s work in the recording studio is also highly respected, directing around 45 CDs, including numerous solo discs. He has given many premiere performances, conducted concerto appearances of eminent soloists, and directed broadcasts for both BBC Radio 2 and 3. He has also written articles and reviews for Brass Band World and British Bandsman.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/27/conductor_photo.jpg",
      "band_section": "championship",
      "contact_email": "fcbb@fcbb.net",
      "choice_pieces": [
        {
          "title": "Journey of the Lone Wolf",
          "composer": "Simon Dobson"
        }
      ],
      "contest_draw_identifiers": ["C_D","C_GG"]
    },
    {
      "id": 28,
      "name": "Fountain City Youth Academy Brass Band",
      "website": "https://fcyba.net/",
      "band_bio": "The Fountain City Youth Brass Academy (FCYBA) is the educational outreach component of the Fountain City Brass Band (FCBB), North America’s premiere volunteer brass and percussion ensemble. The mission of the FCYBA is to inspire young musicians of all performance ability levels to achieve a high standard of musicianship and to foster a life-long love of music. FCYBA was founded in 2008 by Helen Harrelson while she was on a sabbatical from her job in England. Helen is a native of England and grew up in the brass band tradition before attending the Royal Northern College of Music. From there, she became one of the world’s foremost baritonists and performed with some of the finest bands in the United Kingdom. Her passion for music education and this rich tradition led her to establish the FCYBA. The FCYBA began as day-long ‘Expo’ workshops and has grown into season-long brass bands with over 150 members. There are four bands within the Academy made up of brass and percussionists of all standards and abilities from late elementary through young adult. The bands of the FCYBA are non-cut programs for participants 18 years of age and younger. The conductors for the FCYBA bands are professional music educators that also perform with the Fountain City Brass Band. The bands meet during the spring academic semester once per week on Sundays. Since its inception, the bands of the FCYBA have won numerous national championships at the North Ameri- can Brass Band Championships and been featured at prestigious events such as the Great American Brass Band Festival and the Kansas Music Educators Association’s annual conference.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/28/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/28/band_logo.png",
      "conductor_name": "Helen Harrelson, Lee Harrelson",
      "conductor_bio": "The Academy has two conductors: Dr. Helen Harrelson began her playing career on euphonium playing with the Rotherham Schools Band and the National Youth Brass Band of Great Britain. She later changed to baritone and was accepted at the Royal Northern College of Music in Manchester, where she gained her BMus (Hons). During her studies at the RNCM, Helen worked and performed with world class musicians such as Bob Childs, James Watson, Sandy Smith, Steven Mead, James Gourley, and Bramwell Tovey. During her time in the U.K., she was a member of some of the worlds’ finest brass bands. Helen had the honor of being one of the first female members in the Black Dyke Band, with whom she toured and recorded many CDs, radio broadcasts and television appearances. As a leading advocate for brass pedagogy and performance, she has presented and  performed at events including the Midwest Clinic, International Woman’s Brass Conference,  International Tuba & Euphonium Conference, and International Trumpet Guild. Helen has served on the faculties of the Northern Ireland Summer School, North American Brass Band Summer School, MidAmerica Nazarene University, Missouri Western State University, and as a Student Teacher Mentor for the Royal Northern College of Music. She has been recognized for outstanding contribution to music education from the Kansas Bandmasters Association, and was awarded the ECKMEA High School Band Director of the Year in 2021. Helen is a Besson/Buffet Crampon performing artist, consultant, and clinician. Lee Harrelson is a Professor of Music at Missouri Western State University. At Missouri Western, he serves as the Director of Instrumental Studies and Bands and conducts the Missouri Western Symphonic Winds. For the 2022-2023 academic year, Dr. Harrelson is a Visiting Professor of Euphonium & Tuba at the UMKC Conservatory. Dr. Harrelson attended the University of Southern Mississippi, where he studied music education and performance before completing his masters and doctorate at the University of Missouri-Kansas City’s Conservatory of Music and Dance. Dr. Harrelson is the founder of the Fountain City Brass Band and currently serves as its artistic director, executive director, and principal euphoniumist. Dedicated to furthering the development of brass bands in America, Dr. Harrelson regularly serves on the faculty of the North American Brass Band Summer School and, in 2019, along with his wife Helen, founded the National Youth Brass Band of America. In 2022 Dr. Harrelson founded the US Masters Brass Band Entertainment Championships. In the fall of 2019, Dr. Harrelson was awarded the first-ever Visiting International Professor position with the world-famous Brighouse & Rastrick Band (England). In addition to collaborating with and conducting the band, Dr. Harrelson was able to work closely with Professor David King during preparations for the band’s appearances at the British Open Brass Band Championships (Symphony Hall, Birmingham) and the National Brass Band Championships of Great Britain (Royal Albert Hall, London). Lee Harrelson is a Buffet Group/Besson Performing Artist.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/28/conductor_photo.jpg",
      "band_section": "third",
      "contact_email": "helen@fcbb.net",
      "choice_pieces": [
        {
          "title": "The Dark Side of the Moon",
          "composer": "Paul Lovatt-Cooper"
        }
      ],
      "contest_draw_identifiers": ["3_F"]
    },
    {
      "id": 29,
      "name": "Brass Band of Northern Virginia",
      "website": "https://brassbandofnorthernvirginia.com/",
      "band_bio": "The Brass Band of Northern Virginia was founded in November 2019 by a group of friends who shared a passion for British-style brass band music and a desire to grow an active and sustainable organization. The mission of the band is to share high-quality performances consisting of both the established brass band repertoire as well as new and innovative programming for the enjoyment and education of the community as well as to participate in the rich brass band contesting tradition. The Brass Band of Northern Virginia is a community of musicians drawn from a range of professional and avocational backgrounds in the Virginia, Washington DC, and Maryland metropolitan areas. Inspired by the famous brass bands of the UK and Europe, the band is led by world-renowned Euphonium soloist Dr. Brian Bowman. In its first three years, the Brass Band of Northern Virginia has organized community outreach concerts, masterclasses for student brass players, chamber music performances, and published recordings. In 2020, the Brass Band of Northern Virginia placed in the Cory Band's International virtual Brass Band contest with its program, 'The Artist's Way.'  The band also won the caption award for most entertaining video in its class. This year, the Brass Band of Northern Virginia has an active schedule of 10 programs in the Washington DC metropolitan and Northern Virginia area.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/29/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/29/band_logo.png",
      "conductor_name": "Brian Bowman",
      "conductor_bio": "Dr. Brian Bowman is a renowned euphonium soloist and has over twenty years of experience conducting British Brass Bands. He has served as a professor at nine universities, was the first euphonium player to be elected president of the International Tuba Euphonium Association, and has been a product consultant with Wilson, Getzen, and DEG. Dr. Bowman has received numerous accolades, including the Clifford Bevan Award for Meritorious Work in Low Brass Scholarship from the International Tuba Euphonium Conference in 2010 and the Edwin Franko Goldman Memorial Citation from the American Bandmaster Association in 2016, which is given to those who have rendered outstanding service to bands and band music in America. Upon his retirement in 2018, the Dr. Brian Bowman Euphonium Endowed Scholarship was established at the University of North Texas. Dr. Bowman brings this expertise and experience to his leadership of the Brass Band of Northern Virginia.",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/29/conductor_photo.jpg",
      "band_section": "championship",
      "contact_email": "barry@bocaner.net",
      "choice_pieces": [
        {
          "title": "Earthrise",
          "composer": "Nigel Clarke"
        }
      ],
      "contest_draw_identifiers": ["C_C","C_HH"]
    },
    {
      "id": 30,
      "name": "Brass Band of Central Florida",
      "website": "https://www.bbcfband.com/",
      "band_bio": "Under the music direction of Gareth Pritchard, the BBCF features Central Florida’s finest brass and percussion musicians, performing in the British Brass Band style with traditional British Brass Band instrumentation. BBCF has an active performance schedule of concerts, outreach programs and competitions throughout the United States and the United Kingdom. The Brass Band of Central Florida is very fortunate to perform two separate programs each year at St. Luke’s Lutheran Church as part of the prestigious St. Luke’s Concert series, which also features other groups such as the Orlando Philharmonic Orchestra, UCF Symphony Orchestra and Orlando Concert Band. The Band has also performed regularly at the Winter Park Arts Festival and the Celebration Foundation Concert Series. Many students from Orange, Seminole and Volusia Counties, plus UCF and Stetson Universities have benefitted from the Band’s outreach programs and are now full-time members of the Band. BBCF has competed regularly in the Championship Section of the North American Brass Band Championships (NABBA) and the US Open, winning NABBA in 2005 and the US Open on 4 occasions. They have also appeared once at the British Open Brass Band Championships and three times at the Brass in Concert Championship, gaining 2nd Prize in 2011. <br /><br />The Brass Band of Central Florida is an IRS 501 c (3) tax-exempt and a Florida non-profit corporation. The organization’s mission is to promote the traditional British Brass Band style and sound while helping to preserve and foster its long and colourful history and its music.",
      "band_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/30/band_photo.jpg",
      "band_logo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/30/band_logo.jpg",
      "conductor_name": "Gareth Pritchard",
      "conductor_bio": "Originally from South Wales in the UK, Gareth moved to the Orlando area in 2015. He immediately became Musical Advisor to the Brass Band of Central Florida (BBCF) and Musical Director of the Youth Brass Band of Central Florida (YBBCF). By the summer of 2016, he was delighted to accept the vacant position of Music Director for the BBCF. Having studied Composition, Conducting, Music History and Performance at Trinity College of Music London, Gareth graduated with both an FTCL (Master’s Degree) and an LTCL (Bachelor’s Degree) in the same year, a feat not matched by anyone even to this day. He brings with him a wealth of experience in wide ranging styles from Big Band & Jazz to Classical Orchestral, Wind Band & Brass Band music that spans almost 50 years at the very highest level. Gareth has been involved with many first-class Symphony Orchestras, Wind Bands and Brass Bands, both as an amateur and professional player/conductor, winning many National Awards & Brass Band Competitions in the UK & Scandinavia. Gareth has been awarded the title ‘Champion Soloist of Great Britain’ on two separate occasions. He is also a member of the elite Association of Brass Band Adjudicators in the UK and has adjudicated at many major Festivals & Contests all over Western Europe. His arrangements & compositions are played all over the world, and you can hear some of his most recent arrangements on BBCF's latest CDs, 'Music from the Silver Screen' and ' 'Twas the Night Before Christmas'.",
      "band_section": "championship",
      "conductor_photo": "https://nabba-mobile-app.sfo3.cdn.digitaloceanspaces.com/band_media/30/conductor_photo.jpg",
      "contact_email": "bbcfpresident@gmail.com",
      "choice_pieces": [
        {
          "title": "Fraternity",
          "composer": "Thierry Deleruyelle"
        }
      ],
      "contest_draw_identifiers": ["C_H","C_II"]
    },
    {
      "id": 31,
      "name": "Diamond Brass Band",
      "website": "",
      "band_bio": "The Diamond Brass Band, founded in the fall of 2014, is a British-Style brass band based out of Jonesboro, Arkansas. The musical director is Dr. Sarah Labovitz, Associate Director of Bands at Arkansas State University. The artistic director is Dr. Charles Page. The ensemble members are comprised of A-State music faculty and students, public school teachers, and area freelance musicians. The band derives its name from the fact that Arkansas is home to the only active diamond mine in the country.",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "Sarah Labovitz",
      "conductor_bio": "Sarah Labovitz is currently the Chairmen, Associate Director of Bands, and Coordinator of Music Education at Arkansas State University. She directs the Symphonic Winds, teaches undergraduate and graduate music education and conducting, and supervises student interns. Prior to her appointment at A-State, Dr. Labovitz served as the Assistant Director of Bands/Director of Athletic Bands at Washburn University. She earned a BME from Bowling Green State University, an MME from Indiana University, and a DMA in Wind Conducting from the University of Kansas where she studied with Dr. Paul Popiel. Dr. Labovitz is an active guest conductor having had the pleasure of working with numerous ensembles throughout the United States and abroad. At home, on top of her work with the A-State Symphonic Winds, guest conducting the A-State Wind Ensemble, and visiting band rooms across the Mid-South, she serves as the music director for the Diamond Brass Band. In addition to guest conducting, Dr. Labovitz is a sought-after clinician who has given multiple presentations at the National Association for Music Education’s National In-Service Conference, the College Band Director National Association’s (CBDNA) National and Regional Conferences, and The Midwest Clinic, an International Band and Orchestra Conference. Building bridges between instrumental music education at the collegiate and secondary level is a lifelong pursuit of Dr. Labovitz.  She is a contributing author to the Teaching Music Through Performance in Band series and currently serves as a Music Education Consultant for the NAMM sponsored Music Achievement Council, a member of CBDNA’s Music Education Committee, and a member of the National Band Association’s Merrill Jones Memorial Young Band Composition Contest Committee. At the 2021 Arkansas Bandmasters Association Conference, she was named a member of the Arkansas Bandmasters Association Executive Committee. Past service to the profession includes time as the Collegiate Chair for the Arkansas Music Educators Association and President of the Arkansas Chapter of CBDNA.  She was recognized for her service to the profession, community, and her university as the 2021 recipient of A-State’s Faculty Achievement Professional Service Award. Dr. Labovitz has served as a production assistant on the NAXOS recordings “Landscapes” and “In the Shadow of No Towers,” Michael Torke’s album ”Concerto for Orchestra,”  and the Klavier recording “Of Shadow and Light.” She is in demand as a marching band adjudicator and drill writer and prior to her current position at A-State she served as Arkansas State’s Director of Athletic Bands for five years, leading the Howlers Pep Bands and the Sound of the Natural State Marching Band. She stays active on her primary instrument, the clarinet, by performing with the newly created Jonesboro Community Wind Ensemble and subbing with the Delta Symphony Orchestra, a regional symphony based out of Jonesboro, AR.<br /><br />Her public-school experience includes serving as Director of Bands at Athens High School in Athens, OH and Director of Instrumental Music at Admiral King High School in Lorain, OH. She currently resides in Jonesboro with her husband, Dr. Charles Page, the Director of Bands for the Valley View School District and her two rescue labs, Rosie and Sadie.",
      "conductor_photo": "",
      "band_section": "first",
      "contact_email": "charleswpage@gmail.com",
      "choice_pieces": [
        {
          "title": "Spectrum",
          "composer": "Gilbert Vinter"
        }
      ],
      "contest_draw_identifiers": ["1_I","1_II"]
    },
    {
      "id": 32,
      "name": "Dublin Silver Brass Band",
      "website": "www.dublinsilverband.com",
      "band_bio": "Originally founded in 2008 as the Ohio Brass Band by Dr. Paul Droste and Dr. Patrick Herak, The Dublin Silver Band is made up of brass and percussion musicians from all parts of Ohio.  Since 2010 DSB has existed as part of the Dublin Community Bands, the sponsoring organization of today’s event. Since 2010 the band has transformed from a seasonal band to full time operation.  Also during that time DSB has steadily progressed from its first Second Section participation in North American Brass Band Association Championships in 2014 to placing first in the Second Section in 2015, then moving up to the First Section in 2016, and placing first in the First Section in 2019. The band has also competed regularly in the US Open Championships, winning that event in 2015. The members of the Dublin Silver Band volunteer their time and talent because of three things they all have in common: a drive to chase perfection, a genuine affection for each other, and a passion for making connections with audiences on an emotional level.  To make these connections, the band commits to performing far more than ordinary concerts, instead telling stories that engage the audience in the musical performance.  It is this approach that has earned the band an international reputation. DSB has performed and competed extensively throughout the Midwest, and has traveled and performed abroad.  In 2016 the band played concerts in Ireland and England before competing in Brass in Concert in Gateshead, England.  In 2020 the band once again traveled to England, competing at the Butlins Festival.",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "Tim Jameson",
      "conductor_bio": "Tim Jameson has served as Music Director of the Dublin Silver Band since 2010.  During that time, he has led the band to first place finishes in both the NABBA Second and First Sections. Before his involvement with the Dublin Silver Band, Tim was the Music Director of the Brass Band of Columbus for five years, leading BBC to a first place finish in the NABBA Championship Section in 2006. Mr. Jameson is a graduate of The Ohio State University, where he studied trumpet under Tom Battenberg and conducting under Donald McGinnis, Marshall Haddock, George Hardesty, and Craig Kirchoff. He is also active as an arranger, with works published by Cimarron Music, BVD Press, and 360° Music. Professionally, Tim is Manager of Talent Development for Ariel Corporation in Mount Vernon, Ohio.",
      "conductor_photo": "",
      "band_section": "first",
      "contact_email": "timjameson1@gmail.com",
      "choice_pieces": [
        {
          "title": "Essay",
          "composer": "Edward Gregson"
        }
      ],
      "contest_draw_identifiers": ["1_E","1_HH"]
    },
    {
      "id": 33,
      "name": "Brass Band of Huntsville",
      "website": "https://www.brassbandofhuntsville.com/",
      "band_bio": "The Brass Band of Huntsville (BBoH) is proud to host the 2023 NABBA Championships. BBoH is a 30-piece brass and percussion ensemble that is based in the greater Huntsville area and draws its membership from across the State of Alabama. Offering casual, audience-friendly concerts that are both entertaining and educational, the band actively seeks to lead a musical renaissance as the original traditional brass band in the State of Alabama and to promote cultural enrichment, revitalization and arts awareness in the local community. BBoH performs a wide variety of music including classical, patriotic, jazz, Broadway and modern compositions written especially for the brass band genre, and aims to bridge the gap between popular and classical music.",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "Stephen Bulla",
      "conductor_bio": "Stephen Bulla began his musical instruction at age six, growing up in a musical household where his father played tuba and his mother played piano. He eventually graduated Magna Cum Laude from Berklee College of Music in Boston, where he studied trombone with Phil Wilson and Composition/Arranging with Herb Pomeroy. In 1980 he won an audition for the position of Staff Arranger to 'The President's Own' United States Marine Band and Chamber Orchestra in Washington DC. For the next thirty years he would provide musical scores for myriad White House events, beginning with the Reagan era until 2010. Working alongside film score legend John Williams he has transcribed music from 'Star Wars', 'Catch Me If You Can', and 'Close Encounters of the Third Kind' for performances by the Marine Band with the composer conducting. He has also scored music for the Discovery Channel ('Wings of the Luftwaffe' and 'Century of Flight') and the PBS television series 'In Performance At The White House.' On those occasions, his arrangements were performed by many artists including Sarah Vaughan, The Manhattan Transfer, Mel Torme, Doc Severinsen, Nell Carter, Shirley Jones, Larry Gatlin, and Jordan Sparks. His commissioned concert works are performed and recorded internationally.The Dutch, British, Swiss and New Zealand Brass Band Championship organizations have all commissioned test pieces from his pen. According to a recent ASCAP survey, his music has been used on the following television programs: CSI Miami, Cold Case, Jag, Joan of Arcadia, Without A Trace, Guiding Light, Survivor, 48 Hours, 60 Minutes, and Ren and Stimpy. Among many composer highlights was a commission from the Library of Congress to complete and orchestrate the last known manuscript march of John Philip Sousa, titled The Library of Congress March. Another major project was created for the 50th anniversary of the Apollo 11 lunar landing. For this event he was commissioned by the Brass Band of Huntsville (Alabama) to compose and conduct the premiere of the <em>Von Braun Suite</em> for band, narrator and NASA sourced video. On that occasion, held at the U.S. Space & Rocket Center, all living lunar astronauts were in attendance. As a conductor, for fifteen years he directed the National Capital Band (Washington DC), producing several CDs and touring Australia, New Zealand, Russia, and Scandinavia with that ensemble. He later served for thirteen years as music director of New England Brass Band and is presently music director for Brass Of The Potomac. As a frequent international band contest adjudicator, he received the President's Award in 2015 from the North American Brass Band Association. Stephen Bulla is an active member of ASCAP (American Society of Composers, Authors, and Publishers) and has received that organization's Performance Award annually since 1984. His published works can be found in the catalogs of Hal Leonard Music (USA and Europe), as well as in The Salvation Army's music publication catalog (UK).",
      "conductor_photo": "",
      "band_section": "second",
      "contact_email": "kent.eversmeyer@brassbandofhuntsville.com",
      "choice_pieces": [
        {
          "title": "Brass Triumphant",
          "composer": "Gareth Wood"
        }
      ],
      "contest_draw_identifiers": ["2_A","2_CC"]
    },
    {
      "id": 34,
      "name": "St. Louis Brass Band",
      "website": "https://www.stlbb.org/",
      "band_bio": "Founded in 1998, the Saint Louis Brass Band features some of the area’s finest brass musicians, educators, and students, who come together to perform classics, marches, jazz, and the very best contemporary brass band music. Acclaimed by the St. Louis Post-Dispatch as “one of the city’s newest treasures,” the STLBB has won award at NABBA and the US Open Bass Band Championships. Generous financial support has come from the Missouri Arts Council, Regional Arts Commission, Ameren Illinois, the Garvey Foundation, Boeing, and area music stores throughout the region In 2014 the St. Louis Academy Brass Band was established as part of the Educational Outreach Program. The Fall of 2017 saw the establishment of Brass Extravaganza!: two days of brass and percussion workshops, clinics, rehearsals, and performances for students Grades 8 through college level, all led by members of the Saint Louis Brass Band. Guest soloists with the Saint Louis Brass Band include Karin Bliznik (Principal Trumpet - St. Louis Symphony Orchestra), Gerry Pagano (Bass Trombone - St. Louis Symphony Orchestra), J.D. Shaw (Boston Brass co-founder and horn), Christine Brewer (Grammy award-winning soprano) and Demondrae Thurman (Professor of Euphonium, Indiana University).",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "John Bell",
      "conductor_bio": "Dr. John Bell has served as the Music Director for the St. Louis Brass Band since 2009 and serves on the NABBA Board. In addition to his work in the brass band arena, he is the newly appointed Director of Wind Ensemble at McKendree University, in Lebanon, Illinois, and Professor of Music Emeritus at Southern Illinois University Edwardsville, a role he held for 30 years.Dr. Bell is an elected member of the prestigious American Bandmasters Association and has been an invited clinician and adjudicator throughout the United States, Asia and Canada, for DCI, Music for All, the World Music Festival, and numerous championship events. Previous appointments include Music Director of the Rocky Mountain Brassworks Brass Band in Denver, Colorado, Associate Director of Bands at the University of Northern Colorado, Doctoral Conducting intern at the University of Illinois, and band director at Willowbrook and Rolling Meadows High Schools in the Chicago suburbs Ensembles under his direction have been selected for performance at the international conference of the World Association for Symphonic Bands and Ensembles in Chiayi City, Taiwan; the national convention of the Music Educators National Conference (now NAfME); divisional conferences of the Southwest and North-Central College Band Directors National Association; the state conferences of the Illinois Music Educators and Colorado Music Educators; and twice in New York City’s Carnegie Hall. He resides in Lebanon, Illinois, with his spouse, Dr. Jennifer Moder-Bell and their pup, Wiggles.",
      "conductor_photo": "",
      "band_section": "second",
      "contact_email": "stlouisbrassband@gmail.com",
      "choice_pieces": [
        {
          "title": "The Raid",
          "composer": "Oliver Waespi"
        }
      ],
      "contest_draw_identifiers": ["2_G","2_II"]
    },
    {
      "id": 35,
      "name": "Tampa Brass Band",
      "website": "https://www.tampabrassband.com/",
      "band_bio": "Established in 2019, the Tampa Brass Band consists of some of the Tampa Bay area’s most skilled brass and percussion performers. Performing exciting music from the brass band repertoire, as well as brass band arrangements of orchestral classics, the Tampa Brass Band presents an eclectic range of styles in high-level performances in venues throughout the Tampa Bay area.",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "Tina DiMeglio",
      "conductor_bio": "Tina DiMeglio is the Associate Director of Bands at the University of South Florida in Tampa, Florida. Dr. DiMeglio conducts the USF Symphonic Band and teaches courses in conducting and music education. She has served as the Music Director of the Tampa Brass Band since 2021. Recently, Dr. DiMeglio won first prize at the Inaugural Frederick Fennell International Conducting Competition, held in Modica, Italy in November 2021. She was a Conducting Fellow in the 2019 Midwest Clinic Reynolds Conducting Institute, and was also a recipient of the 2019 CBDNA Mike Moss Diversity Conducting Fellowship Study Grant.",
      "conductor_photo": "",
      "band_section": "second",
      "contact_email": "tampabrassband@gmail.com",
      "choice_pieces": [
        {
          "title": "Kingdom of Dragons",
          "composer": "Philip Harper"
        }
      ],
      "contest_draw_identifiers": ["2_B","2_HH"]
    },
    {
      "id": 36,
      "name": "East Central University Brass Band",
      "website": "",
      "band_bio": "The East Central University Brass Band was founded in January 2019 and is the only collegiate British-style brass band in the state of Oklahoma. The group performs frequently in the Ada, Oklahoma area and beyond. The band has performed at the 2019 Gateway Brass Band Festival in St Louis, the OkMEA Fall 2021 conference, and the South Central Regional Tuba-Euphonium Conference at Oklahoma State University. The group has also performed benefit concerts for Mama T’s Homeless Shelter in Ada, Oklahoma and performed at local elementary schools and churches. They made their NABBA debut in April 2022.",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "Jace T. Vickers",
      "conductor_bio": "Dr Jace T. Vickers is a dynamic performer and educator in demand throughout the US and abroad. Dr Vickers is a rare musician equally at home on both euphonium and tuba; accomplishments on euphonium include performances with the Colorado Symphony, award-winning performances with the OU Tuba-Euphonium Quartet, and solo appearances at the 2019 CMS International Conference in Ghent, Belgium. Notable accomplishments on tuba include Championship-winning performances at the North American Brass Band Championships in 2022 and a featured solo performance at the 2022 South Central Regional Tuba-Euphonium Conference at Oklahoma State University. As an arts education leader, Dr Vickers currently serves as Chair of the Department of Performing Arts, Assistant Director of Bands, and Assistant Professor of Music at East Central University in Ada, Oklahoma. Dr Vickers’ students have placed in competitions such as MTNA Competitions, the ECU Concerto Competition, the OkMEA Intercollegiate Honor Band, and have won positions with drum & bugle corps such as the Academy Drum & Bugle Corp, the Guardians Drum & Bugle Corp, the Troopers Drum & Bugle Corp, and the Cadets Drum & Bugle Corp. His students have also gone on to successful graduate study in the fields of music performance and conducting. Dr Vickers is a Mercer & Barker Performing Artist performing exclusively on Mercer & Barker tuba, euphonium, and baritone mouthpieces.",
      "conductor_photo": "",
      "band_section": "third",
      "contact_email": "jvickers@ecok.edu",
      "choice_pieces": [
        {
          "title": "Dark Side of the Moon",
          "composer": "Paul Lovatt-Cooper"
        }
      ],
      "contest_draw_identifiers": ["3_D"]
    },
    {
      "id": 36,
      "name": "Watson Brass Band",
      "website": "",
      "band_bio": "The Triangle Youth Brass Band, located in Raleigh, North Carolina, was formed in 1997 as an expansion of the Triangle Brass Band’s educational endeavors. The organization consists of four ensembles, the Triangle Youth “J. Perry Watson” Brass Band, Triangle Youth Brass Band, Triangle Youth Academy Brass Band, and Triangle Youth Percussion Ensemble, and serves over 100 of the Triangle’s most talented young musicians. The mission of the TYBB is to provide engaging, transformative musical experiences to the finest high school brass and percussion players through exceptional performance in the British Brass Band medium. Over the past two decades, the TYBB has grown into one of the premier youth brass band programs in the United States. The TYBB typically perform three concerts annually. Additionally, the groups often travel and perform outside the Triangle area of North Carolina. Recent tours have taken the bands to the North American Brass Band Association Championships, where the bands have earned First Place Honors in the Youth Championship Section in 2001, 2002, 2004, 2006, 2007, 2009, 2022, The Youth First Section from 2016-2022 and the Youth Open Section in 2022. The bands were featured performers at the Great American Brass Band Festival in 2003, the City of Greensboro’s Independence Day fireworks celebration in 2006 and 2008, and have performed with the Georgia Brass Band, U.S. Coast Guard Band, Dallas Brass, Presidio Brass, Triangle Wind Ensemble, and Concert Singers of Cary. The TYBB program is comprised of approximately 100 brass and percussion students and its members perform strictly on British Brass Band instrumentation.",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "Jesse Rackley",
      "conductor_bio": "Jesse Rackley is the Artistic Director of the Triangle Youth Brass Bands and conductor of the Watson Brass Band, a 30 piece British style brass band comprised of some of the most talented high school brass and percussion players in the Central North Carolina region. Previously, he served as Music Director of the Triangle Youth Brass Ensemble from 2009-2013. Under his direction, the Triangle Youth Brass Band program has expanded from two to three brass bands as well as a percussion ensemble. Currently located in Raleigh, NC, Jesse is an accomplished tenor trombone and euphonium performer and educator. He is the Principal Trombone of the Fayetteville Symphony and Tar River Philharmonic and second trombone with the Carolina Philharmonic. He performs regularly with the North Carolina Symphony and has performed with the Virginia Symphony, Charleston Symphony, Wilmington symphony, Chamber Orchestra of the Triangle, and Eastern Music Festival Orchestra. As a soloist, Jesse has been featured with the Triangle Brass Band, Triangle Youth Brass Band, and 440th US Army Band. Jesse was the winner of the 2009 and 2007 Southeast Regional Tuba Euphonium Conference’s solo euphonium competition, runner up in the 2002 International Tuba Euphonium Conference’s Young Artist solo competition, and semi-finalist in the 2002 Leonard Falcone International Tuba Euphonium Competition. As a teacher, Jesse maintains a large and active private studio throughout central North Carolina. His students consistently receive top honors in the NC All-District and All-State Bands. Jesse is in frequent demand as a soloist, clinician, and adjudicator throughout North Carolina.",
      "conductor_photo": "",
      "band_section": "youth_championship",
      "contact_email": "youthband@trianglebrass.org",
      "choice_pieces": [
        {
          "title": "Turris Fortissima",
          "composer": "Steven Ponsford"
        }
      ],
      "contest_draw_identifiers": ["YC_A"]
    },
    {
      "id": 37,
      "name": "Triangle Youth Brass Band",
      "website": "",
      "band_bio": "The Triangle Youth Brass Band, located in Raleigh, North Carolina, was formed in 1997 as an expansion of the Triangle Brass Band’s educational endeavors. The organization consists of four ensembles, the Triangle Youth 'J. Perry Watson' Brass Band, Triangle Youth Brass Band, Triangle Youth Academy Brass Band, and Triangle Youth Percussion Ensemble, and serves over 100 of the Triangle’s most talented young musicians. The mission of the TYBB is to provide engaging, transformative musical experiences to the finest high school brass and percussion players through exceptional performance in the British Brass Band medium. Over the past two decades, the TYBB has grown into one of the premier youth brass band programs in the United States. The TYBB typically perform three concerts annually. Additionally, the groups often travel and perform outside the Triangle area of North Carolina. Recent tours have taken the bands to the North American Brass Band Association Championships, where the bands have earned First Place Honors in the Youth Championship Section in 2001, 2002, 2004, 2006, 2007, 2009, 2022, The Youth First Section from 2016-2022 and the Youth Open Section in 2022. The bands were featured performers at the Great American Brass Band Festival in 2003, the City of Greensboro’s Independence Day fireworks celebration in 2006 and 2008, and have performed with the Georgia Brass Band, U.S. Coast Guard Band, Dallas Brass, Presidio Brass, Triangle Wind Ensemble, and Concert Singers of Cary. The TYBB program is comprised of approximately 100 brass and percussion students and its members perform strictly on British Brass Band instrumentation.",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "Matt Edwards",
      "conductor_bio": "Matt Edwards is Director of the Triangle Youth Brass Band. He has been the Director of Bands at Fuquay-Varina High School in Fuquay-Varina, North Carolina since 2002. He was previously Director of Bands at Triton High School, Erwin Middle School and Coats-Erwin Middle School. During his tenure at Triton High School the Marching Hawks built a successful competitive marching band while developing a reputation for musical excellence in concert ensembles. The Fuquay-Varina Marching Bengals, Symphonic Band, Wind Ensemble and chamber ensembles have continued a tradition of excellence under his direction. The Marching Bengals have earned more than 80 caption and class awards over the last five years during competition performances in Georgia, Virginia, Maryland and North Carolina. The Symphonic Band and Wind Ensemble receive Excellent and Superior ratings at District MPA. Mr. Edwards is active as a freelance trombonist, performing regularly with the Triangle Brass Band. He has also performed with the North Carolina Wind Orchestra, Fayetteville Symphony Orchestra, Cape Fear Regional Theater, Greensboro Philharmonia and the Highland Brass Quintet Mr. Edwards received his Bachelor of Music Education degree in 1996 from the University of North Carolina at Greensboro. He is a member of the American School Band Director’s Association (ASBDA), North Carolina Music Educator’s Association, Music Educator’s National Conference, Central District Band Director’s Association (CDBA) and the North American Brass Band Association (NABBA). He has served as President of CDBA and was honored as that organization’s Band Director of the Year in 2008.",
      "conductor_photo": "",
      "band_section": "youth_first",
      "contact_email": "youthband@trianglebrass.org",
      "choice_pieces": [
        {
          "title": "Corineus",
          "composer": "Christopher Bond"
        }
      ],
      "contest_draw_identifiers": ["Y1_A"]
    },
    {
      "id": 38,
      "name": "Triangle Youth Academy Brass Band",
      "website": "",
      "band_bio": "The Triangle Youth Brass Band, located in Raleigh, North Carolina, was formed in 1997 as an expansion of the Triangle Brass Band’s educational endeavors. The organization consists of four ensembles, the Triangle Youth “J. Perry Watson” Brass Band, Triangle Youth Brass Band, Triangle Youth Academy Brass Band, and Triangle Youth Percussion Ensemble, and serves over 100 of the Triangle’s most talented young musicians. The mission of the TYBB is to provide engaging, transformative musical experiences to the finest high school brass and percussion players through exceptional performance in the British Brass Band medium. Over the past two decades, the TYBB has grown into one of the premier youth brass band programs in the United States. The TYBB typically perform three concerts annually. Additionally, the groups often travel and perform outside the Triangle area of North Carolina. Recent tours have taken the bands to the North American Brass Band Association Championships, where the bands have earned First Place Honors in the Youth Championship Section in 2001, 2002, 2004, 2006, 2007, 2009, 2022, The Youth First Section from 2016-2022 and the Youth Open Section in 2022. The bands were featured performers at the Great American Brass Band Festival in 2003, the City of Greensboro’s Independence Day fireworks celebration in 2006 and 2008, and have performed with the Georgia Brass Band, U.S. Coast Guard Band, Dallas Brass, Presidio Brass, Triangle Wind Ensemble, and Concert Singers of Cary. The TYBB program is comprised of approximately 100 brass and percussion students and its members perform strictly on British Brass Band instrumentation.",
      "band_photo": "",
      "band_logo": "",
      "conductor_name": "Robin Gorham",
      "conductor_bio": "Robin Gorham is the Director of the Triangle Youth Academy Brass Band (formerly known as the Triangle Youth Brass Ensemble) and has taught band for 20 years. She received her undergraduate music degree from the University of North Carolina at Chapel Hill and her Masters of Music from the University of North Carolina at Greensboro. In 2003 she earned National Board Certification; in 2005 she was named “Teacher of the Year” for Coats-Erwin Middle School; and she earned the “Award of Excellence” from the Southeastern Band Directors Association in 2009. She is a member of the North Carolina Music Educator’s Association, Music Educator’s National conference, and the North American Brass Band Assocation. When not at Fuquay-Varina Middle, Ms. Gorham is in demand as a guest conductor, concert band clinician, and adjudicator throughout North Carolina. Ms. Gorham maintains a private horn studio in the Fuquay-Varina area and is the brass instructor for the Fuquay-Varina High School Marching Band. She is an active freelance horn player, performing regularly with the Triangle Brass Band, the NC Brass, and the Triangle Wind Ensemble. She and her husband, Matt Edwards, reside in Fuquay-Varina.",
      "conductor_photo": "",
      "band_section": "youth_open",
      "contact_email": "youthband@trianglebrass.org",
      "choice_pieces": [
        {
          "title": "Anglian Dances",
          "composer": "Alan Fernie"
        },{
          "title": "Canticles",
          "composer": "James Curnow"
        }
      ],
      "contest_draw_identifiers": ["YO_A"]
    }
  ],
  
  "performance_schedule": {
    "2023-04-21": [
      {
        "band_id": 6,
        "band_draw": "1_A",
        "stage": "Concert Hall",
        "performance_times": {            
            "start_timestamp": "2023-04-21T13:00:00.000-05:00",
            "end_timestamp": "2023-04-21T13:25:00.000-05:00"
          }
        
      },{
          "band_id": 22,
          "band_draw": "1_B",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T13:25:00-05:00",
              "end_timestamp": "2023-04-21T13:50:00.000-05:00"
            }
        },{
          "band_id": 10,
          "band_draw": "1_C",          
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T13:50:00.000-05:00",
              "end_timestamp": "2023-04-21T14:15:00.000-05:00"
            }
        },{
          "band_id": 2,
          "band_draw": "1_D",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T14:15:00.000-05:00",
              "end_timestamp": "2023-04-21T14:40:00.000-05:00"
            }
        },{
          "band_id": 32,
          "band_draw": "1_E",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T14:40:00.000-05:00",
              "end_timestamp": "2023-04-21T15:05:00.000-05:00"
            }
        },{
          "band_id": 15,
          "band_draw": "1_F",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T15:05:00.000-05:00",
              "end_timestamp": "2023-04-21T15:30:00.000-05:00"
            }
        },{
          "band_id": 26,
          "band_draw": "1_G",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T15:30:00.000-05:00",
              "end_timestamp": "2023-04-21T15:55:00.000-05:00"
            }
        },{
          "band_id": 7,
          "band_draw": "1_H",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T15:55:00.000-05:00",
              "end_timestamp": "2023-04-21T16:20:00.000-05:00"
            }
        },{
          "band_id": 31,
          "band_draw": "1_I",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T16:20:00.000-05:00",
              "end_timestamp": "2023-04-21T16:45:00.000-05:00"
            }
        },
      {
        "band_id": 20,
        "band_draw": "C_A",
        "stage": "Concert Hall",
        "performance_times": {            
            "start_timestamp": "2023-04-21T17:00:00.000-05:00",
            "end_timestamp": "2023-04-21T17:30:00.000-05:00"
          }
      },{
          "band_id": 17,
          "band_draw": "C_B",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T17:30:00.000-05:00",
              "end_timestamp": "2023-04-21T18:00:00.000-05:00"
            }
        },{
          "band_id": 29,
          "band_draw": "C_C",          
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T18:00:00.000-05:00",
              "end_timestamp": "2023-04-21T18:30:00.000-05:00"
            }
        },{
          "band_id": 27,
          "band_draw": "C_D",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T18:30:00.000-05:00",
              "end_timestamp": "2023-04-21T19:00:00.000-05:00"
            }
        },{
          "band_id": 19,
          "band_draw": "C_E",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T19:00:00.000-05:00",
              "end_timestamp": "2023-04-21T19:30:00.000-05:00"
            }
        },{
          "band_id": 9,
          "band_draw": "C_F",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T19:30:00.000-05:00",
              "end_timestamp": "2023-04-21T20:00:00.000-05:00"
            }
        },{
          "band_id": 1,
          "band_draw": "C_G",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T20:00:00.000-05:00",
              "end_timestamp": "2023-04-21T20:30:00.000-05:00"
            }
        },{
          "band_id": 30,
          "band_draw": "C_H",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T20:30:00.000-05:00",
              "end_timestamp": "2023-04-21T21:00:00.000-05:00"
            }
        },{
          "band_id": 4,
          "band_draw": "C_I",
          "stage": "Concert Hall",
          "performance_times": 
            {
              "start_timestamp": "2023-04-21T21:00:00.000-05:00",
              "end_timestamp": "2023-04-21T21:30:00.000-05:00"
            }
          },{
            "band_id": 33,
            "band_draw": "2_A",
            "stage": "Playhouse",
            "performance_times": {            
                "start_timestamp": "2023-04-21T14:00:00.000-05:00",
                "end_timestamp": "2023-04-21T14:25:00.000-05:00"
              }
            
          },{
              "band_id": 35,
              "band_draw": "2_B",
              "stage": "Playhouse",
              "performance_times": 
                {
                  "start_timestamp": "2023-04-21T14:25:00.000-05:00",
                  "end_timestamp": "2023-04-21T14:50:00.000-05:00"
                }
            },{
              "band_id": 12,
              "band_draw": "2_C",          
              "stage": "Playhouse",
              "performance_times": 
                {
                  "start_timestamp": "2023-04-21T14:50:00.000-05:00",
                  "end_timestamp": "2023-04-21T15:15:00.000-05:00"
                }
            },{
              "band_id": 16,
              "band_draw": "2_D",
              "stage": "Playhouse",
              "performance_times": 
                {
                  "start_timestamp": "2023-04-21T15:15:00.000-05:00",
                  "end_timestamp": "2023-04-21T15:40:00.000-05:00"
                }
            },{
              "band_id": 14,
              "band_draw": "2_E",
              "stage": "Playhouse",
              "performance_times": 
                {
                  "start_timestamp": "2023-04-21T15:40:00.000-05:00",
                  "end_timestamp": "2023-04-21T16:05:00.000-05:00"
                }
            },{
              "band_id": 5,
              "band_draw": "2_F",
              "stage": "Playhouse",
              "performance_times": 
                {
                  "start_timestamp": "2023-04-21T16:05:00.000-05:00",
                  "end_timestamp": "2023-04-21T16:30:00.000-05:00"
                }
            },{
              "band_id": 34,
              "band_draw": "2_G",
              "stage": "Playhouse",
              "performance_times": 
                {
                  "start_timestamp": "2023-04-21T16:30:00.000-05:00",
                  "end_timestamp": "2023-04-21T16:55:00.000-05:00"
                }
            },{
              "band_id": 18,
              "band_draw": "2_H",
              "stage": "Playhouse",
              "performance_times": 
                {
                  "start_timestamp": "2023-04-21T17:55:00.000-05:00",
                  "end_timestamp": "2023-04-21T17:20:00.000-05:00"
                }
            },{
              "band_id": 13,
              "band_draw": "2_I",
              "stage": "Playhouse",
              "performance_times": 
                {
                  "start_timestamp": "2023-04-21T17:20:00.000-05:00",
                  "end_timestamp": "2023-04-21T17:45:00.000-05:00"
                }
            }
      ],
      "2023-04-22": [
        {
          "band_id": 25,
          "band_draw": "3_A",
          "stage": "Playhouse",
          "performance_times": {            
              "start_timestamp": "2023-04-22T09:00:00.000-05:00",
              "end_timestamp": "2023-04-22T09:35:00.000-05:00"
            }
          
        },{
            "band_id": 21,
            "band_draw": "3_B",
            "stage": "Playhouse",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T09:35:00.000-05:00",
                "end_timestamp": "2023-04-22T10:10:00.000-05:00"
              }
          },{
            "band_id": 23,
            "band_draw": "3_C",          
            "stage": "Playhouse",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T10:10:00.000-05:00",
                "end_timestamp": "2023-04-22T10:45:00.000-05:00"
              }
          },{
            "band_id": 36,
            "band_draw": "3_D",
            "stage": "Playhouse",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T10:45:00.000-05:00",
                "end_timestamp": "2023-04-22T11:20:00.000-05:00"
              }
          },{
            "band_id": 3,
            "band_draw": "3_E",
            "stage": "Playhouse",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T11:20:00.000-05:00",
                "end_timestamp": "2023-04-22T11:55:00.000-05:00"
              }
          },{
            "band_id": 28,
            "band_draw": "3_F",
            "stage": "Playhouse",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T11:55:00.000-05:00",
                "end_timestamp": "2023-04-22T12:30:00.000-05:00"
              }
          },{
            "band_id": 11,
            "band_draw": "3_G",
            "stage": "Playhouse",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T12:30:00.000-05:00",
                "end_timestamp": "2023-04-22T13:05:00.000-05:00"
              }
          },{
            "band_id": 38,
            "band_draw": "YO_A",
            "stage": "Playhouse",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T13:20:00.000-05:00",
                "end_timestamp": "2023-04-22T13:45:00.000-05:00"
              }
          },{
            "band_id": 37,
            "band_draw": "Y1_A",
            "stage": "Playhouse",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T13:45:00.000-05:00",
                "end_timestamp": "2023-04-22T14:10:00.000-05:00"
              }
          },{
            "band_id": 5,
            "band_draw": "2_AA",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T09:05:00.000-05:00",
                "end_timestamp": "2023-04-22T09:30:00.000-05:00"
              }
          },{
            "band_id": 16,
            "band_draw": "2_BB",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T09:30:00.000-05:00",
                "end_timestamp": "2023-04-22T09:55:00.000-05:00"
              }
          },{
            "band_id": 33,
            "band_draw": "2_CC",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T09:55:00.000-05:00",
                "end_timestamp": "2023-04-22T10:20:00.000-05:00"
              }
          },{
            "band_id": 14,
            "band_draw": "2_DD",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T10:20:00.000-05:00",
                "end_timestamp": "2023-04-22T10:45:00.000-05:00"
              }
          },{
            "band_id": 12,
            "band_draw": "2_EE",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T10:45:00.000-05:00",
                "end_timestamp": "2023-04-22T11:10:00.000-05:00"
              }
          },{
            "band_id": 13,
            "band_draw": "2_FF",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T11:10:00.000-05:00",
                "end_timestamp": "2023-04-22T11:35:00.000-05:00"
              }
          },{
            "band_id": 18,
            "band_draw": "2_GG",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T11:35:00.000-05:00",
                "end_timestamp": "2023-04-22T12:00:00.000-05:00"
              }
          },{
            "band_id": 35,
            "band_draw": "2_HH",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T12:00:00.000-05:00",
                "end_timestamp": "2023-04-22T12:25:00.000-05:00"
              }
          },{
            "band_id": 34,
            "band_draw": "2_II",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T12:25:00.000-05:00",
                "end_timestamp": "2023-04-22T12:50:00.000-05:00"
              }
          },{
            "band_id": 2,
            "band_draw": "1_AA",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T13:05:00.000-05:00",
                "end_timestamp": "2023-04-22T13:30:00.000-05:00"
              }
          },{
            "band_id": 10,
            "band_draw": "1_BB",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T13:30:00.000-05:00",
                "end_timestamp": "2023-04-22T13:55:00.000-05:00"
              }
          },{
            "band_id": 6,
            "band_draw": "1_CC",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T13:55:00.000-05:00",
                "end_timestamp": "2023-04-22T14:20:00.000-05:00"
              }
          },{
            "band_id": 26,
            "band_draw": "1_DD",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T14:20:00.000-05:00",
                "end_timestamp": "2023-04-22T14:45:00.000-05:00"
              }
          },{
            "band_id": 22,
            "band_draw": "1_EE",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T14:45:00.000-05:00",
                "end_timestamp": "2023-04-22T15:10:00.000-05:00"
              }
          },{
            "band_id": 22,
            "band_draw": "1_FF",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T15:10:00.000-05:00",
                "end_timestamp": "2023-04-22T15:35:00.000-05:00"
              }
          },{
            "band_id": 7,
            "band_draw": "1_GG",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-21T15:35:00.000-05:00",
                "end_timestamp": "2023-04-22T16:00:00.000-05:00"
              }
          },{
            "band_id": 32,
            "band_draw": "1_HH",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T16:00:00.000-05:00",
                "end_timestamp": "2023-04-22T16:25:00.000-05:00"
              }
          },{
            "band_id": 31,
            "band_draw": "1_II",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T16:25:00.000-05:00",
                "end_timestamp": "2023-04-22T16:50:00.000-05:00"
              }
          },{
            "band_id": 4,
            "band_draw": "C_AA",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T17:00:00.000-05:00",
                "end_timestamp": "2023-04-22T17:30:00.000-05:00"
              }
          },{
            "band_id": 19,
            "band_draw": "C_BB",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T17:30:00.000-05:00",
                "end_timestamp": "2023-04-22T18:000:00.000-05:00"
              }
          },{
            "band_id": 9,
            "band_draw": "C_CC",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T18:00:00.000-05:00",
                "end_timestamp": "2023-04-22T18:30:00.000-05:00"
              }
          },{
            "band_id": 1,
            "band_draw": "C_DD",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T18:30:00.000-05:00",
                "end_timestamp": "2023-04-22T19:00:00.000-05:00"
              }
          },{
            "band_id": 17,
            "band_draw": "C_EE",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T19:00:00.000-05:00",
                "end_timestamp": "2023-04-22T19:30:00.000-05:00"
              }
          },{
            "band_id": 20,
            "band_draw": "C_FF",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T19:30:00.000-05:00",
                "end_timestamp": "2023-04-22T20:00:00.000-05:00"
              }
          },{
            "band_id": 27,
            "band_draw": "C_GG",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T20:00:00.000-05:00",
                "end_timestamp": "2023-04-22T20:30:00.000-05:00"
              }
          },{
            "band_id": 29,
            "band_draw": "C_HH",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T20:30:00.000-05:00",
                "end_timestamp": "2023-04-22T21:00:00.000-05:00"
              }
          },{
            "band_id": 30,
            "band_draw": "C_II",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T21:00:00.000-05:00",
                "end_timestamp": "2023-04-22T14:21:30.000-05:00"
              }
          },{
            "band_id": 36,
            "band_draw": "YC_A",
            "stage": "Concert Hall",
            "performance_times": 
              {
                "start_timestamp": "2023-04-22T21:30:00.000-05:00",
                "end_timestamp": "2023-04-22T22:00:00.000-05:00"
              }
          }
        ]
    
  },
  "venue_details": {
    "name": "The Von Braun Center",
    "image": "https://assets.simpleviewinc.com/simpleview/image/upload/c_fill,h_640,q_50,w_1280/v1/clients/vonbrauncenter/180810_VBCC_002_X3_1eee8497-7782-4983-9e86-56fb4cee24e8.jpg",
    "address": "700 Monroe Street, Huntsville, Alabama 35801",
    "map_file": "",
    "description": "NABBA is proud to once again be hosting the contest at the Von Braun Center. The Von Braun Center, named for rocket pioneer Dr. Wernher Von Braun, is located in the heart of historic downtown Huntsville, Alabama. This multi-purpose facility is equipped to accommodate major conferences, conventions, concerts, Broadway performances, ballets, symphonies, a full range of sporting events and so much more! Huntsville is a high-tech city with a history of Southern hospitality. The VBC is just a short drive from the International Airport and convenient to area hotels. The Von Braun Center is a turn-key facility with a team of experienced professionals ready to guarantee the success of your event."
  },
  "partner_details": [
    {
      "image_src": "https://nabba.org/wp-content/uploads/2019/05/NabbaNew-1.png",
      "name": "North American Brass Band Association",
      "link": "https://nabba.org"
    },
    {
      "image_src": "",
      "name": "Patrick Oliverio Studios",
      "link": "https://www.patrickoliverio.com/videos"
    }
  ]
}